clj-forex.org
#+TITLE: CLJ-FOREX
#+Author: Seth Burleigh
#+Babel: :comments link :noweb yes :mkdirp yes
             
* Introduction
** What is forex?
Forex is a currency trading market. But you probably know all about forex, since you're here! If not, read up on it! \\
+ [[http://en.wikipedia.org/wiki/Foreign_exchange_market][Wiki article - OK]]
+ [[http://www.fxcm.com/metatrader.jsp][FXCM Retail Broker Free Metatarder Terminal -  get demo account and see what forex trading is first hand!]]
** What is clj-forex?
Clj-forex is an in progress effort to create a non-graphical backend to various forex trading backends. Right now Metatrader is the focus. 
The ultimate goal of clj-forex is to create a robust library to allow the creation of EA (expert advisors) in the scripting language clojure. Expert advisors
are programs which automatically trade the market, performing sell/buy orderes, changing stoplosses, using technical indicators, etc. They are useful for
both automating parts of manual trading systems (performing trailing stops, expiration of market orders) and also for full out automated trading.

Indicators will be calculated java side using price bars retrieved from the backends. Integration of indicator data to various gui backends (i.e. at this time,
Metatrader) will be supported. The only purpose of the forex backend is to allow access to spreads, current price, ability to buy/sell, etc. 
** The Difference
Im not sure why noone has done this before, but integration of a scripting language to create eas is, in my opinion, vital. 
Integration of a lisp-like dialect, like clojure, will allow much more rapid creation and prototyping of eas. 
This combined with easy access to any java library (clojure is implemented on the java virtual machine) makes for a winning combination! 
Things like neural networks, database, and other such ‘advanced’ concepts can now be much more easily integrated than if we had used [[http://book.mql4.com/][mql4]].

Its like an artist! Give an artist more efficient tools in the toolbox and who knows what can be created! [And clojure is fun to learn anyways!]
** Where's the code??
This file is the code (clojure, anyways). The code is untangled using the
keystroke C-c C-v t in emacs when this file is open. While currently most
of the code is simply in the Code section, it will all eventually be explained
in the [[http://groups.google.com/group/clojure/browse_thread/thread/664a1d305f32ab90][literate programming]] manner.
* Development Tools
org-mode in emacs + babel is used. Currently code is one ns per one code block
format. Therefore, i use the below code, along with the latest git repository
for org-mode (needed!). I then hit f8 to detangle all my changes to my org file.
f9 can be used to jump from source code to location in org file. 
#+begin_src emacs-lisp
  
  (defvar clj-forex-file "/home/seth/Dropbox/.rep/clj-forex/clj-forex.org")
  
  
  (defmacro with-file (file &rest body)
    "open up file in a buffer, and set current buffer to it"
    `(with-current-buffer (find-file-noselect ,file t) ,@body))
  
  (defun out-files (org-file)
    (let (args)
      (org-babel-map-src-blocks org-file
        (let ((tangle-file (with-temp-buffer
                             (insert header-args)
                             (goto-char (point-min))
                             (if (re-search-forward ":tangle[ ]+\\([^ ]+\\)" nil t)
                                 (match-string 1)
                               nil))))
          (when tangle-file (push tangle-file args))))
      args))
  
  (defmacro with-cd (dir &rest body)
    (let ((current (gensym)))
      `(let ((,current default-directory))
         (cd ,dir)
         (unwind-protect (progn ,@body) (cd default-directory)))))
  
  ;;TODO rever buffers when detangle/tangle?
  (defun detangle ()
    (interactive)
    (save-excursion
      (let* ((org-file clj-forex-file)
             (out (out-files org-file))
             (amount 0)) 
        (with-cd (file-name-directory org-file)
                 (dolist (file out)
                   (with-file
                    file
                    (goto-char (truncate (/ (+ (point-min) (point-max)) 2)))
                    (let ((detangled (org-babel-detangle)))
                      (if (= detangled 0) (progn (message "failed on %s" file)
                                                 (sleep-for 2)))
                      (incf amount detangled)))))
        (message "Detangled %s source blocks/ %s" amount (length out)))))
  (global-set-key (kbd "<f8>") 'detangle)
  (global-set-key (kbd "<f9>") 'org-babel-tangle-jump-to-org)
  (setq org-src-fontify-natively t)
#+end_src

Given the tangled output of the source files, which basically tags the
code so that it can detangle it and jump back to the org file, we can
technically work in something other than emacs if we have a clojure tool
to detangle and tangle. However, this is not yet implemented. Also, it is planned
to give noweb support for babel so that i can break up the blocks.

Yes, currently it is not very development start friendly. That will change!
* From Ideas to Implementation - Metatrader Backend
* Code 
