clj-forex.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>CLJ-FOREX</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-02-20 12:28:25 CST"/>
<meta name="author" content="Seth Burleigh"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>
<div id="content">

<h1 class="title">CLJ-FOREX</h1>



<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Introduction </a>
<ul>
<li><a href="#sec-1_1">1.1 What is forex? </a></li>
<li><a href="#sec-1_2">1.2 What is clj-forex? </a></li>
<li><a href="#sec-1_3">1.3 The Difference </a></li>
<li><a href="#sec-1_4">1.4 Where's the code?? </a></li>
</ul>
</li>
<li><a href="#sec-2">2 Development Tools </a></li>
<li><a href="#sec-3">3 From Ideas to Implementation - Metatrader Backend </a></li>
<li><a href="#sec-4">4 Code </a>
<ul>
<li><a href="#sec-4_1">4.1 Project </a></li>
<li><a href="#sec-4_2">4.2 Util </a>
<ul>
<li><a href="#sec-4_2_1">4.2.1 ThirdParty </a></li>
<li><a href="#sec-4_2_2">4.2.2 CLJ </a></li>
<li><a href="#sec-4_2_3">4.2.3 Core </a></li>
<li><a href="#sec-4_2_4">4.2.4 General </a></li>
<li><a href="#sec-4_2_5">4.2.5 Log </a></li>
<li><a href="#sec-4_2_6">4.2.6 Fiber </a></li>
<li><a href="#sec-4_2_7">4.2.7 Spawn </a></li>
<li><a href="#sec-4_2_8">4.2.8 ZMQ </a></li>
<li><a href="#sec-4_2_9">4.2.9 GUI </a></li>
<li><a href="#sec-4_2_10">4.2.10 Devel </a></li>
</ul>
</li>
<li><a href="#sec-4_3">4.3 Backend </a>
<ul>
<li><a href="#sec-4_3_1">4.3.1 MQL Socket Service </a></li>
</ul>
</li>
<li><a href="#sec-4_4">4.4 Module </a>
<ul>
<li><a href="#sec-4_4_1">4.4.1 Account </a></li>
<li><a href="#sec-4_4_2">4.4.2 Ea </a></li>
<li><a href="#sec-4_4_3">4.4.3 Error </a></li>
<li><a href="#sec-4_4_4">4.4.4 Indicator </a></li>
</ul>
</li>
<li><a href="#sec-4_5">4.5 Interface </a></li>
<li><a href="#sec-4_6">4.6 User </a></li>
<li><a href="#sec-4_7">4.7 Templates </a></li>
<li><a href="#sec-4_8">4.8 Examples </a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction </h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1_1" class="outline-3">
<h3 id="sec-1_1"><span class="section-number-3">1.1</span> What is forex? </h3>
<div class="outline-text-3" id="text-1_1">

<p>Forex is a currency trading market. But you probably know all about forex, since you're here! If not, read up on it! <br/>
</p><ul>
<li>
<a href="http://en.wikipedia.org/wiki/Foreign_exchange_market">Wiki article - OK</a>
</li>
<li>
<a href="http://www.fxcm.com/metatrader.jsp">FXCM Retail Broker Free Metatarder Terminal -  get demo account and see what forex trading is first hand!</a>
</li>
</ul>


</div>

</div>

<div id="outline-container-1_2" class="outline-3">
<h3 id="sec-1_2"><span class="section-number-3">1.2</span> What is clj-forex? </h3>
<div class="outline-text-3" id="text-1_2">

<p>Clj-forex is an in progress effort to create a non-graphical backend to various forex trading backends. Right now Metatrader is the focus. 
The ultimate goal of clj-forex is to create a robust library to allow the creation of EA (expert advisors) in the scripting language clojure. Expert advisors
are programs which automatically trade the market, performing sell/buy orderes, changing stoplosses, using technical indicators, etc. They are useful for
both automating parts of manual trading systems (performing trailing stops, expiration of market orders) and also for full out automated trading.
</p>
<p>
Indicators will be calculated java side using price bars retrieved from the backends. Integration of indicator data to various gui backends (i.e. at this time,
Metatrader) will be supported. The only purpose of the forex backend is to allow access to spreads, current price, ability to buy/sell, etc. 
</p></div>

</div>

<div id="outline-container-1_3" class="outline-3">
<h3 id="sec-1_3"><span class="section-number-3">1.3</span> The Difference </h3>
<div class="outline-text-3" id="text-1_3">

<p>Im not sure why noone has done this before, but integration of a scripting language to create eas is, in my opinion, vital. 
Integration of a lisp-like dialect, like clojure, will allow much more rapid creation and prototyping of eas. 
This combined with easy access to any java library (clojure is implemented on the java virtual machine) makes for a winning combination! 
Things like neural networks, database, and other such ‘advanced’ concepts can now be much more easily integrated than if we had used <a href="http://book.mql4.com/">mql4</a>.
</p>
<p>
Its like an artist! Give an artist more efficient tools in the toolbox and who knows what can be created! [And clojure is fun to learn anyways!]
</p></div>

</div>

<div id="outline-container-1_4" class="outline-3">
<h3 id="sec-1_4"><span class="section-number-3">1.4</span> Where's the code?? </h3>
<div class="outline-text-3" id="text-1_4">

<p>This file is the code (clojure, anyways). The code is untangled using the
keystroke C-c C-v t in emacs when this file is open. While currently most
of the code is simply in the Code section, it will all eventually be explained
in the <a href="http://groups.google.com/group/clojure/browse_thread/thread/664a1d305f32ab90">literate programming</a> manner.
</p></div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Development Tools </h2>
<div class="outline-text-2" id="text-2">

<p>org-mode in emacs + babel is used. Currently code is one ns per one code block
format. Therefore, i use the below code, along with the latest git repository
for org-mode (needed!). I then hit f8 to detangle all my changes to my org file.
f9 can be used to jump from source code to location in org file. 
</p>


<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">defvar</span> <span style="color: #b8860b;">clj-forex-file</span> <span style="color: #bc8f8f;">"/home/seth/Dropbox/.rep/clj-forex/clj-forex.org"</span>)


(<span style="color: #a020f0;">defmacro</span> <span style="color: #0000ff;">with-file</span> (file <span style="color: #228b22;">&amp;rest</span> body)
  <span style="color: #bc8f8f;">"open up file in a buffer, and set current buffer to it"</span>
  `(<span style="color: #a020f0;">with-current-buffer</span> (find-file-noselect ,file t) ,@body))

(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">out-files</span> (org-file)
  (<span style="color: #a020f0;">let</span> (args)
    (org-babel-map-src-blocks org-file
      (<span style="color: #a020f0;">let</span> ((tangle-file (<span style="color: #a020f0;">with-temp-buffer</span>
                           (insert header-args)
                           (goto-char (point-min))
                           (<span style="color: #a020f0;">if</span> (re-search-forward <span style="color: #bc8f8f;">":tangle[ ]+</span><span style="color: #bc8f8f; font-weight: bold;">\\</span><span style="color: #bc8f8f; font-weight: bold;">(</span><span style="color: #bc8f8f;">[</span><span style="color: #bc8f8f;">^</span><span style="color: #bc8f8f;"> ]+</span><span style="color: #bc8f8f; font-weight: bold;">\\</span><span style="color: #bc8f8f; font-weight: bold;">)</span><span style="color: #bc8f8f;">"</span> nil t)
                               (match-string 1)
                             nil))))
        (<span style="color: #a020f0;">when</span> tangle-file (push tangle-file args))))
    args))

(<span style="color: #a020f0;">defmacro</span> <span style="color: #0000ff;">with-cd</span> (dir <span style="color: #228b22;">&amp;rest</span> body)
  (<span style="color: #a020f0;">let</span> ((current (gensym)))
    `(<span style="color: #a020f0;">let</span> ((,current default-directory))
       (cd ,dir)
       (<span style="color: #a020f0;">unwind-protect</span> (<span style="color: #a020f0;">progn</span> ,@body) (cd default-directory)))))

<span style="color: #b22222;">;;</span><span style="color: #b22222;">TODO rever buffers when detangle/tangle?
</span>(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">detangle</span> ()
  (interactive)
  (<span style="color: #a020f0;">save-excursion</span>
    (<span style="color: #a020f0;">let*</span> ((org-file clj-forex-file)
           (out (out-files org-file))
           (amount 0)) 
      (with-cd (file-name-directory org-file)
               (<span style="color: #a020f0;">dolist</span> (file out)
                 (with-file
                  file
                  (goto-char (truncate (/ (+ (point-min) (point-max)) 2)))
                  (<span style="color: #a020f0;">let</span> ((detangled (org-babel-detangle)))
                    (<span style="color: #a020f0;">if</span> (= detangled 0) (<span style="color: #a020f0;">progn</span> (message <span style="color: #bc8f8f;">"failed on %s"</span> file)
                                             ))
                    (incf amount detangled)))))
      (message <span style="color: #bc8f8f;">"Detangled %s source blocks/ %s"</span> amount (length out)))))
(global-set-key (kbd <span style="color: #bc8f8f;">"&lt;f8&gt;"</span>) 'detangle)
(global-set-key (kbd <span style="color: #bc8f8f;">"&lt;f9&gt;"</span>) 'org-babel-tangle-jump-to-org)
(setq org-src-fontify-natively t)
</pre>



<p>
Given the tangled output of the source files, which basically tags the
code so that it can detangle it and jump back to the org file, we can
technically work in something other than emacs if we have a clojure tool
to detangle and tangle. However, this is not yet implemented. Also, it is planned
to give noweb support for babel so that i can break up the blocks.
</p>
<p>
Yes, currently it is not very development start friendly. That will change!
</p></div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> From Ideas to Implementation - Metatrader Backend </h2>
<div class="outline-text-2" id="text-3">

</div>

</div>
