clj-forex.html

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Code </h2>
<div class="outline-text-2" id="text-4">


</div>

<div id="outline-container-4_1" class="outline-3">
<h3 id="sec-4_1"><span class="section-number-3">4.1</span> Project </h3>
<div class="outline-text-3" id="text-4_1">




<div class="org-src-container"><label class="org-src-name">project()</label><pre class="src src-clojure">
(defproject clj-forex <span style="color: #bc8f8f;">"0.1-SNAPSHOT"</span>
  <span style="color: #da70d6;">:description</span> <span style="color: #bc8f8f;">"non graphical library for automated trading for forex market with various backends like metatrader"</span>
  <span style="color: #da70d6;">:dependencies</span> [[org.clojure/clojure <span style="color: #bc8f8f;">"1.2.0"</span>]
                 [org.clojure/clojure-contrib <span style="color: #bc8f8f;">"1.2.0"</span>]           
                 [matchure <span style="color: #bc8f8f;">"0.10.0"</span>]
                 [clj-time <span style="color: #bc8f8f;">"0.2.0-SNAPSHOT"</span>]
                 [mmemail <span style="color: #bc8f8f;">"1.0.1"</span>] 
                 [nstools <span style="color: #bc8f8f;">"0.2.4"</span>]
                 [com.miglayout/miglayout <span style="color: #bc8f8f;">"3.7.4"</span>]
                 [commons-codec <span style="color: #bc8f8f;">"1.4"</span>]]   
  <span style="color: #da70d6;">:dev-dependencies</span> [[native-deps <span style="color: #bc8f8f;">"1.0.5"</span>]
                     [swank-clojure <span style="color: #bc8f8f;">"1.3.0-SNAPSHOT"</span>]]  
  <span style="color: #da70d6;">:native-dependencies</span> [[org.clojars.starry/jzmq-native-deps <span style="color: #bc8f8f;">"2.0.10.3"</span>]]
  <span style="color: #da70d6;">:main</span> forex.interface.main
  <span style="color: #da70d6;">:repositories</span> {<span style="color: #bc8f8f;">"miglayout"</span> <span style="color: #bc8f8f;">"http://www.miglayout.com/mavensite/"</span>} 
 <span style="color: #b22222;">;; </span><span style="color: #b22222;">:run-aliases {:izpack forex.dev.install} 
</span>  <span style="color: #b22222;">;; </span><span style="color: #b22222;">:jvm-opts      ["-agentlib:jdwp=transport=dt_socket,server=y,suspend=n,address=8030"]
</span>  <span style="color: #b22222;">;;</span><span style="color: #b22222;">:aot :all
</span>  )
</pre></div>



</div>

</div>
