clj-forex.html

<div id="outline-container-4_2" class="outline-3">
<h3 id="sec-4_2"><span class="section-number-3">4.2</span> Util </h3>
<div class="outline-text-3" id="text-4_2">


</div>

<div id="outline-container-4_2_1" class="outline-4">
<h4 id="sec-4_2_1"><span class="section-number-4">4.2.1</span> ThirdParty </h4>
<div class="outline-text-4" id="text-4_2_1">




<div class="org-src-container"><label class="org-src-name">defrecord2()</label><pre class="src src-clojure">
<span style="color: #b22222;">;;</span><span style="color: #b22222;">BY David McNeil
</span><span style="color: #b22222;">;;</span><span style="color: #b22222;">https://github.com/david-mcneil/defrecord2
</span><span style="color: #b22222;">;;</span><span style="color: #b22222;">modified defrecord2 macro so i could include protocols
</span><span style="color: #b22222;">;;</span><span style="color: #b22222;">got rid of print-method and pprint method 
</span>
(<span style="color: #a020f0;">ns</span> clj.third-party.defrecord2
  (<span style="color: #da70d6;">:require</span> [clojure.contrib.str-utils2 <span style="color: #da70d6;">:as</span> str2])
  (<span style="color: #da70d6;">:use</span> [clojure.contrib.core <span style="color: #da70d6;">:only</span> (seqable?)]
        [clojure.set <span style="color: #da70d6;">:only</span> (<span style="color: #228b22;">difference</span>)]
        [clojure.string <span style="color: #da70d6;">:only</span> (<span style="color: #228b22;">join</span>)]
        [clojure.contrib.pprint <span style="color: #da70d6;">:only</span> (*simple-dispatch* use-method pprint-map)])
  (<span style="color: #da70d6;">:import</span> [clojure.lang IPersistentList IPersistentVector IPersistentMap ISeq]))

<span style="color: #b22222;">;;;; </span><span style="color: #b22222;">enhanced records with constructor support (take in a hashmap) and print-dup support
</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">internal helpers for name conversion
</span>
(<span style="color: #a020f0;">defn-</span> <span style="color: #0000ff;">take-even</span> [x]
  (<span style="color: #da70d6;">take-nth</span> 2 x))

(<span style="color: #a020f0;">defn-</span> <span style="color: #0000ff;">take-odd</span> [x]
  (<span style="color: #da70d6;">take-nth</span> 2 (<span style="color: #da70d6;">drop</span> 1 x)))

(<span style="color: #a020f0;">defn-</span> <span style="color: #0000ff;">is-upper?</span> [s]
  (<span style="color: #da70d6;">=</span> (.toUpperCase s) s))

(<span style="color: #a020f0;">defn-</span> <span style="color: #0000ff;">assemble-words</span> [parts]
  (<span style="color: #a020f0;">loop</span> [remaining-parts parts result []]
    (<span style="color: #a020f0;">if</span> (<span style="color: #da70d6;">seq</span> remaining-parts)
      (<span style="color: #a020f0;">let</span> [part (<span style="color: #da70d6;">first</span> remaining-parts)]
        (<span style="color: #a020f0;">recur</span> (<span style="color: #da70d6;">rest</span> remaining-parts)
               (<span style="color: #a020f0;">if</span> (is-upper? part)
                 (<span style="color: #da70d6;">conj</span> result (.toLowerCase part))
                 (<span style="color: #da70d6;">conj</span> (<span style="color: #a020f0;">if</span> (<span style="color: #da70d6;">seq</span> result)
                         (<span style="color: #da70d6;">pop</span> result)
                         []) (<span style="color: #da70d6;">str</span> (<span style="color: #da70d6;">last</span> result) part)))))
      result)))

(<span style="color: #a020f0;">defn-</span> <span style="color: #0000ff;">camel-to-dashed</span>
  <span style="color: #bc8f8f;">"Convert a name like 'BigBlueCar' to 'big-blue-car'."</span>
  [s]
  (<span style="color: #a020f0;">let</span> [parts (<span style="color: #da70d6;">remove</span> #(<span style="color: #da70d6;">=</span> <span style="color: #bc8f8f;">""</span> %) (str2/partition s #<span style="color: #bc8f8f;">"[A-Z]"</span>))
        words (assemble-words parts)]
    (<span style="color: #228b22;">join</span> <span style="color: #bc8f8f;">"-"</span> words)))

<span style="color: #b22222;">;; </span><span style="color: #b22222;">internal helpers for changing records via maps 
</span>
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">set-record-field</span>
  <span style="color: #bc8f8f;">"Set a single field on a record."</span>
  [source [key value]]
  (<span style="color: #da70d6;">assoc</span> source key value))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">set-record-fields</span>
  <span style="color: #bc8f8f;">"Set many fields on a record, from a map."</span>
  [initial value-map]
  (<span style="color: #da70d6;">reduce</span> set-record-field initial value-map))

<span style="color: #b22222;">;; </span><span style="color: #b22222;">internal helper for generating constructor function
</span>
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">expected-keys?</span> [map expected-key-set]
  (<span style="color: #da70d6;">not</span> (<span style="color: #da70d6;">seq</span> (<span style="color: #228b22;">difference</span> (<span style="color: #da70d6;">set</span> (<span style="color: #da70d6;">keys</span> map)) expected-key-set))))

(<span style="color: #a020f0;">defmacro</span> <span style="color: #0000ff;">make-record-constructor</span>
  <span style="color: #bc8f8f;">"Define the constructor functions used to instantiate a record."</span>
  [ctor-name type-name field-list default-record]
  `(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">~ctor-name</span>
     ([value-map#]
        (~ctor-name ~default-record value-map#))
     ([initial# value-map#]
        {<span style="color: #da70d6;">:pre</span> [(<span style="color: #a020f0;">or</span> (<span style="color: #da70d6;">nil?</span> initial#)
                   (<span style="color: #da70d6;">isa?</span> (<span style="color: #da70d6;">class</span> initial#) ~type-name))
               (<span style="color: #da70d6;">map?</span> value-map#)
               (expected-keys? value-map# ~(<span style="color: #da70d6;">set</span> (<span style="color: #da70d6;">map</span> keyword field-list)))]}
        (set-record-fields (<span style="color: #a020f0;">if</span> (<span style="color: #da70d6;">nil?</span> initial#) ~default-record initial#) value-map#)))) 

<span style="color: #b22222;">;; </span><span style="color: #b22222;">internal helpers for printing
</span>
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">remove-nil-native-fields</span> [native-keys record]
  (<span style="color: #a020f0;">let</span> [extra-keys (<span style="color: #228b22;">difference</span> (<span style="color: #da70d6;">set</span> (<span style="color: #da70d6;">keys</span> record))
                               native-keys)]
    (<span style="color: #da70d6;">apply</span> array-map (<span style="color: #da70d6;">reduce</span> into (<span style="color: #a020f0;">for</span> [[k v] record]
                                    (<span style="color: #a020f0;">if</span> (<span style="color: #a020f0;">or</span> (<span style="color: #da70d6;">contains?</span> extra-keys k)
                                            (<span style="color: #da70d6;">not</span> (<span style="color: #da70d6;">nil?</span> v)))
                                      [k v]))))))

(<span style="color: #a020f0;">defn-</span> <span style="color: #0000ff;">ns-resolve-symbol</span> [s]
  (<span style="color: #a020f0;">if-let</span> [s (<span style="color: #da70d6;">resolve</span> s)]
    (.substring (<span style="color: #da70d6;">str</span> s) 2)
    (<span style="color: #da70d6;">str</span> s)))

(<span style="color: #a020f0;">defmacro</span> <span style="color: #0000ff;">print-record</span>
  <span style="color: #bc8f8f;">"Low-level function to print a record to a stream using the specified constructor name in the print output and using the provided write-contents function to write out the contents of the record (represented as a map)."</span>
  [ctor ctor-name native-keys record stream write-contents]
  `(<span style="color: #a020f0;">do</span> 
     (.write ~stream (<span style="color: #da70d6;">str</span> <span style="color: #bc8f8f;">"#=("</span> ~(ns-resolve-symbol ctor-name) <span style="color: #bc8f8f;">" "</span>))
     (~write-contents (remove-nil-native-fields ~native-keys ~record))
     (.write ~stream  <span style="color: #bc8f8f;">")"</span>)))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">print-record-contents</span>
  <span style="color: #bc8f8f;">"Simply write the contents of a record to a stream as a string. Used for basic printing."</span>
  [stream contents]
  (.write stream (<span style="color: #da70d6;">str</span> contents)))

(<span style="color: #a020f0;">defmacro</span> <span style="color: #0000ff;">setup-print-record-method</span> [ctor ctor-name native-keys type-name method-name]
  `(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">~method-name</span> ~type-name [record# writer#]
     (print-record ~ctor ~ctor-name ~native-keys record# writer# (<span style="color: #da70d6;">partial</span> print-record-contents writer#))))

(<span style="color: #a020f0;">defmacro</span> <span style="color: #0000ff;">setup-print-record</span>
  <span style="color: #bc8f8f;">"Define the print methods to print a record nicely (so that records will print in a form that can be evaluated as itself)."</span>
  [ctor ctor-name native-keys type-name]

  `(<span style="color: #a020f0;">do</span> <span style="color: #b22222;">;</span><span style="color: #b22222;">(setup-print-record-method ~ctor ~ctor-name ~native-keys ~type-name print-method)
</span>     (setup-print-record-method ~ctor ~ctor-name ~native-keys ~type-name print-dup)))

(<span style="color: #a020f0;">defmacro</span> <span style="color: #0000ff;">generate-record-pprint</span>
  <span style="color: #bc8f8f;">"Return a function that can be used in the pprint dispatch mechanism to handle a specific constructor name."</span>
  [ctor ctor-name native-keys]
  `(<span style="color: #da70d6;">fn</span> [record#]
     (print-record ~ctor ~ctor-name ~native-keys record# *out* pprint-map)))

<span style="color: #b22222;">;; </span><span style="color: #b22222;">internal helpers - walking data structures
</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">w - walker function
</span><span style="color: #b22222;">;; </span><span style="color: #b22222;">f - mutator function
</span><span style="color: #b22222;">;; </span><span style="color: #b22222;">n - node in data tree being walked
</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">helper - generating walking methods like this:
</span>(<span style="color: #da70d6;">comment</span> (<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">prewalk2</span> Foo [f foo]
           (<span style="color: #a020f0;">if-let</span> [foo2 (f foo)]
             (new-foo foo2 {<span style="color: #da70d6;">:a</span> (prewalk2 f (<span style="color: #da70d6;">:a</span> foo2))
                            <span style="color: #da70d6;">:b</span> (prewalk2 f (<span style="color: #da70d6;">:b</span> foo2))})))

         (<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">postwalk2</span> Foo [f foo]
           (f (new-foo foo {<span style="color: #da70d6;">:a</span> (postwalk2 f (<span style="color: #da70d6;">:a</span> foo))
                            <span style="color: #da70d6;">:b</span> (postwalk2 f (<span style="color: #da70d6;">:b</span> foo))}))))

(<span style="color: #a020f0;">defmulti</span> <span style="color: #0000ff;">walk2</span> (<span style="color: #da70d6;">fn</span> [w f n] (<span style="color: #da70d6;">class</span> n)))

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">walk2</span> <span style="color: #da70d6;">:default</span> [w f n]
  n)

<span style="color: #b22222;">;; </span><span style="color: #b22222;">TODO: handle sets
</span>
(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">walk2</span> IPersistentVector [w f n]
  (<span style="color: #da70d6;">apply</span> vector (<span style="color: #da70d6;">map</span> (<span style="color: #da70d6;">partial</span> w f) n)))

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">walk2</span> IPersistentMap [w f n]
  <span style="color: #b22222;">;; </span><span style="color: #b22222;">TODO: handle sorted maps
</span>  (<span style="color: #da70d6;">apply</span> array-map (<span style="color: #da70d6;">mapcat</span> (<span style="color: #da70d6;">partial</span> walk2 w f) n)))

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">walk2</span> IPersistentList [w f n]
  (<span style="color: #da70d6;">apply</span> list (<span style="color: #da70d6;">map</span> (<span style="color: #da70d6;">partial</span> w f) n)))

(<span style="color: #da70d6;">prefer-method</span> walk2 IPersistentList ISeq)

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">walk2</span> ISeq [w f n]
  (<span style="color: #da70d6;">map</span> (<span style="color: #da70d6;">partial</span> w f) n))

(<span style="color: #a020f0;">defmacro</span> <span style="color: #0000ff;">walking-helper-field</span>
  ([w f n field]
     `[~(<span style="color: #da70d6;">keyword</span> field) (~w ~f (~(<span style="color: #da70d6;">keyword</span> field) ~n))])
  ([w f n field &amp; more]
     `(<span style="color: #da70d6;">concat</span> (walking-helper-field ~w ~f ~n ~field) (walking-helper-field ~w ~f ~n ~@more))))

(<span style="color: #a020f0;">defmacro</span> <span style="color: #0000ff;">walking-helper-fields</span>
  [w f n fields]
  `(<span style="color: #da70d6;">apply</span> array-map (walking-helper-field ~w ~f ~n ~@fields)))

(<span style="color: #a020f0;">defmacro</span> <span style="color: #0000ff;">make-prewalk2-method</span>
  <span style="color: #bc8f8f;">"Define the methods used to walk data structures."</span>
  [ctor-name type-name field-list]
  `(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">prewalk2</span> ~type-name [f# n#]
     (<span style="color: #a020f0;">if-let</span> [n2# (f# n#)]
       (~ctor-name n2# (walking-helper-fields prewalk2 f# n2# ~field-list)))))

(<span style="color: #a020f0;">defmacro</span> <span style="color: #0000ff;">make-postwalk2-method</span>
  <span style="color: #bc8f8f;">"Define the methods used to walk data structures."</span>
  [ctor-name type-name field-list]
  `(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">postwalk2</span> ~type-name [f# n#]
     (f# (~ctor-name n# (walking-helper-fields postwalk2 f# n# ~field-list)))))

<span style="color: #b22222;">;; </span><span style="color: #b22222;">public entry points
</span>
(<span style="color: #a020f0;">defmulti</span> <span style="color: #0000ff;">prewalk2</span> (<span style="color: #da70d6;">fn</span> [f n] (<span style="color: #da70d6;">class</span> n)))

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">prewalk2</span> <span style="color: #da70d6;">:default</span> [f n]
  (walk2 prewalk2 f (f n)))

(<span style="color: #a020f0;">defmulti</span> <span style="color: #0000ff;">postwalk2</span> (<span style="color: #da70d6;">fn</span> [f n] (<span style="color: #da70d6;">class</span> n)))

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">postwalk2</span> <span style="color: #da70d6;">:default</span> [f n]
  (f (walk2 postwalk2 f n)))

(<span style="color: #a020f0;">defmacro</span> <span style="color: #0000ff;">defrecord2</span>
  <span style="color: #bc8f8f;">"Defines a record and sets up constructor functions, printing, and pprinting for the new record type."</span>
  [type field-list &amp; protocols]
  (<span style="color: #a020f0;">let</span> [type-name (<span style="color: #a020f0;">if</span> (seqable? type) (<span style="color: #da70d6;">first</span> type) type)
        ctor-name (<span style="color: #a020f0;">if</span> (seqable? type)
                    (<span style="color: #da70d6;">second</span> type)
                    (<span style="color: #da70d6;">symbol</span> (<span style="color: #da70d6;">str</span> <span style="color: #bc8f8f;">"new-"</span> (camel-to-dashed (<span style="color: #da70d6;">str</span> type)))))]
    `(<span style="color: #a020f0;">do</span> 
       <span style="color: #b22222;">;; </span><span style="color: #b22222;">define the record
</span>       (<span style="color: #a020f0;">defrecord</span> <span style="color: #0000ff;">~type-name</span> ~field-list ~@protocols)
       <span style="color: #b22222;">;; </span><span style="color: #b22222;">define the constructor functions
</span>       (make-record-constructor ~ctor-name
                                ~type-name
                                ~field-list
                                (~(<span style="color: #da70d6;">symbol</span> (<span style="color: #da70d6;">str</span> type-name <span style="color: #bc8f8f;">"."</span>)) ~@(<span style="color: #da70d6;">repeat</span> (<span style="color: #da70d6;">count</span> field-list) nil)))
       <span style="color: #b22222;">;; </span><span style="color: #b22222;">setup tree walking methods
</span>       (make-prewalk2-method ~ctor-name ~type-name ~field-list)
       (make-postwalk2-method ~ctor-name ~type-name ~field-list)

       <span style="color: #b22222;">;; </span><span style="color: #b22222;">setup printing
</span>       (<span style="color: #a020f0;">let</span> [empty-record# (~ctor-name {})
             native-keys# (<span style="color: #da70d6;">set</span> (<span style="color: #da70d6;">keys</span> empty-record#))]
         (setup-print-record ~ctor-name ~ctor-name native-keys# ~type-name)
         <span style="color: #b22222;">;; </span><span style="color: #b22222;">setup pprinting
</span>         (<span style="color: #da70d6;">comment</span>
           (use-method *simple-dispatch*
                       ~type-name

                       (generate-record-pprint ~ctor-name
                                               ~ctor-name
                                               native-keys#)))))))
</pre></div>



</div>

</div>
