clj-forex.html

<div id="outline-container-4_2_2" class="outline-4">
<h4 id="sec-4_2_2"><span class="section-number-4">4.2.2</span> CLJ </h4>
<div class="outline-text-4" id="text-4_2_2">




<div class="org-src-container"><label class="org-src-name">clj-core()</label><pre class="src src-clojure">
(<span style="color: #a020f0;">ns</span> clj.core
  (<span style="color: #da70d6;">:refer-clojure</span> <span style="color: #da70d6;">:exclude</span> [promise swap! reset! defrecord spit file])
  (<span style="color: #da70d6;">:require</span> clj.third-party.defrecord2)
  (<span style="color: #da70d6;">:import</span> clojure.lang.APersistentMap java.io.Writer))
(<span style="color: #a020f0;">defmacro</span> <span style="color: #0000ff;">defrecord</span> [name fields &amp; protocols]
  `(clj.third-party.defrecord2/defrecord2 ~name ~fields ~@protocols))

<span style="color: #b22222;">;;</span><span style="color: #b22222;">TODO: serializable records and atoms and refs 
</span>(<span style="color: #a020f0;">defmulti</span> <span style="color: #0000ff;">swap!</span> (<span style="color: #da70d6;">fn</span> [a &amp; args] (<span style="color: #da70d6;">class</span> a)))
(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">swap!</span> clojure.lang.Atom [&amp; args]
  (<span style="color: #da70d6;">apply</span> clojure.core/swap! args))
(<span style="color: #a020f0;">defmulti</span> <span style="color: #0000ff;">reset!</span> (<span style="color: #da70d6;">fn</span> [a &amp; args] (<span style="color: #da70d6;">class</span> a)))
(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">reset!</span> clojure.lang.Atom [&amp; args]
  (<span style="color: #da70d6;">apply</span> clojure.core/reset! args))
(<span style="color: #a020f0;">defprotocol</span> <span style="color: #0000ff;">PWait</span> 
  (wait-for [this timeout units] [this timeout]))
<span style="color: #b22222;">;;</span><span style="color: #b22222;">copied from clojure source, but adding timeout wait-for
</span>(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">promise</span>
  <span style="color: #bc8f8f;">"Alpha - subject to change.
  Returns a promise object that can be read with deref/@, and set,
  once only, with deliver. Calls to deref/@ prior to delivery will
  block. All subsequent derefs will return the same delivered value
  without blocking."</span>
  {<span style="color: #da70d6;">:added</span> <span style="color: #bc8f8f;">"1.1"</span>}
  []
  (<span style="color: #a020f0;">let</span> [d (java.util.concurrent.CountDownLatch. 1)
        v (<span style="color: #da70d6;">atom</span> nil)]
    (<span style="color: #da70d6;">reify</span> 
      clojure.lang.IDeref
      (<span style="color: #da70d6;">deref</span> [_] (.await d) @v)
      PWait
      (wait-for [this timeout]
                (wait-for this timeout
                          java.util.concurrent.TimeUnit/MILLISECONDS))
      (wait-for [this timeout units]
                (<span style="color: #a020f0;">if</span> timeout
                  (.await d timeout units)
                  (<span style="color: #a020f0;">do</span> (.await d) true)))
      clojure.lang.IFn
      (invoke [this x] 
              (<span style="color: #da70d6;">locking</span> d
                (<span style="color: #a020f0;">if</span> (<span style="color: #da70d6;">pos?</span> (.getCount d))
                  (<span style="color: #a020f0;">do</span> (<span style="color: #da70d6;">reset!</span> v x)
                      (.countDown d)
                      x)
                  (<span style="color: #a020f0;">throw</span>
                   (IllegalStateException.
                    <span style="color: #bc8f8f;">"Multiple deliver calls to a promise"</span>))))))))

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">print-dup</span> clojure.lang.Atom [o w]
  (.write w <span style="color: #bc8f8f;">"#=(clojure.core/atom "</span>) (<span style="color: #da70d6;">print-dup</span> @o w) (.write w <span style="color: #bc8f8f;">")"</span>))
(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">print-dup</span> clojure.lang.Ref [o w]
  (.write w <span style="color: #bc8f8f;">"#=(clojure.core/ref "</span>) (<span style="color: #da70d6;">print-dup</span> @o w) (.write w <span style="color: #bc8f8f;">")"</span>))
</pre></div>




<div class="org-src-container"><label class="org-src-name">clj-io()</label><pre class="src src-clojure">
<span style="color: #b22222;">;;; </span><span style="color: #b22222;">duck_streams.clj -- duck-typed I/O streams for Clojure
</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">by Stuart Sierra, http://stuartsierra.com/
</span><span style="color: #b22222;">;; </span><span style="color: #b22222;">May 13, 2009
</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">Copyright (c) Stuart Sierra, 2009. All rights reserved.  The use
</span><span style="color: #b22222;">;; </span><span style="color: #b22222;">and distribution terms for this software are covered by the Eclipse
</span><span style="color: #b22222;">;; </span><span style="color: #b22222;">Public License 1.0 (http://opensource.org/licenses/eclipse-1.0.php)
</span><span style="color: #b22222;">;; </span><span style="color: #b22222;">which can be found in the file epl-v10.html at the root of this
</span><span style="color: #b22222;">;; </span><span style="color: #b22222;">distribution.  By using this software in any fashion, you are
</span><span style="color: #b22222;">;; </span><span style="color: #b22222;">agreeing to be bound by the terms of this license.  You must not
</span><span style="color: #b22222;">;; </span><span style="color: #b22222;">remove this notice, or any other, from this software.
</span>

<span style="color: #b22222;">;; </span><span style="color: #b22222;">This file defines "duck-typed" I/O utility functions for Clojure.
</span><span style="color: #b22222;">;; </span><span style="color: #b22222;">The 'reader' and 'writer' functions will open and return an
</span><span style="color: #b22222;">;; </span><span style="color: #b22222;">instance of java.io.BufferedReader and java.io.BufferedWriter,
</span><span style="color: #b22222;">;; </span><span style="color: #b22222;">respectively, for a variety of argument types -- filenames as
</span><span style="color: #b22222;">;; </span><span style="color: #b22222;">strings, URLs, java.io.File's, etc.  'reader' even works on http
</span><span style="color: #b22222;">;; </span><span style="color: #b22222;">URLs.
</span><span style="color: #b22222;">;;</span><span style="color: #b22222;">
</span><span style="color: #b22222;">;; </span><span style="color: #b22222;">Note: this is not really "duck typing" as implemented in languages
</span><span style="color: #b22222;">;; </span><span style="color: #b22222;">like Ruby.  A better name would have been "do-what-I-mean-streams"
</span><span style="color: #b22222;">;; </span><span style="color: #b22222;">or "just-give-me-a-stream", but ducks are funnier.
</span>

<span style="color: #b22222;">;; </span><span style="color: #b22222;">CHANGE LOG
</span><span style="color: #b22222;">;;</span><span style="color: #b22222;">
</span><span style="color: #b22222;">;; </span><span style="color: #b22222;">May 13, 2009: added functions to open writers for appending
</span><span style="color: #b22222;">;;</span><span style="color: #b22222;">
</span><span style="color: #b22222;">;; </span><span style="color: #b22222;">May 3, 2009: renamed file to file-str, for compatibility with
</span><span style="color: #b22222;">;; </span><span style="color: #b22222;">clojure.contrib.java.  reader/writer no longer use this
</span><span style="color: #b22222;">;; </span><span style="color: #b22222;">function.
</span><span style="color: #b22222;">;;</span><span style="color: #b22222;">
</span><span style="color: #b22222;">;; </span><span style="color: #b22222;">February 16, 2009: (lazy branch) fixed read-lines to work with lazy
</span><span style="color: #b22222;">;; </span><span style="color: #b22222;">Clojure.
</span><span style="color: #b22222;">;;</span><span style="color: #b22222;">
</span><span style="color: #b22222;">;; </span><span style="color: #b22222;">January 10, 2009: added *default-encoding*, so streams are always
</span><span style="color: #b22222;">;; </span><span style="color: #b22222;">opened as UTF-8.
</span><span style="color: #b22222;">;;</span><span style="color: #b22222;">
</span><span style="color: #b22222;">;; </span><span style="color: #b22222;">December 19, 2008: rewrote reader and writer as multimethods; added
</span><span style="color: #b22222;">;; </span><span style="color: #b22222;">slurp*, file, and read-lines
</span><span style="color: #b22222;">;;</span><span style="color: #b22222;">
</span><span style="color: #b22222;">;; </span><span style="color: #b22222;">April 8, 2008: first version
</span>


(<span style="color: #a020f0;">ns</span>
 #^{<span style="color: #da70d6;">:author</span> <span style="color: #bc8f8f;">"Stuart Sierra"</span>,
    <span style="color: #da70d6;">:doc</span> <span style="color: #bc8f8f;">"This file defines polymorphic I/O utility functions for Clojure.

           The Streams protocol defines reader, writer, input-stream and
           output-stream methods that return BufferedReader, BufferedWriter,
           BufferedInputStream and BufferedOutputStream instances (respectively),
           with default implementations extended to a variety of argument
           types: URLs or filenames as strings, java.io.File's, Sockets, etc."</span>}
 clj.io
 (<span style="color: #da70d6;">:refer-clojure</span> <span style="color: #da70d6;">:exclude</span> (spit))
 (<span style="color: #da70d6;">:import</span> 
  (java.io Reader InputStream InputStreamReader PushbackReader
           BufferedReader File OutputStream
           OutputStreamWriter BufferedWriter Writer
           FileInputStream FileOutputStream ByteArrayOutputStream
           StringReader ByteArrayInputStream
           BufferedInputStream BufferedOutputStream
           CharArrayReader)
  (java.net URI URL MalformedURLException Socket)))

(<span style="color: #a020f0;">defmulti</span> <span style="color: #228b22;">#^File</span> ^{<span style="color: #da70d6;">:private</span> true} <span style="color: #0000ff;">as-file</span> 
  <span style="color: #bc8f8f;">"Interpret a String or a java.io.File as a File. Building block
   for clojure.contrib.java/file, which you should prefer
   in most cases."</span>
  class)
(<span style="color: #a020f0;">defmethod</span> ^{<span style="color: #da70d6;">:private</span> true} <span style="color: #0000ff;">as-file</span> String [<span style="color: #228b22;">#^String</span> s] (File. s))
(<span style="color: #a020f0;">defmethod</span> ^{<span style="color: #da70d6;">:private</span> true} <span style="color: #0000ff;">as-file</span> File [f] f)


(<span style="color: #a020f0;">def</span>
 #^{<span style="color: #da70d6;">:doc</span> <span style="color: #bc8f8f;">"Name of the default encoding to use when reading &amp; writing.
  Default is UTF-8."</span>
    <span style="color: #da70d6;">:tag</span> <span style="color: #bc8f8f;">"java.lang.String"</span>}
 <span style="color: #0000ff;">*default-encoding*</span> <span style="color: #bc8f8f;">"UTF-8"</span>)

(<span style="color: #a020f0;">def</span>
 #^{<span style="color: #da70d6;">:doc</span> <span style="color: #bc8f8f;">"Size, in bytes or characters, of the buffer used when
  copying streams."</span>}
 <span style="color: #0000ff;">*buffer-size*</span> 1024)

(<span style="color: #a020f0;">def</span>
 #^{<span style="color: #da70d6;">:doc</span> <span style="color: #bc8f8f;">"Type object for a Java primitive byte array."</span>}
 <span style="color: #0000ff;">*byte-array-type*</span> (<span style="color: #da70d6;">class</span> (<span style="color: #da70d6;">make-array</span> Byte/TYPE 0)))

(<span style="color: #a020f0;">def</span>
 #^{<span style="color: #da70d6;">:doc</span> <span style="color: #bc8f8f;">"Type object for a Java primitive char array."</span>}
 <span style="color: #0000ff;">*char-array-type*</span> (<span style="color: #da70d6;">class</span> (<span style="color: #da70d6;">make-array</span> Character/TYPE 0)))


(<span style="color: #a020f0;">defn</span> <span style="color: #228b22;">#^File</span> <span style="color: #0000ff;">file-str</span>
  <span style="color: #bc8f8f;">"Concatenates args as strings and returns a java.io.File.  Replaces
  all / and \\ with File/separatorChar.  Replaces ~ at the start of
  the path with the user.home system property."</span>
  [&amp; args]
  (<span style="color: #a020f0;">let</span> [<span style="color: #228b22;">#^String</span> s (<span style="color: #da70d6;">apply</span> str args)
        s (.replace s \\ File/separatorChar)
        s (.replace s \/ File/separatorChar)
        s (<span style="color: #a020f0;">if</span> (.startsWith s <span style="color: #bc8f8f;">"~"</span>)
            (<span style="color: #da70d6;">str</span> (System/getProperty <span style="color: #bc8f8f;">"user.home"</span>)
                 File/separator (<span style="color: #da70d6;">subs</span> s 1))
            s)]
    (File. s)))

(<span style="color: #a020f0;">def</span>
 #^{<span style="color: #da70d6;">:doc</span> <span style="color: #bc8f8f;">"If true, writer, output-stream and spit will open files in append mode.
          Defaults to false.  Instead of binding this var directly, use append-writer,
          append-output-stream or append-spit."</span>
    <span style="color: #da70d6;">:tag</span> <span style="color: #bc8f8f;">"java.lang.Boolean"</span>}
 <span style="color: #0000ff;">*append*</span> false)

(<span style="color: #a020f0;">defn-</span> <span style="color: #0000ff;">assert-not-appending</span> []
  (<span style="color: #a020f0;">when</span> *append*
    (<span style="color: #a020f0;">throw</span> (Exception. <span style="color: #bc8f8f;">"Cannot change an open stream to append mode."</span>))))

<span style="color: #b22222;">;; </span><span style="color: #b22222;">@todo -- Both simple and elaborate methods for controlling buffering of
</span><span style="color: #b22222;">;; </span><span style="color: #b22222;">in the Streams protocol were implemented, considered, and postponed
</span><span style="color: #b22222;">;; </span><span style="color: #b22222;">see http://groups.google.com/group/clojure-dev/browse_frm/thread/3e39e9b3982f542b
</span>(<span style="color: #a020f0;">defprotocol</span> <span style="color: #0000ff;">Streams</span>
  (reader [x]
    <span style="color: #bc8f8f;">"Attempts to coerce its argument into an open java.io.Reader.
     The default implementations of this protocol always return a
     java.io.BufferedReader.

     Default implementations are provided for Reader, BufferedReader,
     InputStream, File, URI, URL, Socket, byte arrays, character arrays,
     and String.

     If argument is a String, it tries to resolve it first as a URI, then
     as a local file name.  URIs with a 'file' protocol are converted to
     local file names.  If this fails, a final attempt is made to resolve
     the string as a resource on the CLASSPATH.

     Uses *default-encoding* as the text encoding.

     Should be used inside with-open to ensure the Reader is properly
     closed."</span>)
  (writer [x]
    <span style="color: #bc8f8f;">"Attempts to coerce its argument into an open java.io.Writer.
     The default implementations of this protocol always return a
     java.io.BufferedWriter.

     Default implementations are provided for Writer, BufferedWriter,
     OutputStream, File, URI, URL, Socket, and String.

     If the argument is a String, it tries to resolve it first as a URI, then
     as a local file name.  URIs with a 'file' protocol are converted to
     local file names.

     Should be used inside with-open to ensure the Writer is properly
     closed."</span>)
  (input-stream [x]
    <span style="color: #bc8f8f;">"Attempts to coerce its argument into an open java.io.InputStream.
     The default implementations of this protocol always return a
     java.io.BufferedInputStream.

     Default implementations are defined for OutputStream, File, URI, URL,
     Socket, byte array, and String arguments.

     If the argument is a String, it tries to resolve it first as a URI, then
     as a local file name.  URIs with a 'file' protocol are converted to
     local file names.

     Should be used inside with-open to ensure the InputStream is properly
     closed."</span>)
  (output-stream [x]
    <span style="color: #bc8f8f;">"Attempts to coerce its argument into an open java.io.OutputStream.
     The default implementations of this protocol always return a
     java.io.BufferedOutputStream.

     Default implementations are defined for OutputStream, File, URI, URL,
     Socket, and String arguments.

     If the argument is a String, it tries to resolve it first as a URI, then
     as a local file name.  URIs with a 'file' protocol are converted to
     local file names.

     Should be used inside with-open to ensure the OutputStream is
     properly closed."</span>))

(<span style="color: #a020f0;">def</span> <span style="color: #0000ff;">default-streams-impl</span>
  {<span style="color: #da70d6;">:reader</span> #(reader (input-stream %))
   <span style="color: #da70d6;">:writer</span> #(writer (output-stream %))
   <span style="color: #da70d6;">:input-stream</span> #(<span style="color: #a020f0;">throw</span> (Exception. (<span style="color: #da70d6;">str</span> <span style="color: #bc8f8f;">"Cannot open &lt;"</span> (<span style="color: #da70d6;">pr-str</span> %) <span style="color: #bc8f8f;">"&gt; as an InputStream."</span>)))
   <span style="color: #da70d6;">:output-stream</span> #(<span style="color: #a020f0;">throw</span> (Exception. (<span style="color: #da70d6;">str</span> <span style="color: #bc8f8f;">"Cannot open &lt;"</span> (<span style="color: #da70d6;">pr-str</span> %) <span style="color: #bc8f8f;">"&gt; as an OutputStream."</span>)))})

(<span style="color: #da70d6;">extend</span> File
  Streams
  (<span style="color: #da70d6;">assoc</span> default-streams-impl
    <span style="color: #da70d6;">:input-stream</span> #(input-stream (FileInputStream. <span style="color: #228b22;">#^File</span> %))
    <span style="color: #da70d6;">:output-stream</span> #(<span style="color: #a020f0;">let</span> [stream (FileOutputStream. <span style="color: #228b22;">#^File</span> % *append*)]
                      (<span style="color: #a020f0;">binding</span> [*append* false]
                        (output-stream stream)))))
(<span style="color: #da70d6;">extend</span> URL
  Streams
  (<span style="color: #da70d6;">assoc</span> default-streams-impl
    <span style="color: #da70d6;">:input-stream</span> (<span style="color: #da70d6;">fn</span> [<span style="color: #228b22;">#^URL</span> x]
                    (input-stream (<span style="color: #a020f0;">if</span> (<span style="color: #da70d6;">=</span> <span style="color: #bc8f8f;">"file"</span> (.getProtocol x))
                                    (FileInputStream. (.getPath x))
                                    (.openStream x))))
    <span style="color: #da70d6;">:output-stream</span> (<span style="color: #da70d6;">fn</span> [<span style="color: #228b22;">#^URL</span> x]
                     (<span style="color: #a020f0;">if</span> (<span style="color: #da70d6;">=</span> <span style="color: #bc8f8f;">"file"</span> (.getProtocol x))
                       (output-stream (File. (.getPath x)))
                       (<span style="color: #a020f0;">throw</span> (Exception. (<span style="color: #da70d6;">str</span> <span style="color: #bc8f8f;">"Can not write to non-file URL &lt;"</span> x <span style="color: #bc8f8f;">"&gt;"</span>)))))))
(<span style="color: #da70d6;">extend</span> URI
  Streams
  (<span style="color: #da70d6;">assoc</span> default-streams-impl
    <span style="color: #da70d6;">:input-stream</span> #(input-stream (.toURL <span style="color: #228b22;">#^URI</span> %))
    <span style="color: #da70d6;">:output-stream</span> #(output-stream (.toURL <span style="color: #228b22;">#^URI</span> %))))
(<span style="color: #da70d6;">extend</span> String
  Streams
  (<span style="color: #da70d6;">assoc</span> default-streams-impl
    <span style="color: #da70d6;">:input-stream</span> #(<span style="color: #a020f0;">try</span>
                     (input-stream (URL. %))
                     (<span style="color: #a020f0;">catch</span> MalformedURLException e
                       (input-stream (File. <span style="color: #228b22;">#^String</span> %))))
    <span style="color: #da70d6;">:output-stream</span> #(<span style="color: #a020f0;">try</span>
                      (output-stream (URL. %))
                      (<span style="color: #a020f0;">catch</span> MalformedURLException err
                        (output-stream (File. <span style="color: #228b22;">#^String</span> %))))))
(<span style="color: #da70d6;">extend</span> Socket
  Streams
  (<span style="color: #da70d6;">assoc</span> default-streams-impl
    <span style="color: #da70d6;">:input-stream</span> #(.getInputStream <span style="color: #228b22;">#^Socket</span> %)
    <span style="color: #da70d6;">:output-stream</span> #(output-stream (.getOutputStream <span style="color: #228b22;">#^Socket</span> %))))
(<span style="color: #da70d6;">extend</span> *byte-array-type*
  Streams
  (<span style="color: #da70d6;">assoc</span> default-streams-impl <span style="color: #da70d6;">:input-stream</span> #(input-stream (ByteArrayInputStream. %))))
(<span style="color: #da70d6;">extend</span> *char-array-type*
  Streams
  (<span style="color: #da70d6;">assoc</span> default-streams-impl <span style="color: #da70d6;">:reader</span> #(reader (CharArrayReader. %))))
(<span style="color: #da70d6;">extend</span> Object
  Streams
  default-streams-impl)

(<span style="color: #da70d6;">extend</span> Reader
  Streams
  (<span style="color: #da70d6;">assoc</span> default-streams-impl <span style="color: #da70d6;">:reader</span> #(BufferedReader. %)))
(<span style="color: #da70d6;">extend</span> BufferedReader
  Streams
  (<span style="color: #da70d6;">assoc</span> default-streams-impl <span style="color: #da70d6;">:reader</span> identity))
(<span style="color: #a020f0;">defn-</span> <span style="color: #0000ff;">inputstream-&gt;reader</span>
  [<span style="color: #228b22;">#^InputStream</span> is]
  (reader (InputStreamReader. is *default-encoding*)))
(<span style="color: #da70d6;">extend</span> InputStream
  Streams
  (<span style="color: #da70d6;">assoc</span> default-streams-impl <span style="color: #da70d6;">:input-stream</span> #(BufferedInputStream. %)
    <span style="color: #da70d6;">:reader</span> inputstream-&gt;reader))
(<span style="color: #da70d6;">extend</span> BufferedInputStream
  Streams
  (<span style="color: #da70d6;">assoc</span> default-streams-impl
    <span style="color: #da70d6;">:input-stream</span> identity
    <span style="color: #da70d6;">:reader</span> inputstream-&gt;reader))

(<span style="color: #da70d6;">extend</span> Writer
  Streams
  (<span style="color: #da70d6;">assoc</span> default-streams-impl <span style="color: #da70d6;">:writer</span> #(<span style="color: #a020f0;">do</span> (assert-not-appending)
                                           (BufferedWriter. %))))
(<span style="color: #da70d6;">extend</span> BufferedWriter
  Streams
  (<span style="color: #da70d6;">assoc</span> default-streams-impl <span style="color: #da70d6;">:writer</span> #(<span style="color: #a020f0;">do</span> (assert-not-appending) %)))
(<span style="color: #a020f0;">defn-</span> <span style="color: #0000ff;">outputstream-&gt;writer</span>
  [<span style="color: #228b22;">#^OutputStream</span> os]
  (assert-not-appending)
  (writer (OutputStreamWriter. os *default-encoding*)))
(<span style="color: #da70d6;">extend</span> OutputStream
  Streams
  (<span style="color: #da70d6;">assoc</span> default-streams-impl
    <span style="color: #da70d6;">:output-stream</span> #(<span style="color: #a020f0;">do</span> (assert-not-appending)
                        (BufferedOutputStream. %))
    <span style="color: #da70d6;">:writer</span> outputstream-&gt;writer))
(<span style="color: #da70d6;">extend</span> BufferedOutputStream
  Streams
  (<span style="color: #da70d6;">assoc</span> default-streams-impl
    <span style="color: #da70d6;">:output-stream</span> #(<span style="color: #a020f0;">do</span> (assert-not-appending) %)
      <span style="color: #da70d6;">:writer</span> outputstream-&gt;writer))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">append-output-stream</span>
  <span style="color: #bc8f8f;">"Like output-stream but opens file for appending.  Does not work on streams
  that are already open."</span>
  [x]
  (<span style="color: #a020f0;">binding</span> [*append* true]
    (output-stream x)))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">append-writer</span>
  <span style="color: #bc8f8f;">"Like writer but opens file for appending.  Does not work on streams
  that are already open."</span>
  [x]
  (<span style="color: #a020f0;">binding</span> [*append* true]
    (writer x)))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">write-lines</span>
  <span style="color: #bc8f8f;">"Writes lines (a seq) to f, separated by newlines.  f is opened with
  writer, and automatically closed at the end of the sequence."</span>
  [f lines]
  (<span style="color: #a020f0;">with-open</span> [<span style="color: #228b22;">#^BufferedWriter</span> writer (writer f)]
    (<span style="color: #a020f0;">loop</span> [lines lines]
      (<span style="color: #a020f0;">when-let</span> [line (<span style="color: #da70d6;">first</span> lines)]
        (.write writer (<span style="color: #da70d6;">str</span> line))
        (.newLine writer)
        (<span style="color: #a020f0;">recur</span> (<span style="color: #da70d6;">rest</span> lines))))))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">read-lines</span>
  <span style="color: #bc8f8f;">"Like clojure.core/line-seq but opens f with reader.  Automatically
  closes the reader AFTER YOU CONSUME THE ENTIRE SEQUENCE."</span>
  [f]
  (<span style="color: #a020f0;">let</span> [read-line (<span style="color: #da70d6;">fn</span> <span style="color: #0000ff;">this</span> [<span style="color: #228b22;">#^BufferedReader</span> rdr]
                    (<span style="color: #da70d6;">lazy-seq</span>
                     (<span style="color: #a020f0;">if-let</span> [line (.readLine rdr)]
                       (<span style="color: #da70d6;">cons</span> line (this rdr))
                       (.close rdr))))]
    (<span style="color: #da70d6;">read-line</span> (reader f))))

(<span style="color: #a020f0;">defn</span> <span style="color: #228b22;">#^String</span> <span style="color: #0000ff;">slurp*</span>
  <span style="color: #bc8f8f;">"Like clojure.core/slurp but opens f with reader."</span>
  [f]
  (<span style="color: #a020f0;">with-open</span> [<span style="color: #228b22;">#^BufferedReader</span> r (reader f)]
      (<span style="color: #a020f0;">let</span> [sb (StringBuilder.)]
        (<span style="color: #a020f0;">loop</span> [c (.read r)]
          (<span style="color: #a020f0;">if</span> (<span style="color: #da70d6;">neg?</span> c)
            (<span style="color: #da70d6;">str</span> sb)
            (<span style="color: #a020f0;">do</span> (.append sb (<span style="color: #da70d6;">char</span> c))
                (<span style="color: #a020f0;">recur</span> (.read r))))))))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">spit</span>
  <span style="color: #bc8f8f;">"Opposite of slurp.  Opens f with writer, writes content, then
  closes f."</span>
  [f content]
  (<span style="color: #a020f0;">with-open</span> [<span style="color: #228b22;">#^Writer</span> w (writer f)]
    (.write w content)))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">append-spit</span>
  <span style="color: #bc8f8f;">"Like spit but appends to file."</span>
  [f content]
  (<span style="color: #a020f0;">with-open</span> [<span style="color: #228b22;">#^Writer</span> w (append-writer f)]
    (.write w content)))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">pwd</span>
  <span style="color: #bc8f8f;">"Returns current working directory as a String.  (Like UNIX 'pwd'.)
  Note: In Java, you cannot change the current working directory."</span>
  []
  (System/getProperty <span style="color: #bc8f8f;">"user.dir"</span>))



(<span style="color: #a020f0;">defmacro</span> <span style="color: #0000ff;">with-out-writer</span>
  <span style="color: #bc8f8f;">"Opens a writer on f, binds it to *out*, and evalutes body.
  Anything printed within body will be written to f."</span>
  [f &amp; body]
  `(<span style="color: #a020f0;">with-open</span> [stream# (writer ~f)]
     (<span style="color: #a020f0;">binding</span> [*out* stream#]
       ~@body)))

(<span style="color: #a020f0;">defmacro</span> <span style="color: #0000ff;">with-out-append-writer</span>
  <span style="color: #bc8f8f;">"Like with-out-writer but appends to file."</span>
  [f &amp; body]
  `(<span style="color: #a020f0;">with-open</span> [stream# (append-writer ~f)]
     (<span style="color: #a020f0;">binding</span> [*out* stream#]
       ~@body)))

(<span style="color: #a020f0;">defmacro</span> <span style="color: #0000ff;">with-in-reader</span>
  <span style="color: #bc8f8f;">"Opens a PushbackReader on f, binds it to *in*, and evaluates body."</span>
  [f &amp; body]
  `(<span style="color: #a020f0;">with-open</span> [stream# (PushbackReader. (reader ~f))]
     (<span style="color: #a020f0;">binding</span> [*in* stream#]
       ~@body)))

(<span style="color: #a020f0;">defmulti</span>
  #^{<span style="color: #da70d6;">:doc</span> <span style="color: #bc8f8f;">"Copies input to output.  Returns nil.
  Input may be an InputStream, Reader, File, byte[], or String.
  Output may be an OutputStream, Writer, or File.

  Does not close any streams except those it opens itself 
  (on a File).

  Writing a File fails if the parent directory does not exist."</span>
     <span style="color: #da70d6;">:arglists</span> '([input output])}
  <span style="color: #0000ff;">copy</span>
  (<span style="color: #da70d6;">fn</span> [input output]
    [(<span style="color: #a020f0;">if</span> (<span style="color: #da70d6;">string?</span> input) File (<span style="color: #da70d6;">type</span> input))
     (<span style="color: #a020f0;">if</span> (<span style="color: #da70d6;">string?</span> output) File (<span style="color: #da70d6;">type</span> output))]))

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">copy</span> [InputStream OutputStream] [<span style="color: #228b22;">#^InputStream</span> input <span style="color: #228b22;">#^OutputStream</span> output]
  (<span style="color: #a020f0;">let</span> [buffer (<span style="color: #da70d6;">make-array</span> Byte/TYPE *buffer-size*)]
    (<span style="color: #a020f0;">loop</span> []
      (<span style="color: #a020f0;">let</span> [size (.read input buffer)]
        (<span style="color: #a020f0;">when</span> (<span style="color: #da70d6;">pos?</span> size)
          (<span style="color: #a020f0;">do</span> (.write output buffer 0 size)
              (<span style="color: #a020f0;">recur</span>)))))))

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">copy</span> [InputStream Writer] [<span style="color: #228b22;">#^InputStream</span> input <span style="color: #228b22;">#^Writer</span> output]
  (<span style="color: #a020f0;">let</span> [#^<span style="color: #bc8f8f;">"[B"</span> buffer (<span style="color: #da70d6;">make-array</span> Byte/TYPE *buffer-size*)]
    (<span style="color: #a020f0;">loop</span> []
      (<span style="color: #a020f0;">let</span> [size (.read input buffer)]
        (<span style="color: #a020f0;">when</span> (<span style="color: #da70d6;">pos?</span> size)
          (<span style="color: #a020f0;">let</span> [chars (.toCharArray (String. buffer 0 size *default-encoding*))]
            (<span style="color: #a020f0;">do</span> (.write output chars)
                (<span style="color: #a020f0;">recur</span>))))))))


(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">copy</span> [InputStream File] [<span style="color: #228b22;">#^InputStream</span> input <span style="color: #228b22;">#^File</span> output]
  (<span style="color: #a020f0;">with-open</span> [out (FileOutputStream. output)]
    (copy input out)))

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">copy</span> [Reader OutputStream] [<span style="color: #228b22;">#^Reader</span> input <span style="color: #228b22;">#^OutputStream</span> output]
  (<span style="color: #a020f0;">let</span> [#^<span style="color: #bc8f8f;">"[C"</span> buffer (<span style="color: #da70d6;">make-array</span> Character/TYPE *buffer-size*)]
    (<span style="color: #a020f0;">loop</span> []
      (<span style="color: #a020f0;">let</span> [size (.read input buffer)]
        (<span style="color: #a020f0;">when</span> (<span style="color: #da70d6;">pos?</span> size)
          (<span style="color: #a020f0;">let</span> [bytes (.getBytes (String. buffer 0 size) *default-encoding*)]
            (<span style="color: #a020f0;">do</span> (.write output bytes)
                (<span style="color: #a020f0;">recur</span>))))))))

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">copy</span> [Reader Writer] [<span style="color: #228b22;">#^Reader</span> input <span style="color: #228b22;">#^Writer</span> output]
  (<span style="color: #a020f0;">let</span> [#^<span style="color: #bc8f8f;">"[C"</span> buffer (<span style="color: #da70d6;">make-array</span> Character/TYPE *buffer-size*)]
    (<span style="color: #a020f0;">loop</span> []
      (<span style="color: #a020f0;">let</span> [size (.read input buffer)]
        (<span style="color: #a020f0;">when</span> (<span style="color: #da70d6;">pos?</span> size)
          (<span style="color: #a020f0;">do</span> (.write output buffer 0 size)
              (<span style="color: #a020f0;">recur</span>)))))))

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">copy</span> [Reader File] [<span style="color: #228b22;">#^Reader</span> input <span style="color: #228b22;">#^File</span> output]
  (<span style="color: #a020f0;">with-open</span> [out (FileOutputStream. output)]
    (copy input out)))

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">copy</span> [File OutputStream] [<span style="color: #228b22;">#^File</span> input <span style="color: #228b22;">#^OutputStream</span> output]
  (<span style="color: #a020f0;">with-open</span> [in (FileInputStream. input)]
    (copy in output)))

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">copy</span> [File Writer] [<span style="color: #228b22;">#^File</span> input <span style="color: #228b22;">#^Writer</span> output]
  (<span style="color: #a020f0;">with-open</span> [in (FileInputStream. input)]
    (copy in output)))

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">copy</span> [File File] [input output]
  (<span style="color: #a020f0;">with-open</span> [in (FileInputStream. (as-file input))
              out (FileOutputStream. (as-file output))]
    (copy in out)))

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">copy</span> [String OutputStream] [<span style="color: #228b22;">#^String</span> input <span style="color: #228b22;">#^OutputStream</span> output]
  (copy (StringReader. input) output))

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">copy</span> [String Writer] [<span style="color: #228b22;">#^String</span> input <span style="color: #228b22;">#^Writer</span> output]
  (copy (StringReader. input) output))

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">copy</span> [String File] [<span style="color: #228b22;">#^String</span> input <span style="color: #228b22;">#^File</span> output]
  (copy (StringReader. input) output))

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">copy</span> [*char-array-type* OutputStream] [input <span style="color: #228b22;">#^OutputStream</span> output]
  (copy (CharArrayReader. input) output))

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">copy</span> [*char-array-type* Writer] [input <span style="color: #228b22;">#^Writer</span> output]
  (copy (CharArrayReader. input) output))

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">copy</span> [*char-array-type* File] [input <span style="color: #228b22;">#^File</span> output]
  (copy (CharArrayReader. input) output))

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">copy</span> [*byte-array-type* OutputStream] [#^<span style="color: #bc8f8f;">"[B"</span> input <span style="color: #228b22;">#^OutputStream</span> output]
  (copy (ByteArrayInputStream. input) output))

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">copy</span> [*byte-array-type* Writer] [#^<span style="color: #bc8f8f;">"[B"</span> input <span style="color: #228b22;">#^Writer</span> output]
  (copy (ByteArrayInputStream. input) output))

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">copy</span> [*byte-array-type* File] [#^<span style="color: #bc8f8f;">"[B"</span> input <span style="color: #228b22;">#^Writer</span> output]
  (copy (ByteArrayInputStream. input) output))


(<span style="color: #a020f0;">defmulti</span>
  #^{<span style="color: #da70d6;">:doc</span> <span style="color: #bc8f8f;">"Converts argument into a Java byte array.  Argument may be
  a String, File, InputStream, or Reader.  If the argument is already
  a byte array, returns it."</span>
    <span style="color: #da70d6;">:arglists</span> '([arg])}
  <span style="color: #0000ff;">to-byte-array</span> type)

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">to-byte-array</span> *byte-array-type* [x] x)

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">to-byte-array</span> String [<span style="color: #228b22;">#^String</span> x]
  (.getBytes x *default-encoding*))

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">to-byte-array</span> File [<span style="color: #228b22;">#^File</span> x]
  (<span style="color: #a020f0;">with-open</span> [input (FileInputStream. x)
              buffer (ByteArrayOutputStream.)]
    (copy input buffer)
    (.toByteArray buffer)))

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">to-byte-array</span> InputStream [<span style="color: #228b22;">#^InputStream</span> x]
  (<span style="color: #a020f0;">let</span> [buffer (ByteArrayOutputStream.)]
    (copy x buffer)
    (.toByteArray buffer)))

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">to-byte-array</span> Reader [<span style="color: #228b22;">#^Reader</span> x]
  (.getBytes (slurp* x) *default-encoding*))

(<span style="color: #a020f0;">defmulti</span> <span style="color: #0000ff;">relative-path-string</span> 
  <span style="color: #bc8f8f;">"Interpret a String or java.io.File as a relative path string. 
   Building block for clojure.contrib.java/file."</span>
  class)

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">relative-path-string</span> String [<span style="color: #228b22;">#^String</span> s]
  (relative-path-string (File. s)))

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">relative-path-string</span> File [<span style="color: #228b22;">#^File</span> f]
  (<span style="color: #a020f0;">if</span> (.isAbsolute f)
    (<span style="color: #a020f0;">throw</span> (IllegalArgumentException. (<span style="color: #da70d6;">str</span> f <span style="color: #bc8f8f;">" is not a relative path"</span>)))
    (.getPath f)))


(<span style="color: #a020f0;">defn</span> <span style="color: #228b22;">#^File</span> <span style="color: #0000ff;">file</span>
  <span style="color: #bc8f8f;">"Returns a java.io.File from string or file args."</span>
  ([arg]                      
     (as-file arg))
  ([parent child]             
     (File. <span style="color: #228b22;">#^File</span> (as-file parent) <span style="color: #228b22;">#^String</span> (relative-path-string child)))
  ([parent child &amp; more]
     (<span style="color: #da70d6;">reduce</span> file (file parent child) more)))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">delete-file</span>
  <span style="color: #bc8f8f;">"Delete file f. Raise an exception if it fails unless silently is true."</span>
  [f &amp; [silently]]
  (<span style="color: #a020f0;">or</span> (.delete (file f))
      silently
      (<span style="color: #a020f0;">throw</span> (java.io.IOException. (<span style="color: #da70d6;">str</span> <span style="color: #bc8f8f;">"Couldn't delete "</span> f)))))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">delete-file-recursively</span>
  <span style="color: #bc8f8f;">"Delete file f. If it's a directory, recursively delete all its contents.
Raise an exception if any deletion fails unless silently is true."</span>
  [f &amp; [silently]]
  (<span style="color: #a020f0;">let</span> [f (file f)]
    (<span style="color: #a020f0;">if</span> (.isDirectory f)
      (<span style="color: #a020f0;">doseq</span> [child (.listFiles f)]
        (delete-file-recursively child silently)))
    (delete-file f silently)))

(<span style="color: #a020f0;">defmulti</span>
  #^{<span style="color: #da70d6;">:doc</span> <span style="color: #bc8f8f;">"Coerces argument (URL, URI, or String) to a java.net.URL."</span>
     <span style="color: #da70d6;">:arglists</span> '([arg])}
  <span style="color: #0000ff;">as-url</span> type)

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">as-url</span> URL [x] x)

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">as-url</span> URI [<span style="color: #228b22;">#^URI</span> x] (.toURL x))

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">as-url</span> String [<span style="color: #228b22;">#^String</span> x] (URL. x))

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">as-url</span> File [<span style="color: #228b22;">#^File</span> x] (.toURL x))



(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">make-parents</span>
  <span style="color: #bc8f8f;">"Creates all parent directories of file."</span>
  [file]
  (.mkdirs (.getParentFile (as-file file))))


(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">copy-dir</span> [source target]
  (<span style="color: #a020f0;">let</span> [source (as-file source) target (as-file target)]
    (make-parents target)
    (<span style="color: #a020f0;">loop</span> [source source target target]
      (<span style="color: #a020f0;">if</span> (.isDirectory source)
        (<span style="color: #a020f0;">do</span> (<span style="color: #a020f0;">if</span> (<span style="color: #da70d6;">not</span> (.exists target)) (.mkdir target))
            (<span style="color: #a020f0;">doseq</span> [child (.list source)]             
              (copy-dir (file source child) (file target child))))
        (<span style="color: #a020f0;">if</span> (.exists source) (copy source target))))))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">file-type</span> [f]
  (<span style="color: #a020f0;">if</span> (.isFile f)
    (<span style="color: #a020f0;">let</span> [a (.split (.getName f) <span style="color: #bc8f8f;">"\\."</span>)]
      (<span style="color: #a020f0;">if</span> (<span style="color: #da70d6;">&gt;</span> (<span style="color: #da70d6;">count</span> a) 1)
        (<span style="color: #da70d6;">last</span> a)
        <span style="color: #bc8f8f;">""</span>))
    <span style="color: #bc8f8f;">""</span>))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">list-files</span> [source]
  (<span style="color: #a020f0;">let</span> [source (as-file source)
        files (.listFiles source)]
    (<span style="color: #da70d6;">lazy-seq</span>
     (<span style="color: #a020f0;">if</span> (<span style="color: #da70d6;">empty?</span> files)
       nil
       (<span style="color: #da70d6;">apply</span> concat (<span style="color: #da70d6;">vec</span> files) (<span style="color: #da70d6;">map</span> list-files (<span style="color: #da70d6;">filter</span> #(.isDirectory %) files)))))))

<span style="color: #b22222;">;;</span><span style="color: #b22222;">(count (filter #(= (file-type %) "clj") (list-files "/home/seth/Dropbox/.rep/clj-forex/")))
</span></pre></div>



</div>

</div>
