clj-forex.html

<div id="outline-container-4_2_3" class="outline-4">
<h4 id="sec-4_2_3"><span class="section-number-4">4.2.3</span> Core </h4>
<div class="outline-text-4" id="text-4_2_3">




<div class="org-src-container"><label class="org-src-name">forex-util-core()</label><pre class="src src-clojure">
(clojure.core/<span style="color: #da70d6;">use</span> 'nstools.ns)
(ns+ forex.util.core
  (<span style="color: #da70d6;">:clone</span> clj.core)
  (<span style="color: #da70d6;">:use</span> forex.util.emacs forex.util.general forex.util.spawn forex.util.log)
  (<span style="color: #da70d6;">:require</span> clojure.contrib.error-kit clojure.contrib.pprint)
  (<span style="color: #da70d6;">:import</span> java.io.File (org.joda.time DateTime DateTimeZone Instant)))

(<span style="color: #a020f0;">defonce</span> <span style="color: #0000ff;">*debug*</span> true)
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">debug</span> [msg &amp; args]
  (<span style="color: #a020f0;">when</span> *debug* (<span style="color: #da70d6;">apply</span> out (<span style="color: #da70d6;">str</span> <span style="color: #bc8f8f;">"DEBUG: "</span> msg) args)))
<span style="color: #b22222;">;;</span><span style="color: #b22222;">TODO: we need a combination of saving using byte straems and saving as clojure! that way clojure stuff is compatible with later stuff 
</span>
(<span style="color: #a020f0;">defn-</span> <span style="color: #0000ff;">make-exception</span> [a] (Exception. a))
(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">print-dup</span> Exception [o w]
  (.write w (<span style="color: #da70d6;">str</span> <span style="color: #bc8f8f;">"#=(forex.util.core/make-exception \""</span> (.getMessage o) <span style="color: #bc8f8f;">"\")"</span>)))

<span style="color: #b22222;">;;</span><span style="color: #b22222;">TODO: memoize pow?
</span><span style="color: #b22222;">;;</span><span style="color: #b22222;">used from http://groups.google.com/group/clojure/browse_thread/thread/cb5246d07142a3dc?fwc=2&amp;pli=1
</span>(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">frm-save</span> 
 <span style="color: #bc8f8f;">"Save a clojure form to file."</span> 
  [file form] 
  (<span style="color: #a020f0;">with-open</span> [w (java.io.FileWriter.
                 (<span style="color: #a020f0;">if</span> (<span style="color: #da70d6;">instance?</span> File file) file (File. file)))] 
    (<span style="color: #a020f0;">binding</span> [*out* w *print-dup* true] (<span style="color: #da70d6;">prn</span> form))))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">frm-load</span> 
  <span style="color: #bc8f8f;">"Load a clojure form from file."</span> 
  [file] 
  (<span style="color: #a020f0;">with-open</span> [r (java.io.PushbackReader. 
     (java.io.FileReader. (<span style="color: #a020f0;">if</span> (<span style="color: #da70d6;">instance?</span> File file) file (File. file))))] 
     (<span style="color: #a020f0;">let</span> [rec (<span style="color: #da70d6;">read</span> r)] 
       rec)))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">round</span> [num places]
  (<span style="color: #a020f0;">let</span> [multiplier (Math/pow 10 places)]
    (<span style="color: #da70d6;">/</span> (<span style="color: #da70d6;">int</span> (<span style="color: #da70d6;">*</span> num multiplier)) multiplier)))
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">ns?</span> [a] (<span style="color: #da70d6;">instance?</span> clojure.lang.Namespace a))
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">decimal-places</span> [num]
  (<span style="color: #a020f0;">let</span> [<span style="color: #228b22;">^String</span> s (<span style="color: #da70d6;">reverse</span> (<span style="color: #da70d6;">second</span> (.split (<span style="color: #da70d6;">str</span> (<span style="color: #da70d6;">double</span> num)) <span style="color: #bc8f8f;">"\\."</span>)))
        c (<span style="color: #da70d6;">count</span> s)]
    (<span style="color: #a020f0;">loop</span> [c (<span style="color: #da70d6;">nth</span> s 0) i 0]
      (<span style="color: #a020f0;">cond</span>
       (<span style="color: #a020f0;">or</span> (<span style="color: #da70d6;">=</span> i c) (<span style="color: #da70d6;">not</span> (<span style="color: #da70d6;">=</span> c \0)))
       (<span style="color: #da70d6;">-</span> (<span style="color: #da70d6;">count</span> s) i)
       true
       (<span style="color: #a020f0;">recur</span> (<span style="color: #da70d6;">nth</span> s (<span style="color: #da70d6;">inc</span> i)) (<span style="color: #da70d6;">inc</span> i))))))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">ns-symbol</span>
  ([symbol] (ns-symbol symbol *ns*))
  ([symbol ns] (ns-symbol symbol ns nil))
  ([symbol ns default]
     (<span style="color: #a020f0;">let</span> [var ((<span style="color: #da70d6;">ns-interns</span> ns) symbol)]
       (<span style="color: #a020f0;">if</span> (<span style="color: #a020f0;">and</span> (<span style="color: #da70d6;">var?</span> var) (<span style="color: #da70d6;">var-get</span> var)) var default))))

(<span style="color: #a020f0;">deftype</span> <span style="color: #0000ff;">AtomHash</span> [val]
  Object
  (toString [this] (<span style="color: #da70d6;">str</span> <span style="color: #bc8f8f;">"&lt;AtomHash "</span> @val <span style="color: #bc8f8f;">"&gt;"</span>))
  clojure.lang.IPersistentMap
  <span style="color: #b22222;">;;</span><span style="color: #b22222;">ILookup
</span>  (valAt [this key] (<span style="color: #da70d6;">get</span> @val key))
  (valAt [this key notfound] (<span style="color: #da70d6;">get</span> @val key notfound))
  <span style="color: #b22222;">;;</span><span style="color: #b22222;">IPersistentCollection
</span>  (<span style="color: #da70d6;">count</span> [this] (.count @val))
  (<span style="color: #da70d6;">empty</span> [this]  {}) 
  (<span style="color: #da70d6;">cons</span> [this e]  (.cons @val e))
  (equiv [this gs] (<span style="color: #a020f0;">or</span> (<span style="color: #da70d6;">identical?</span> this gs)
                       (<span style="color: #a020f0;">when</span> (<span style="color: #da70d6;">identical?</span> (<span style="color: #da70d6;">class</span> this) (<span style="color: #da70d6;">class</span> gs))
                         (<span style="color: #da70d6;">=</span> val (.val gs)))))
  (containsKey [this k] (<span style="color: #a020f0;">or</span> (<span style="color: #a020f0;">and</span> (<span style="color: #da70d6;">get</span> @val k) true) false))
  (entryAt [this k] (<span style="color: #da70d6;">get</span> @val k))
  <span style="color: #b22222;">;;</span><span style="color: #b22222;">Seqable
</span>  (<span style="color: #da70d6;">seq</span> [this] (<span style="color: #da70d6;">seq</span> @val))
  <span style="color: #b22222;">;;</span><span style="color: #b22222;">Associative 
</span>  (<span style="color: #da70d6;">assoc</span> [this k g] (<span style="color: #da70d6;">assoc</span> @val k g))
  (assocEx [this k g] (<span style="color: #da70d6;">assoc</span> this k g))
  (without [this k] (.without @val k))
  clojure.lang.IDeref
  (<span style="color: #da70d6;">deref</span> [this] @val))
<span style="color: #b22222;">;;</span><span style="color: #b22222;">todo - create ns-resolve-symbol, instead of hardcoding namespace
</span><span style="color: #b22222;">;;</span><span style="color: #b22222;">TODO: add pprint
</span>(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">print-dup</span> AtomHash [o w]
  (.write w <span style="color: #bc8f8f;">"#=(forex.util.core/atom-hash "</span>) (<span style="color: #da70d6;">print-dup</span> @o w) (.write w <span style="color: #bc8f8f;">")"</span>))

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">clojure.core/print-method</span> AtomHash [o w]
  (.write w (.toString o)))
<span style="color: #b22222;">;;</span><span style="color: #b22222;">TODO: make into protocol method! not multimethod!
</span>(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">swap!</span>  forex.util.core.AtomHash [a &amp; args]
  (<span style="color: #da70d6;">apply</span> swap! (.val a) args))
(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">reset!</span>  forex.util.core.AtomHash [a &amp; args]
  (<span style="color: #da70d6;">apply</span> reset! (.val a) args))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">atom-hash</span>
  ([] (atom-hash {}))
  ([val]
     (<span style="color: #a020f0;">let</span> [val (<span style="color: #a020f0;">if</span> (<span style="color: #da70d6;">nil?</span> val) {} val)]
      (<span style="color: #228b22;">is</span> (<span style="color: #da70d6;">map?</span> val))
      (AtomHash. (<span style="color: #da70d6;">atom</span> val)))))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">symbolicate</span>
  <span style="color: #bc8f8f;">"symbolicate symbols together. ignores things like whitespaces, just drops them!"</span>
  [&amp; args]
  (<span style="color: #da70d6;">symbol</span> (<span style="color: #da70d6;">apply</span> str args)))

(<span style="color: #a020f0;">defmacro</span> <span style="color: #0000ff;">naive-var-local-cache-strategy</span> [var] 
 `(<span style="color: #a020f0;">let</span> [cache# (<span style="color: #da70d6;">atom</span> {})]
    (<span style="color: #da70d6;">reify</span> PCachingStrategy
      (retrieve [_ item#] (<span style="color: #da70d6;">get</span> @cache# item#))
      (cached? [_ item#] (<span style="color: #da70d6;">contains?</span> @cache# item#))
      (hit [this# _] this#)
      (miss [this# item# result#]
            (<span style="color: #da70d6;">reset!</span> cache# (<span style="color: #da70d6;">swap!</span> ~var assoc item# result#))
            this#))))

(<span style="color: #a020f0;">defmacro</span> <span style="color: #0000ff;">constants</span> [&amp; args]
  `(<span style="color: #a020f0;">do</span> ~@(<span style="color: #da70d6;">map</span> (<span style="color: #da70d6;">fn</span> [[name val]] `(<span style="color: #a020f0;">def</span> <span style="color: #0000ff;">~name</span> ~val)) (group args 2))))

(<span style="color: #a020f0;">defmacro</span> <span style="color: #0000ff;">spawn-log</span> [func name]
  `(spawn (<span style="color: #da70d6;">fn</span> [] (<span style="color: #a020f0;">try</span> (~func) (<span style="color: #a020f0;">catch</span> Exception e#
                                (.printStackTrace e#) (severe e#))))
          ~name)) 

(<span style="color: #a020f0;">defonce</span> <span style="color: #0000ff;">*env*</span> (<span style="color: #da70d6;">atom</span> {<span style="color: #da70d6;">:period</span> 240 <span style="color: #da70d6;">:symbol</span> <span style="color: #bc8f8f;">"EURUSD"</span>})) <span style="color: #b22222;">;</span><span style="color: #b22222;">default +H4+, EURUSD
</span>(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">env</span>
  ([] @*env*)
  ([key] (<span style="color: #da70d6;">get</span> @*env* key)))
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">env!</span> [map] 
  (<span style="color: #da70d6;">swap!</span> *env* #(<span style="color: #da70d6;">merge</span> % map))
  map)

(<span style="color: #a020f0;">defmacro</span> <span style="color: #0000ff;">wenv</span> [map &amp; body] 
  `(<span style="color: #a020f0;">binding</span> [forex.util.core/*env*
             (<span style="color: #da70d6;">atom</span> (<span style="color: #da70d6;">merge</span> @@~#'*env* ~map))]
     ~@body))

<span style="color: #b22222;">;;</span><span style="color: #b22222;">aliases for error kit
</span>(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">ns-export</span> [from-ns]  
  (<span style="color: #da70d6;">count</span> (<span style="color: #a020f0;">doall</span> (<span style="color: #da70d6;">map</span> (<span style="color: #da70d6;">fn</span> [[sym var]]
                       (<span style="color: #a020f0;">let</span> [var-obj (<span style="color: #a020f0;">if</span> (.hasRoot var)
                                       (<span style="color: #da70d6;">intern</span> *ns* sym (<span style="color: #da70d6;">var-get</span> var))
                                       (<span style="color: #da70d6;">intern</span> *ns* sym))]
                         (<span style="color: #a020f0;">when</span> var-obj
                           (<span style="color: #da70d6;">alter-meta!</span> var-obj
                                        (<span style="color: #da70d6;">fn</span> [old] (<span style="color: #da70d6;">merge</span> (<span style="color: #da70d6;">meta</span> var) old)))
                           var-obj)))
                     (<span style="color: #da70d6;">ns-publics</span> from-ns)))))

(<span style="color: #a020f0;">defmacro</span> <span style="color: #0000ff;">eval-when</span> [&amp; args]
  (<span style="color: #da70d6;">eval</span> `(<span style="color: #a020f0;">do</span> ~@args)) nil)

(eval-when
 (<span style="color: #da70d6;">require</span> 'clojure.contrib.error-kit)
 (ns-export (<span style="color: #da70d6;">find-ns</span> 'clojure.contrib.error-kit)))

(deferror *clj-forex-error* [] [message] 
  {<span style="color: #da70d6;">:msg</span> (<span style="color: #da70d6;">str</span> <span style="color: #bc8f8f;">"clj-forex error: "</span> message) 
   <span style="color: #da70d6;">:unhandled</span> (throw-msg Exception)})

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">throwf</span> [msg &amp; args] (raise *clj-forex-error* (<span style="color: #da70d6;">apply</span> format  msg args)))

(<span style="color: #a020f0;">defmacro</span> <span style="color: #0000ff;">is?</span>
  [val &amp; message]
  (<span style="color: #a020f0;">if</span> (<span style="color: #da70d6;">vector?</span> val)
    `(<span style="color: #a020f0;">do</span> ~@(<span style="color: #da70d6;">map</span> (<span style="color: #da70d6;">fn</span> [test] `(is? ~test ~@message)) val))
    `(<span style="color: #a020f0;">let</span> [result# ~val]
       (<span style="color: #a020f0;">if</span> (<span style="color: #da70d6;">not</span> result#)
         (throwf  ~(<span style="color: #a020f0;">or</span> (<span style="color: #a020f0;">and</span> (<span style="color: #da70d6;">first</span> message)
                            `(<span style="color: #da70d6;">format</span> ~@message))
                       (<span style="color: #da70d6;">format</span> <span style="color: #bc8f8f;">"assertion %s failed"</span>
                               (<span style="color: #da70d6;">str</span> val))))
         result#))))
</pre></div>


</div>

</div>
