clj-forex.html

<div id="outline-container-4_2_4" class="outline-4">
<h4 id="sec-4_2_4"><span class="section-number-4">4.2.4</span> General </h4>
<div class="outline-text-4" id="text-4_2_4">




<div class="org-src-container"><label class="org-src-name">forex-util-general()</label><pre class="src src-clojure">
(<span style="color: #a020f0;">ns</span> forex.util.general 
  (<span style="color: #da70d6;">:require</span>  [clojure.contrib.str-utils2 <span style="color: #da70d6;">:as</span> s] clojure.string)
  (<span style="color: #da70d6;">:import</span> java.lang.management.ManagementFactory)
  (<span style="color: #da70d6;">:require</span> [matchure <span style="color: #da70d6;">:as</span> m]
            [clojure.contrib.def <span style="color: #da70d6;">:as</span> d])
  (<span style="color: #da70d6;">:use</span> clojure.contrib.macro-utils))

(<span style="color: #a020f0;">defmacro</span> <span style="color: #0000ff;">with-out-str+</span>
  <span style="color: #bc8f8f;">"Evaluates exprs in a context in which *out* is bound to a fresh
  StringWriter.  Returns the string created by any nested printing
  calls."</span>  {<span style="color: #da70d6;">:added</span> <span style="color: #bc8f8f;">"1.0"</span>} [arg &amp; body]
  `(<span style="color: #a020f0;">let</span> [~arg (new java.io.StringWriter)]
     (<span style="color: #a020f0;">binding</span> [*out* ~arg]
       ~@body)))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">add-shutdown-hook</span> [a]
  (<span style="color: #a020f0;">try</span>
    (.addShutdownHook (Runtime/getRuntime) a)
    true
    (<span style="color: #a020f0;">catch</span> Exception e false)))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">dump-threads</span> []
  (<span style="color: #a020f0;">let</span> [info (.dumpAllThreads (ManagementFactory/getThreadMXBean) false false)]
   (<span style="color: #a020f0;">doall</span>
    (<span style="color: #da70d6;">map</span> println info))
   (<span style="color: #da70d6;">count</span> info)))


(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">seq1</span> [s]
  (<span style="color: #da70d6;">reify</span> clojure.lang.ISeq
    (<span style="color: #da70d6;">first</span> [_] (.first s))
    (more [_] (seq1 (.more s)))
    (<span style="color: #da70d6;">next</span> [_] (<span style="color: #a020f0;">let</span> [sn (.next s)] (<span style="color: #a020f0;">and</span> sn (seq1 sn))))
    (<span style="color: #da70d6;">seq</span> [_] (<span style="color: #a020f0;">let</span> [ss (.seq s)] (<span style="color: #a020f0;">and</span> ss (seq1 ss))))
    (<span style="color: #da70d6;">count</span> [_] (.count s))
    (<span style="color: #da70d6;">cons</span> [_ o] (.cons s o))
    (<span style="color: #da70d6;">empty</span> [_] (.empty s))
    (equiv [_ o] (.equiv s o))))
(d/defalias defalias d/defalias)

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">upper?</span> [s]
  (<span style="color: #da70d6;">=</span> (.toUpperCase s) s))

(<span style="color: #a020f0;">def</span> <span style="color: #0000ff;">join</span> clojure.string/<span style="color: #228b22;">join</span>)
(<span style="color: #a020f0;">def</span> <span style="color: #0000ff;">split</span> s/split)
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">atom?</span> [a] (<span style="color: #a020f0;">or</span> (<span style="color: #da70d6;">symbol?</span> a) (<span style="color: #da70d6;">number?</span> a)))

<span style="color: #b22222;">;;</span><span style="color: #b22222;">camel case - gotten from defrecord2 on github
</span>(<span style="color: #a020f0;">defn-</span> <span style="color: #0000ff;">assemble-words</span> [parts]
  (<span style="color: #a020f0;">loop</span> [remaining-parts parts result []]
    (<span style="color: #a020f0;">if</span> (<span style="color: #da70d6;">seq</span> remaining-parts)
      (<span style="color: #a020f0;">let</span> [part (<span style="color: #da70d6;">first</span> remaining-parts)]
        (<span style="color: #a020f0;">recur</span> (<span style="color: #da70d6;">rest</span> remaining-parts)
               (<span style="color: #a020f0;">if</span> (upper? part)
                 (<span style="color: #da70d6;">conj</span> result (.toLowerCase part))
                 (<span style="color: #da70d6;">conj</span> (<span style="color: #a020f0;">if</span> (<span style="color: #da70d6;">seq</span> result)
                         (<span style="color: #da70d6;">pop</span> result)
                         []) (<span style="color: #da70d6;">str</span> (<span style="color: #da70d6;">last</span> result) part)))))
      result)))



(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">camel-to-dash</span>
  <span style="color: #bc8f8f;">"Convert a name like 'BigBlueCar' to 'big-blue-car'."</span>
  [s]
  (<span style="color: #a020f0;">let</span> [parts (<span style="color: #da70d6;">remove</span> #(<span style="color: #da70d6;">=</span> <span style="color: #bc8f8f;">""</span> %) (s/partition s #<span style="color: #bc8f8f;">"[A-Z]"</span>))
        words (assemble-words parts)]
    (<span style="color: #228b22;">join</span> <span style="color: #bc8f8f;">"-"</span> words)))
<span style="color: #b22222;">;;;</span><span style="color: #b22222;">
</span>
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">classpath</span> []
  (<span style="color: #da70d6;">seq</span> (.getURLs (java.lang.ClassLoader/getSystemClassLoader))))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">sequence?</span> [a] (<span style="color: #a020f0;">or</span> (<span style="color: #da70d6;">list?</span> a) (<span style="color: #da70d6;">vector?</span> a) (<span style="color: #da70d6;">seq?</span> a)))
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">var-root-set</span> [var val]
  (<span style="color: #da70d6;">alter-var-root</span> var (<span style="color: #da70d6;">constantly</span> val)))

<span style="color: #b22222;">;;</span><span style="color: #b22222;">copied from  
</span>(<span style="color: #a020f0;">defprotocol</span> <span style="color: #0000ff;">PCachingStrategy</span>
  <span style="color: #bc8f8f;">"A caching strategy implements the backend for memoize. It handles the
  underlying cache and might define different strategies to remove old
  items from the cache."</span>
  (retrieve [cache item] <span style="color: #bc8f8f;">"Get the requested cache item."</span>)
  (cached?  [cache item] <span style="color: #bc8f8f;">"Checks whether the given argument list is cached."</span>)
  (hit      [cache item] <span style="color: #bc8f8f;">"Called in case of a cache hit."</span>)
  (miss     [cache item result] <span style="color: #bc8f8f;">"Called in case of a cache miss."</span>))

(<span style="color: #da70d6;">declare</span> naive-cache-strategy)

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">mem</span>
  <span style="color: #bc8f8f;">"Returns a memoized version of a referentially transparent function.
  The memoized version of the function keeps a cache of the mapping from
  arguments to results and, when calls with the same arguments are repeated
  often, has higher performance at the expense of higher memory use.
  Optionally takes a cache strategy. Default is the naive safe all strategy."</span>
  ([f] (mem f (naive-cache-strategy)))
  ([f strategy]
   (<span style="color: #a020f0;">let</span> [cache-state (<span style="color: #da70d6;">atom</span> strategy)
         hit-or-miss (<span style="color: #da70d6;">fn</span> [cache item]
                       (<span style="color: #a020f0;">if</span> (cached? cache item)
                         (hit cache item)
                         (miss cache item (<span style="color: #da70d6;">delay</span> (<span style="color: #da70d6;">apply</span> f item)))))]
     (<span style="color: #da70d6;">fn</span> [&amp; args]
       (<span style="color: #a020f0;">let</span> [cs (<span style="color: #da70d6;">swap!</span> cache-state hit-or-miss args)]
         @(retrieve cs args))))))

(<span style="color: #a020f0;">deftype</span> ^{<span style="color: #da70d6;">:private</span> true} <span style="color: #0000ff;">NaiveStrategy</span> [cache]
  PCachingStrategy
  (retrieve
    [_ item]
    (<span style="color: #da70d6;">get</span> cache item))
  (cached?
    [_ item]
    (<span style="color: #da70d6;">contains?</span> cache item))
  (hit
    [this _]
    this)
  (miss
    [_ item result]
    (NaiveStrategy. (<span style="color: #da70d6;">assoc</span> cache item result))))

(<span style="color: #a020f0;">defn-</span> <span style="color: #0000ff;">naive-cache-strategy</span>
  <span style="color: #bc8f8f;">"The naive safe-all cache strategy for memoize."</span>
  []
  (NaiveStrategy. {}))  2



<span style="color: #b22222;">;;;;;;;;;;;;;;;;;;</span><span style="color: #b22222;">
</span><span style="color: #b22222;">;;;;;;;;;;;;;;;;;</span><span style="color: #b22222;">
</span>
(<span style="color: #a020f0;">defmacro</span> <span style="color: #0000ff;">defonce-</span>
  <span style="color: #bc8f8f;">"Same as defonce but yields a private definition"</span>
  ([name expr]
     (<span style="color: #da70d6;">list</span> `defonce (<span style="color: #da70d6;">with-meta</span> name (<span style="color: #da70d6;">assoc</span> (<span style="color: #da70d6;">meta</span> name) <span style="color: #da70d6;">:private</span> true)) expr))
  ([name expr doc]
     (<span style="color: #da70d6;">list</span> `defonce (<span style="color: #da70d6;">with-meta</span> name (<span style="color: #da70d6;">assoc</span> (<span style="color: #da70d6;">meta</span> name) <span style="color: #da70d6;">:private</span> true <span style="color: #da70d6;">:doc</span> doc)) expr)))
(<span style="color: #a020f0;">defmacro</span> <span style="color: #0000ff;">def-</span>
  <span style="color: #bc8f8f;">"Same as def but yields a private definition"</span>
  [name &amp; decls]
  (<span style="color: #da70d6;">list*</span> `def (<span style="color: #da70d6;">with-meta</span> name (<span style="color: #da70d6;">assoc</span> (<span style="color: #da70d6;">meta</span> name) <span style="color: #da70d6;">:private</span> true)) decls))
(<span style="color: #a020f0;">defmacro</span> <span style="color: #0000ff;">defmacro-</span>
  <span style="color: #bc8f8f;">"Same as defmacro but yields a private definition"</span>
  [name &amp; decls]
  (<span style="color: #da70d6;">list*</span> `defmacro (<span style="color: #da70d6;">with-meta</span> name (<span style="color: #da70d6;">assoc</span> (<span style="color: #da70d6;">meta</span> name) <span style="color: #da70d6;">:private</span> true)) decls))
<span style="color: #b22222;">;;</span><span style="color: #b22222;">WARNING: this can screw up protocols implemented on existing object - i.e. replace them, they no longer work! so you have to create new object. how to fix this???...
</span>(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">reload</span>
  ([] (reload *ns*))
  ([n]
     (<span style="color: #a020f0;">let</span> [name (<span style="color: #a020f0;">cond</span> (<span style="color: #da70d6;">symbol?</span> n) n true (<span style="color: #da70d6;">ns-name</span> n))]
       (<span style="color: #da70d6;">require</span> name <span style="color: #da70d6;">:reload-all</span>))))

(<span style="color: #a020f0;">def-</span> <span style="color: #0000ff;">*fake*</span> (<span style="color: #da70d6;">gensym</span>))
(<span style="color: #a020f0;">defmacro</span> <span style="color: #0000ff;">defrecord+</span> 
  [record-name fields-and-values constructor-name &amp; record-body] 
  (<span style="color: #a020f0;">let</span> [fields-and-values (<span style="color: #da70d6;">map</span> #(<span style="color: #a020f0;">if</span> (<span style="color: #da70d6;">vector?</span> %) % [% nil])
                               fields-and-values) 
        fields            (<span style="color: #da70d6;">vec</span> (<span style="color: #da70d6;">map</span> first fields-and-values)) 
        default-map       (<span style="color: #da70d6;">into</span> {} fields-and-values)
        fn-name (<span style="color: #da70d6;">symbol</span> (<span style="color: #a020f0;">or</span> (<span style="color: #a020f0;">and</span> constructor-name (<span style="color: #da70d6;">str</span> constructor-name))
                            (<span style="color: #da70d6;">str</span> <span style="color: #bc8f8f;">"new-"</span> (<span style="color: #da70d6;">name</span> record-name))))] 
    `(<span style="color: #a020f0;">do</span> 
       (<span style="color: #a020f0;">defrecord</span> <span style="color: #0000ff;">~record-name</span> 
           ~fields 
         ~@record-body) 
       (<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">~fn-name</span>
         ([] (~fn-name ~#'*fake* nil))
         ([&amp; {<span style="color: #da70d6;">:keys</span> ~fields <span style="color: #da70d6;">:or</span> ~default-map}] 
            (new ~record-name ~@fields))))))

(<span style="color: #a020f0;">binding</span> [*out* *out*] (<span style="color: #a020f0;">defn-</span> <span style="color: #0000ff;">log</span> [e] (.println *out* (<span style="color: #da70d6;">str</span> <span style="color: #bc8f8f;">"ERROR!: "</span> e))))

<span style="color: #b22222;">;;</span><span style="color: #b22222;">TODO: get rid of!
</span>(<span style="color: #a020f0;">defmacro</span> <span style="color: #0000ff;">mapc</span> [&amp; args] `(<span style="color: #a020f0;">dorun</span> (<span style="color: #da70d6;">map</span> ~@args)))
(<span style="color: #a020f0;">defmacro</span> <span style="color: #0000ff;">thread</span> [&amp; body]
  `(<span style="color: #a020f0;">let</span> [thread# (Thread.
                  (<span style="color: #da70d6;">bound-fn</span> [] (<span style="color: #a020f0;">try</span> (<span style="color: #a020f0;">do</span> ~@body) (<span style="color: #a020f0;">catch</span> Exception e# (<span style="color: #da70d6;">println</span> <span style="color: #bc8f8f;">"error in thread "</span> e#)))))]
     (.start thread#)
     thread#))

(<span style="color: #a020f0;">defmacro</span> <span style="color: #0000ff;">is</span> [val &amp; message]
  `(<span style="color: #a020f0;">let</span> [result# ~val]
     (<span style="color: #a020f0;">if</span> (<span style="color: #da70d6;">not</span> result#)
       (<span style="color: #a020f0;">throw</span> (Exception. ~(<span style="color: #a020f0;">or</span> (<span style="color: #a020f0;">and</span> (<span style="color: #da70d6;">first</span> message) `(<span style="color: #da70d6;">format</span> ~@message)) (<span style="color: #da70d6;">format</span> <span style="color: #bc8f8f;">"assert: %s"</span> (<span style="color: #da70d6;">str</span> val)))))
       result#)))
<span style="color: #b22222;">;;</span><span style="color: #b22222;">TODO: efficiency: timeout without throwing exception? and definitely a timeout with all that thread hastle!
</span><span style="color: #b22222;">;; </span><span style="color: #b22222;">this should be done in a thread pool!
</span>(<span style="color: #a020f0;">defmacro</span> <span style="color: #0000ff;">pf</span> [&amp; args]
  `(<span style="color: #da70d6;">print</span> (<span style="color: #da70d6;">format</span> ~@args)))

(<span style="color: #da70d6;">comment</span>
  (<span style="color: #a020f0;">defmacro</span> <span style="color: #0000ff;">throwf</span> [message &amp; args]
   (<span style="color: #a020f0;">if</span> args
     `(<span style="color: #a020f0;">throw</span> (Exception. (<span style="color: #da70d6;">format</span> ~message ~@args)))
     `(<span style="color: #a020f0;">throw</span> (Exception. ~message)))))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">group</span>
  ([coll] (group coll 2))
  ([coll by] (partition-all by coll)))

(<span style="color: #a020f0;">defmacro</span> <span style="color: #0000ff;">do1</span> [a &amp; body]
  `(<span style="color: #a020f0;">let</span> [ret# ~a]
     ~@body
     ret#))
(<span style="color: #a020f0;">defmacro</span> <span style="color: #0000ff;">mapc</span> [&amp; args] `(<span style="color: #a020f0;">dorun</span> (<span style="color: #da70d6;">map</span> ~@args)))
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">sleep</span> [s] (Thread/sleep (<span style="color: #da70d6;">*</span> 1000 s)))


(<span style="color: #a020f0;">defmacro</span> <span style="color: #0000ff;">on</span> [[&amp; args] &amp; body]
  (<span style="color: #a020f0;">let</span> [a (group args 2)
        first-args (<span style="color: #da70d6;">map</span> first a)
        second-args (<span style="color: #da70d6;">map</span> second a)]
    `(<span style="color: #a020f0;">doseq</span> [[~@first-args] (<span style="color: #da70d6;">map</span> vector ~@second-args)]
       ~@body)))





(<span style="color: #a020f0;">defalias</span> <span style="color: #0000ff;">if-match</span> m/if-match)
(<span style="color: #a020f0;">defalias</span> <span style="color: #0000ff;">when-match</span> m/when-match)
(<span style="color: #a020f0;">defalias</span> <span style="color: #0000ff;">cond-match</span> m/cond-match)
(<span style="color: #a020f0;">defmacro</span> <span style="color: #0000ff;">match</span>
  <span style="color: #bc8f8f;">"match item with caluses"</span>
  [item &amp; clauses] 
  (<span style="color: #a020f0;">let</span> [msg-gen (<span style="color: #da70d6;">gensym</span>)]
    `(<span style="color: #a020f0;">let</span> [~msg-gen ~item] 
       (cond-match
        ~@(<span style="color: #da70d6;">mapcat</span> (<span style="color: #da70d6;">fn</span> [[test body]]
                    `[[~test ~msg-gen] ~body]) (group clauses 2))))))
</pre></div>



</div>

</div>
