clj-forex.html

<div id="outline-container-4_2_5" class="outline-4">
<h4 id="sec-4_2_5"><span class="section-number-4">4.2.5</span> Log </h4>
<div class="outline-text-4" id="text-4_2_5">




<div class="org-src-container"><label class="org-src-name">forex-util-log()</label><pre class="src src-clojure">
(clojure.core/<span style="color: #da70d6;">use</span> 'nstools.ns)
(ns+ forex.util.log
  (<span style="color: #da70d6;">:clone</span> clj.core)
  (<span style="color: #da70d6;">:import</span> [java.util.logging Logger Level LogManager Handler
            FileHandler SimpleFormatter ConsoleHandler])
  (<span style="color: #da70d6;">:require</span> [clojure.contrib.duck-streams <span style="color: #da70d6;">:as</span> f])
  (<span style="color: #da70d6;">:use</span> forex.util.emacs forex.util.general))

<span style="color: #b22222;">;;</span><span style="color: #b22222;">TODO: minor mode
</span>(<span style="color: #a020f0;">defvar</span> <span style="color: #0000ff;">log-dir</span> <span style="color: #bc8f8f;">"%h/.forex"</span>)
(<span style="color: #a020f0;">defvar</span> <span style="color: #0000ff;">log-file</span>)

(<span style="color: #a020f0;">defn-</span> <span style="color: #0000ff;">formatter</span> [] 
  (<span style="color: #a020f0;">let</span> [d (java.util.Date.)]
    (<span style="color: #da70d6;">proxy</span> [java.util.logging.Formatter] []
      (<span style="color: #da70d6;">format</span> [r] 
              (clojure.core/<span style="color: #da70d6;">format</span> <span style="color: #bc8f8f;">"%s%n%s: %s%n%n"</span>
                                   (<span style="color: #a020f0;">do</span> (.setTime d (.getMillis r)) d)
                                   (.getLevel r)
                                   (.getMessage r))))))

<span style="color: #b22222;">;;</span><span style="color: #b22222;">wrap the PrintWriter *out* in an OutputStream to be used in ConsoleHandler
</span>(<span style="color: #da70d6;">comment</span>
  (<span style="color: #a020f0;">defn-</span> <span style="color: #0000ff;">new-out-stream</span> [out]
    (<span style="color: #da70d6;">proxy</span> [java.io.OutputStream] []
      (close [] (.close out))
      (<span style="color: #da70d6;">flush</span> [] (.flush out))
      (write ([b] (.print out (String. b)))
             ([b off len] (.print out (String. b off len)))))))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">new-logger</span>
  ([file] (new-logger file true))
  ([file make-file]
     (<span style="color: #a020f0;">when</span> make-file
       (<span style="color: #a020f0;">let</span> [file (<span style="color: #da70d6;">format</span> <span style="color: #bc8f8f;">"%s/.forex/%s"</span> (System/getProperty <span style="color: #bc8f8f;">"user.home"</span>)
                          file)]
         (f/make-parents
          (java.io.File. file))
         (var-root-set #'log-file file)))
     (<span style="color: #a020f0;">let</span> [l (java.util.logging.Logger/getLogger (<span style="color: #da70d6;">str</span> *ns*))]
       (mapc #(.removeHandler l %) (.getHandlers l))
       (.addHandler l (<span style="color: #a020f0;">doto</span> (ConsoleHandler.) (.setFormatter (formatter))))
       (<span style="color: #a020f0;">when</span> make-file
         (.addHandler l (<span style="color: #a020f0;">doto</span> (FileHandler. (<span style="color: #da70d6;">str</span> log-dir <span style="color: #bc8f8f;">"/"</span> file))
                          (.setFormatter (formatter)))))
       (.setUseParentHandlers l false)
       l)))

(<span style="color: #a020f0;">defvar</span> <span style="color: #0000ff;">log</span> (new-logger <span style="color: #bc8f8f;">"forex-log"</span> false))

<span style="color: #b22222;">;;</span><span style="color: #b22222;">TODO: set filtering levels
</span><span style="color: #b22222;">;;</span><span style="color: #b22222;">fine,finer,finest wont log
</span>
(<span style="color: #a020f0;">def-</span> <span style="color: #0000ff;">*debug-info*</span> <span style="color: #bc8f8f;">""</span>)
(<span style="color: #a020f0;">defmacro</span> <span style="color: #0000ff;">debugging</span> [str &amp; args] `(<span style="color: #a020f0;">binding</span> [*debug-info* ~str] ~@args))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">info</span> [msg &amp; args]
  (.info log (<span style="color: #da70d6;">apply</span> format (<span style="color: #da70d6;">str</span> *debug-info* <span style="color: #bc8f8f;">" "</span> msg) args)))
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">out</span> [msg &amp; args]
  (<span style="color: #da70d6;">println</span> (<span style="color: #da70d6;">apply</span> format (<span style="color: #da70d6;">str</span> <span style="color: #bc8f8f;">"INFO: "</span> *debug-info* <span style="color: #bc8f8f;">" "</span> msg) args))
  (<span style="color: #da70d6;">apply</span> info msg args)
  nil)

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">fine</span> [msg &amp; args]
   (.fine log (<span style="color: #da70d6;">apply</span> format  (<span style="color: #da70d6;">str</span> *debug-info* <span style="color: #bc8f8f;">" "</span> msg) args)))
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">finer</span> [msg &amp; args]
   (.finer log (<span style="color: #da70d6;">apply</span> format (<span style="color: #da70d6;">str</span> *debug-info* <span style="color: #bc8f8f;">" "</span> msg) args)))
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">finest</span> [msg &amp; args]
  (.finest log (<span style="color: #da70d6;">apply</span> format (<span style="color: #da70d6;">str</span> *debug-info* <span style="color: #bc8f8f;">" "</span> msg) args)))
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">severe</span> [msg &amp; args]
  (<span style="color: #a020f0;">let</span> [s (<span style="color: #da70d6;">apply</span> format (<span style="color: #da70d6;">str</span> *debug-info* <span style="color: #bc8f8f;">" "</span> msg) args)]
    (.severe log s)
    (<span style="color: #da70d6;">print</span> (<span style="color: #da70d6;">format</span> <span style="color: #bc8f8f;">"SEVERE: %s%n"</span> s))))
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">warn</span> [msg &amp; args]
  (<span style="color: #a020f0;">let</span> [s (<span style="color: #da70d6;">apply</span> format (<span style="color: #da70d6;">str</span> *debug-info* <span style="color: #bc8f8f;">" "</span> msg) args)]
    (.warning log s) 
    (<span style="color: #da70d6;">print</span> (<span style="color: #da70d6;">format</span> <span style="color: #bc8f8f;">"WARNING: %s%n"</span> s))))
</pre></div>



</div>

</div>
