clj-forex.org
*** Fiber
#+srcname:forex-util-fiber-spawn
#+begin_src clojure :tangle src/forex/util/fiber/spawn.clj
  ;;inspired by gambit-c termite's syntax
  (ns forex.util.fiber.spawn
    (:use forex.util.general)
    (:require [forex.util.fiber.mbox :as m]))

  ;;TODO: will eventually integrate with zeromq and will be able to be 'reactive' so we avoid
  ;;java's thread pool limit (or somehow get kilim to work?)
  ;;TODO: also, should we allow functions like ?? to discard messages? Perhaps not?
  ;;TODO: user settable default return value?
  ;;TODO: linking, remote nodes
  ;;utils
  (defonce- *mailboxes* (atom {}))
  (defn- make-mailbox [tag]
    (let [mb (m/new-mbox)]
      (swap! *mailboxes* assoc tag mb)
      mb))
  (defonce- *threads* (atom {}))

  (defn- remove-pid [pid]
    (when pid (swap! *threads* dissoc pid) (swap! *mailboxes* dissoc pid)))
  (defn- get-mailbox [tag]
    (get @*mailboxes* tag))
  (defn pid? [pid]
    "test for valid pid"
    (if (get-mailbox pid) true false))

  (defonce- *mb* (ThreadLocal.))
  (defonce- *self* (ThreadLocal.)) 
  (defn- mb [] (.get *mb*)) 

  ;; functions
  (let [r (java.util.Random.)]
    (defn make-tag []
      "produce a random tag/pid"
      (Long/toString (Math/abs (.nextLong r)) 36)))

  (defn ?? []
    (m/?? (mb) nil))
  (defn- throwf [& args] (throw (Exception. (apply format args))) )

  (defn !
    "send a message to a pid, with an option id which the message will be placed in"
    ([pid msg] (! pid nil msg))
    ([pid id msg]
       (if-let [mbox (get-mailbox pid)]
	 (m/! mbox id msg)
	 (throwf "unknown pid %s" pid))))
  (binding [*out* *out*] (defn- log [& args] (println (apply format args))))
  (defn self []
    "returns pid of current spawn or nil if it isnt a spawnage"
    (.get *self*))
  (defn spawn
    ([thunk] (spawn thunk nil))
    ([thunk name]
       (let [tag (make-tag)
	     mail (make-mailbox tag)]
	 (let [thread (let [thread (Thread.
				    (bound-fn
				     [] 
				     (try 
				       (do (.set *mb* mail) (.set *self* tag)
					   (thunk))
				       (catch Exception e
					 (log "pid %s error: %s " (self) e)
					 (.printStackTrace e)
					 )
				       (finally (remove-pid tag)))))]
			(if name (doto thread (.setName name)) thread))]
	   (swap! *threads* assoc tag thread)
	   (.start thread))
	 tag)))

  (defn- assert-spawn [] (when (not (self)) (throwf "no local spawn available")))
  ;;does work - but we dont really need it!

  (defn spawn-in-repl []
    "setup current thread as a spawned thread with mailbox"
    (let [tag (make-tag)]
      (remove-pid self)
      (.set *mb* (make-mailbox tag)) (.set *self* tag) (swap! *threads* assoc tag (Thread/currentThread))
      tag)) 

  (def- *?* nil)

  (defn ?
    "receive"
    ([] (? nil nil))
    ([timeout] (? timeout nil))
    ([timeout default] 
       (assert-spawn)
       (or (m/? (mb) nil timeout) default))) 

  (defmacro recv- [item & clauses]
    "match item with caluses"
    (let [msg-gen (gensym)]
      `(let [~msg-gen ~item]
	 (cond-match ~@(mapcat (fn [[test body]]
				 `[[~test ~msg-gen] ~body]) (group clauses 2))))))
  (defmacro recv [& clauses]
    "receive a message from current spawned thread mailbox"
    `(let [msg# (?)]
       (recv- msg# ~@clauses)))
  (defmacro recv-if [& clauses]
    "receive only if a message is in queue"
    `(let [msg# (? 0)]
       (recv- msg# ~@clauses)))

  (comment
    ;;until we figure out why soft-timeout doesnt work... we're leaving this here!
    (defn ??
      "asynchronous with timeout: wait for a receive filtered by the function, discarding any other messages received"
      ([function] (?? function nil))
      ([function timeout]
	 (soft-timeout! *?* timeout
	   (loop []
	     (let [msg (?)]
	       (if-let [it (function msg)]
		 msg
		 (recur))))))))

  (comment
    ;;until we figure out why soft-timeout doesnt work... we're leaving this here!
    (defn !?
      "asynchronous with timeout: send message with a tag and then receive back, discarding any other messages received"
      ([pid data] (!? pid data nil))
      ([pid data timeout]
	 (soft-timeout! *?* timeout
	   (let [tag (make-tag)]
	     (! pid [(self) tag data])
	     (loop []
	       (let [msg (?)]
		 (recv- msg
		   [(= ? tag) ?response] response
		   ? (recur)))))))))


  (defn stop-all 
    "stops all threads spawned. probably only useful for debugging, and assuming they respond to stop"
    []
    (map #(! % "stop") (keys @*threads*)))

  (defn kill-all
    []
    (map #(.stop %) (vals @*threads*)))
#+end_src
  
#+srcname:forex-util-fiber-mbox
#+begin_src clojure :tangle src/forex/util/fiber/mbox.clj
  ;;modified from
  ;;https://github.com/jochu/swank-clojure/tree/master/src/swank/util/concurrent/
  (ns forex.util.fiber.mbox
    (:use forex.util.general))

  ;; Holds references to the mailboxes (message queues)
  (defn- _get
    "Returns the mailbox for a given id. Creates one if one does not
     already exist."
    ([p id]
       (dosync         
	(when-not (get @(:boxes p) id)  
	  (alter (:boxes p) assoc
		 id (java.util.concurrent.LinkedBlockingQueue.)))
	(@(:boxes p) id)))
    {:tag java.util.concurrent.LinkedBlockingQueue})

  (defn !
    "Sends a message to a given id."
    ([p id message] 
       (let [mbox (_get p id)]
	 (.put mbox message))))


  (defn ??
    "poll in milliseconds"
    ([p] (?? p nil))
    ([p id]
       (let [mb (_get p id)]
	 (.peek mb))))

  (defn ?
    "poll in milliseconds"
    ([p id] (? p id nil))
    ([p id timeout]
       (is (or (not timeout) (and (number? timeout) (>= timeout 0))) "timeout must be nil or a positive number")
       (let [mb (_get p id)]
	 (cond
	   (not timeout) (.take mb)
	   true (.poll mb timeout java.util.concurrent.TimeUnit/MILLISECONDS)))))

  (defrecord+ mbox [[boxes (ref {})]]
    new-mbox)
#+end_src

#+srcname:forex-util-emacs
#+begin_src clojure :tangle src/forex/util/emacs.clj
  (ns forex.util.emacs (:use forex.util.general))

  (defn fn-meta [function meta]
    (let [ns-from *ns*]
      (proxy [clojure.lang.AFn clojure.lang.Fn  clojure.lang.IMeta] []
	(invoke [& args] (apply function args))
	(meta [] (merge (meta function) (merge {:ns ns-from} meta))))))

  (defn- val-of [a] (if (var? a) (var-get a) a)) 
  ;;TODO: add log to this
  (defn- apply-fn [a args]
    (try (apply (val-of a) args)
	 (catch Exception e
	   (println (format "error in hook %s %s: %s" a (val-of a) e)))))
  (defmacro- run-fn [a & args]
    `(let [a# ~a]
       (try ((val-of a#) ~@args)
	    (catch Exception e# (println 
				 (format "error in hook %s %s: %s" a# (val-of a#) e#))))))

  (defn- as-ns [a]
    (condp = (class a)
	String (find-ns (symbol a))
	clojure.lang.Symbol (find-ns a)
	a))
  (defn ns-metas
    ([fn] (ns-metas *ns* fn))
    ([ns fn]
       (is (as-ns ns) "%s is not a ns, or cant find it" ns)
       (let [vars (filter fn (vals (ns-interns (as-ns ns))))]
	 (apply hash-map (interleave vars (map var-get vars))))))
  (defn ns-vars
    ([] (ns-vars *ns*))
    ([ns]
       (is (as-ns ns) "%s is not an ns, or cant find it" ns)
       (let [vars (filter #(:var (meta  %)) (vals (ns-interns (as-ns ns))))]
	 (apply hash-map (interleave vars (map var-get vars))))))

  (defmacro defvar
    ([name]
       (let [new-name (with-meta name (assoc (meta name) :var true))]
	 `(defonce ~new-name nil)))
    ([name init]
       (let [new-name (with-meta name (assoc (meta name) :var true))]
	 `(defonce ~new-name ~init))))
  (defmacro defhook [& args] `(defvar ~@args)) 
  (defmacro setq [& args]
    `(do ~@(map
	    (fn [[var val]]
	      `(alter-var-root #'~var (fn [a#] ~val)))
	    (group args))))


  (defn- member
    ([value list] (member value list =))
    ([value list test]
       (some #(test % value) list)))

  (defn- pushnew* [hook arg id replace] 
    (if replace 
      (alter-var-root hook (fn [old]
			     (doall (concat
				     (list arg)
				     (filter #(and (if id (not (= (:id (meta %)) id)) true)
						  (not (= % arg))) old)))))
      (alter-var-root hook (fn [old] 
			     (doall (if (empty? (take 1 (filter #(or (when id (= (:id (meta %)) id)) (= % arg)) old)))
				      (concat (list arg) old)
				      old))))))
  (defmulti pushnew (fn [a b & args] [(if (fn? a) ::fn (type a)) (if (fn? b) ::fn (type b))]))
  (defmethod pushnew [clojure.lang.Var ::fn]
    ([hook function] (pushnew hook function *ns* true))
    ([hook function id] (pushnew hook function id true))
    ([hook function id replace] 
       (let [new-function (if (:id (meta function)) function (if id (fn-meta function {:id id}) function))]
	 (pushnew* hook new-function id replace))))
  (defmethod pushnew [clojure.lang.Var clojure.lang.Var]
    ([hook var] (pushnew hook var nil false))
    ([hook var id] (pushnew hook var id false)) 
    ([hook var id replace] (pushnew* hook var id replace)))


  (defn- add-to-list* [hook arg id replace] 
    (if replace 
      (alter-var-root hook (fn [old]
			     (doall (concat
				     (filter #(and (if id (not (= (:id (meta %)) id)) true)
						  (not (= % arg))) old)
				     (list arg)))))
      (alter-var-root hook (fn [old]
			     (doall (if (empty? (take 1 (filter #(or (when id (= (:id (meta %)) id)) (= % arg)) old)))
				      (concat old (list arg))
				      old))))))
  (defmulti add-to-list (fn [a b & args] [(if (fn? a) ::fn (type a)) (if (fn? b) ::fn (type b))]))
  (defmethod add-to-list [clojure.lang.Var ::fn]
    ([hook function] (add-to-list hook function *ns* true))
    ([hook function id] (add-to-list hook function id true))
    ([hook function id replace] 
       (let [new-function (if (:id (meta function)) function (if id (fn-meta function {:id id}) function))]
	 (add-to-list* hook new-function id replace))))
  (defmethod add-to-list [clojure.lang.Var clojure.lang.Var]
    ([hook var] (add-to-list hook var nil false))
    ([hook var id] (add-to-list hook var id false)) 
    ([hook var id replace] (add-to-list* hook var id replace)))

  (comment
    (defn push [var val]
      (alter-var-root var (fn [it] (concat (list val) it))))) 

  (defn add-hook [hook function] (pushnew hook function))
  (defn add-hooks [hook functions] (doall (map #(pushnew hook %) functions)))

  ;;RUNNING hooks
  (defn run-hooks [& hooks]
    (mapc (fn [hook] (mapc #(run-fn %) hook)) hooks))

  (defn run-hook-with-args [hook & args]
    (mapc #(apply-fn % args) hook))


  (defn run-hook-with-args-until-success [hook & args]
    (is (sequence? hook) "hook %s isnt a list" hook)
    (loop [funcs hook]
      (cond
	(empty? funcs) nil
	true (if-let [it (apply-fn (first funcs) args)]
	       it
	       (recur (rest funcs)))))) 

  (defn run-hook-with-args-until-failure [hook & args]
    (is (sequence? hook) "hook %s isnt a list" hook)
    (loop [funcs hook]
      (cond
	(empty? funcs) true
	true (when (apply-fn (first funcs) args)
	       (recur (rest funcs))))))


  ;;(run-hook-with-args-until-success 'a 3)
#+end_src
