clj-forex.html

<div id="outline-container-4_2_6" class="outline-4">
<h4 id="sec-4_2_6"><span class="section-number-4">4.2.6</span> Fiber </h4>
<div class="outline-text-4" id="text-4_2_6">




<div class="org-src-container"><label class="org-src-name">forex-util-fiber-spawn()</label><pre class="src src-clojure">
<span style="color: #b22222;">;;</span><span style="color: #b22222;">inspired by gambit-c termite's syntax
</span>(<span style="color: #a020f0;">ns</span> forex.util.fiber.spawn
  (<span style="color: #da70d6;">:use</span> forex.util.general)
  (<span style="color: #da70d6;">:require</span> [forex.util.fiber.mbox <span style="color: #da70d6;">:as</span> m]))

<span style="color: #b22222;">;;</span><span style="color: #b22222;">TODO: will eventually integrate with zeromq and will be able to be 'reactive' so we avoid
</span><span style="color: #b22222;">;;</span><span style="color: #b22222;">java's thread pool limit (or somehow get kilim to work?)
</span><span style="color: #b22222;">;;</span><span style="color: #b22222;">TODO: also, should we allow functions like ?? to discard messages? Perhaps not?
</span><span style="color: #b22222;">;;</span><span style="color: #b22222;">TODO: user settable default return value?
</span><span style="color: #b22222;">;;</span><span style="color: #b22222;">TODO: linking, remote nodes
</span><span style="color: #b22222;">;;</span><span style="color: #b22222;">utils
</span>(<span style="color: #a020f0;">defonce-</span> <span style="color: #0000ff;">*mailboxes*</span> (<span style="color: #da70d6;">atom</span> {}))
(<span style="color: #a020f0;">defn-</span> <span style="color: #0000ff;">make-mailbox</span> [tag]
  (<span style="color: #a020f0;">let</span> [mb (m/new-mbox)]
    (<span style="color: #da70d6;">swap!</span> *mailboxes* assoc tag mb)
    mb))
(<span style="color: #a020f0;">defonce-</span> <span style="color: #0000ff;">*threads*</span> (<span style="color: #da70d6;">atom</span> {}))

(<span style="color: #a020f0;">defn-</span> <span style="color: #0000ff;">remove-pid</span> [pid]
  (<span style="color: #a020f0;">when</span> pid (<span style="color: #da70d6;">swap!</span> *threads* dissoc pid) (<span style="color: #da70d6;">swap!</span> *mailboxes* dissoc pid)))
(<span style="color: #a020f0;">defn-</span> <span style="color: #0000ff;">get-mailbox</span> [tag]
  (<span style="color: #da70d6;">get</span> @*mailboxes* tag))
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">pid?</span> [pid]
  <span style="color: #bc8f8f;">"test for valid pid"</span>
  (<span style="color: #a020f0;">if</span> (get-mailbox pid) true false))

(<span style="color: #a020f0;">defonce-</span> <span style="color: #0000ff;">*mb*</span> (ThreadLocal.))
(<span style="color: #a020f0;">defonce-</span> <span style="color: #0000ff;">*self*</span> (ThreadLocal.)) 
(<span style="color: #a020f0;">defn-</span> <span style="color: #0000ff;">mb</span> [] (.get *mb*)) 

<span style="color: #b22222;">;; </span><span style="color: #b22222;">functions
</span>(<span style="color: #a020f0;">let</span> [r (java.util.Random.)]
  (<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">make-tag</span> []
    <span style="color: #bc8f8f;">"produce a random tag/pid"</span>
    (Long/toString (Math/abs (.nextLong r)) 36)))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">??</span> []
  (m/?? (mb) nil))
(<span style="color: #a020f0;">defn-</span> <span style="color: #0000ff;">throwf</span> [&amp; args] (<span style="color: #a020f0;">throw</span> (Exception. (<span style="color: #da70d6;">apply</span> format args))) )

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">!</span>
  <span style="color: #bc8f8f;">"send a message to a pid, with an option id which the message will be placed in"</span>
  ([pid msg] (! pid nil msg))
  ([pid id msg]
     (<span style="color: #a020f0;">if-let</span> [mbox (get-mailbox pid)]
       (m/! mbox id msg)
       (throwf <span style="color: #bc8f8f;">"unknown pid %s"</span> pid))))
(<span style="color: #a020f0;">binding</span> [*out* *out*] (<span style="color: #a020f0;">defn-</span> <span style="color: #0000ff;">log</span> [&amp; args] (<span style="color: #da70d6;">println</span> (<span style="color: #da70d6;">apply</span> format args))))
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">self</span> []
  <span style="color: #bc8f8f;">"returns pid of current spawn or nil if it isnt a spawnage"</span>
  (.get *self*))
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">spawn</span>
  ([thunk] (spawn thunk nil))
  ([thunk name]
     (<span style="color: #a020f0;">let</span> [tag (make-tag)
           mail (make-mailbox tag)]
       (<span style="color: #a020f0;">let</span> [thread (<span style="color: #a020f0;">let</span> [thread (Thread.
                                  (<span style="color: #da70d6;">bound-fn</span>
                                   [] 
                                   (<span style="color: #a020f0;">try</span> 
                                     (<span style="color: #a020f0;">do</span> (.set *mb* mail) (.set *self* tag)
                                         (thunk))
                                     (<span style="color: #a020f0;">catch</span> Exception e
                                       (log <span style="color: #bc8f8f;">"pid %s error: %s "</span> (self) e)
                                       (.printStackTrace e)
                                       )
                                     (<span style="color: #a020f0;">finally</span> (remove-pid tag)))))]
                      (<span style="color: #a020f0;">if</span> name (<span style="color: #a020f0;">doto</span> thread (.setName name)) thread))]
         (<span style="color: #da70d6;">swap!</span> *threads* assoc tag thread)
         (.start thread))
       tag)))

(<span style="color: #a020f0;">defn-</span> <span style="color: #0000ff;">assert-spawn</span> [] (<span style="color: #a020f0;">when</span> (<span style="color: #da70d6;">not</span> (self)) (throwf <span style="color: #bc8f8f;">"no local spawn available"</span>)))
<span style="color: #b22222;">;;</span><span style="color: #b22222;">does work - but we dont really need it!
</span>
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">spawn-in-repl</span> []
  <span style="color: #bc8f8f;">"setup current thread as a spawned thread with mailbox"</span>
  (<span style="color: #a020f0;">let</span> [tag (make-tag)]
    (remove-pid self)
    (.set *mb* (make-mailbox tag)) (.set *self* tag) (<span style="color: #da70d6;">swap!</span> *threads* assoc tag (Thread/currentThread))
    tag)) 

(<span style="color: #a020f0;">def-</span> <span style="color: #0000ff;">*?*</span> nil)

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">?</span>
  <span style="color: #bc8f8f;">"receive"</span>
  ([] (? nil nil))
  ([timeout] (? timeout nil))
  ([timeout default] 
     (assert-spawn)
     (<span style="color: #a020f0;">or</span> (m/? (mb) nil timeout) default))) 

(<span style="color: #a020f0;">defmacro</span> <span style="color: #0000ff;">recv-</span> [item &amp; clauses]
  <span style="color: #bc8f8f;">"match item with caluses"</span>
  (<span style="color: #a020f0;">let</span> [msg-gen (<span style="color: #da70d6;">gensym</span>)]
    `(<span style="color: #a020f0;">let</span> [~msg-gen ~item]
       (cond-match ~@(<span style="color: #da70d6;">mapcat</span> (<span style="color: #da70d6;">fn</span> [[test body]]
                               `[[~test ~msg-gen] ~body]) (group clauses 2))))))
(<span style="color: #a020f0;">defmacro</span> <span style="color: #0000ff;">recv</span> [&amp; clauses]
  <span style="color: #bc8f8f;">"receive a message from current spawned thread mailbox"</span>
  `(<span style="color: #a020f0;">let</span> [msg# (?)]
     (recv- msg# ~@clauses)))
(<span style="color: #a020f0;">defmacro</span> <span style="color: #0000ff;">recv-if</span> [&amp; clauses]
  <span style="color: #bc8f8f;">"receive only if a message is in queue"</span>
  `(<span style="color: #a020f0;">let</span> [msg# (? 0)]
     (recv- msg# ~@clauses)))

(<span style="color: #da70d6;">comment</span>
  <span style="color: #b22222;">;;</span><span style="color: #b22222;">until we figure out why soft-timeout doesnt work... we're leaving this here!
</span>  (<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">??</span>
    <span style="color: #bc8f8f;">"asynchronous with timeout: wait for a receive filtered by the function, discarding any other messages received"</span>
    ([function] (?? function nil))
    ([function timeout]
       (soft-timeout! *?* timeout
         (<span style="color: #a020f0;">loop</span> []
           (<span style="color: #a020f0;">let</span> [msg (?)]
             (<span style="color: #a020f0;">if-let</span> [it (function msg)]
               msg
               (<span style="color: #a020f0;">recur</span>))))))))

(<span style="color: #da70d6;">comment</span>
  <span style="color: #b22222;">;;</span><span style="color: #b22222;">until we figure out why soft-timeout doesnt work... we're leaving this here!
</span>  (<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">!?</span>
    <span style="color: #bc8f8f;">"asynchronous with timeout: send message with a tag and then receive back, discarding any other messages received"</span>
    ([pid data] (!? pid data nil))
    ([pid data timeout]
       (soft-timeout! *?* timeout
         (<span style="color: #a020f0;">let</span> [tag (make-tag)]
           (! pid [(self) tag data])
           (<span style="color: #a020f0;">loop</span> []
             (<span style="color: #a020f0;">let</span> [msg (?)]
               (recv- msg
                 [(<span style="color: #da70d6;">=</span> ? tag) ?response] response
                 ? (<span style="color: #a020f0;">recur</span>)))))))))


(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">stop-all</span> 
  <span style="color: #bc8f8f;">"stops all threads spawned. probably only useful for debugging, and assuming they respond to stop"</span>
  []
  (<span style="color: #da70d6;">map</span> #(! % <span style="color: #bc8f8f;">"stop"</span>) (<span style="color: #da70d6;">keys</span> @*threads*)))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">kill-all</span>
  []
  (<span style="color: #da70d6;">map</span> #(.stop %) (<span style="color: #da70d6;">vals</span> @*threads*)))
</pre></div>






<div class="org-src-container"><label class="org-src-name">forex-util-fiber-mbox()</label><pre class="src src-clojure">
<span style="color: #b22222;">;;</span><span style="color: #b22222;">modified from
</span><span style="color: #b22222;">;;</span><span style="color: #b22222;">https://github.com/jochu/swank-clojure/tree/master/src/swank/util/concurrent/
</span>(<span style="color: #a020f0;">ns</span> forex.util.fiber.mbox
  (<span style="color: #da70d6;">:use</span> forex.util.general))

<span style="color: #b22222;">;; </span><span style="color: #b22222;">Holds references to the mailboxes (message queues)
</span>(<span style="color: #a020f0;">defn-</span> <span style="color: #0000ff;">_get</span>
  <span style="color: #bc8f8f;">"Returns the mailbox for a given id. Creates one if one does not
   already exist."</span>
  ([p id]
     (<span style="color: #a020f0;">dosync</span>         
      (<span style="color: #a020f0;">when-not</span> (<span style="color: #da70d6;">get</span> @(<span style="color: #da70d6;">:boxes</span> p) id)  
        (<span style="color: #da70d6;">alter</span> (<span style="color: #da70d6;">:boxes</span> p) assoc
               id (java.util.concurrent.LinkedBlockingQueue.)))
      (@(<span style="color: #da70d6;">:boxes</span> p) id)))
  {<span style="color: #da70d6;">:tag</span> java.util.concurrent.LinkedBlockingQueue})

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">!</span>
  <span style="color: #bc8f8f;">"Sends a message to a given id."</span>
  ([p id message] 
     (<span style="color: #a020f0;">let</span> [mbox (_get p id)]
       (.put mbox message))))


(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">??</span>
  <span style="color: #bc8f8f;">"poll in milliseconds"</span>
  ([p] (?? p nil))
  ([p id]
     (<span style="color: #a020f0;">let</span> [mb (_get p id)]
       (.peek mb))))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">?</span>
  <span style="color: #bc8f8f;">"poll in milliseconds"</span>
  ([p id] (? p id nil))
  ([p id timeout]
     (<span style="color: #228b22;">is</span> (<span style="color: #a020f0;">or</span> (<span style="color: #da70d6;">not</span> timeout) (<span style="color: #a020f0;">and</span> (<span style="color: #da70d6;">number?</span> timeout) (<span style="color: #da70d6;">&gt;=</span> timeout 0))) <span style="color: #bc8f8f;">"timeout must be nil or a positive number"</span>)
     (<span style="color: #a020f0;">let</span> [mb (_get p id)]
       (<span style="color: #a020f0;">cond</span>
         (<span style="color: #da70d6;">not</span> timeout) (.take mb)
         true (.poll mb timeout java.util.concurrent.TimeUnit/MILLISECONDS)))))

(defrecord+ mbox [[boxes (<span style="color: #da70d6;">ref</span> {})]]
  new-mbox)
</pre></div>




<div class="org-src-container"><label class="org-src-name">forex-util-emacs()</label><pre class="src src-clojure">
(<span style="color: #a020f0;">ns</span> forex.util.emacs (<span style="color: #da70d6;">:use</span> forex.util.general))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">fn-meta</span> [function meta]
  (<span style="color: #a020f0;">let</span> [ns-from *ns*]
    (<span style="color: #da70d6;">proxy</span> [clojure.lang.AFn clojure.lang.Fn  clojure.lang.IMeta] []
      (invoke [&amp; args] (<span style="color: #da70d6;">apply</span> function args))
      (<span style="color: #da70d6;">meta</span> [] (<span style="color: #da70d6;">merge</span> (<span style="color: #da70d6;">meta</span> function) (<span style="color: #da70d6;">merge</span> {<span style="color: #da70d6;">:ns</span> ns-from} meta))))))

(<span style="color: #a020f0;">defn-</span> <span style="color: #0000ff;">val-of</span> [a] (<span style="color: #a020f0;">if</span> (<span style="color: #da70d6;">var?</span> a) (<span style="color: #da70d6;">var-get</span> a) a)) 
<span style="color: #b22222;">;;</span><span style="color: #b22222;">TODO: add log to this
</span>(<span style="color: #a020f0;">defn-</span> <span style="color: #0000ff;">apply-fn</span> [a args]
  (<span style="color: #a020f0;">try</span> (<span style="color: #da70d6;">apply</span> (val-of a) args)
       (<span style="color: #a020f0;">catch</span> Exception e
         (<span style="color: #da70d6;">println</span> (<span style="color: #da70d6;">format</span> <span style="color: #bc8f8f;">"error in hook %s %s: %s"</span> a (val-of a) e)))))
(<span style="color: #a020f0;">defmacro-</span> <span style="color: #0000ff;">run-fn</span> [a &amp; args]
  `(<span style="color: #a020f0;">let</span> [a# ~a]
     (<span style="color: #a020f0;">try</span> ((val-of a#) ~@args)
          (<span style="color: #a020f0;">catch</span> Exception e# (<span style="color: #da70d6;">println</span> 
                               (<span style="color: #da70d6;">format</span> <span style="color: #bc8f8f;">"error in hook %s %s: %s"</span> a# (val-of a#) e#))))))

(<span style="color: #a020f0;">defn-</span> <span style="color: #0000ff;">as-ns</span> [a]
  (<span style="color: #a020f0;">condp</span> = (<span style="color: #da70d6;">class</span> a)
      String (<span style="color: #da70d6;">find-ns</span> (<span style="color: #da70d6;">symbol</span> a))
      clojure.lang.Symbol (<span style="color: #da70d6;">find-ns</span> a)
      a))
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">ns-metas</span>
  ([fn] (ns-metas *ns* fn))
  ([ns fn]
     (<span style="color: #228b22;">is</span> (as-ns ns) <span style="color: #bc8f8f;">"%s is not a ns, or cant find it"</span> ns)
     (<span style="color: #a020f0;">let</span> [vars (<span style="color: #da70d6;">filter</span> fn (<span style="color: #da70d6;">vals</span> (<span style="color: #da70d6;">ns-interns</span> (as-ns ns))))]
       (<span style="color: #da70d6;">apply</span> hash-map (<span style="color: #da70d6;">interleave</span> vars (<span style="color: #da70d6;">map</span> var-get vars))))))
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">ns-vars</span>
  ([] (ns-vars *ns*))
  ([ns]
     (<span style="color: #228b22;">is</span> (as-ns ns) <span style="color: #bc8f8f;">"%s is not an ns, or cant find it"</span> ns)
     (<span style="color: #a020f0;">let</span> [vars (<span style="color: #da70d6;">filter</span> #(<span style="color: #da70d6;">:var</span> (<span style="color: #da70d6;">meta</span>  %)) (<span style="color: #da70d6;">vals</span> (<span style="color: #da70d6;">ns-interns</span> (as-ns ns))))]
       (<span style="color: #da70d6;">apply</span> hash-map (<span style="color: #da70d6;">interleave</span> vars (<span style="color: #da70d6;">map</span> var-get vars))))))

(<span style="color: #a020f0;">defmacro</span> <span style="color: #0000ff;">defvar</span>
  ([name]
     (<span style="color: #a020f0;">let</span> [new-name (<span style="color: #da70d6;">with-meta</span> name (<span style="color: #da70d6;">assoc</span> (<span style="color: #da70d6;">meta</span> name) <span style="color: #da70d6;">:var</span> true))]
       `(<span style="color: #a020f0;">defonce</span> <span style="color: #0000ff;">~new-name</span> nil)))
  ([name init]
     (<span style="color: #a020f0;">let</span> [new-name (<span style="color: #da70d6;">with-meta</span> name (<span style="color: #da70d6;">assoc</span> (<span style="color: #da70d6;">meta</span> name) <span style="color: #da70d6;">:var</span> true))]
       `(<span style="color: #a020f0;">defonce</span> <span style="color: #0000ff;">~new-name</span> ~init))))
(<span style="color: #a020f0;">defmacro</span> <span style="color: #0000ff;">defhook</span> [&amp; args] `(<span style="color: #a020f0;">defvar</span> <span style="color: #0000ff;">~@args</span>)) 
(<span style="color: #a020f0;">defmacro</span> <span style="color: #0000ff;">setq</span> [&amp; args]
  `(<span style="color: #a020f0;">do</span> ~@(<span style="color: #da70d6;">map</span>
          (<span style="color: #da70d6;">fn</span> [[var val]]
            `(<span style="color: #da70d6;">alter-var-root</span> #'~var (<span style="color: #da70d6;">fn</span> [a#] ~val)))
          (group args))))


(<span style="color: #a020f0;">defn-</span> <span style="color: #0000ff;">member</span>
  ([value list] (member value list =))
  ([value list test]
     (<span style="color: #da70d6;">some</span> #(<span style="color: #da70d6;">test</span> % value) list)))

(<span style="color: #a020f0;">defn-</span> <span style="color: #0000ff;">pushnew*</span> [hook arg id replace] 
  (<span style="color: #a020f0;">if</span> replace 
    (<span style="color: #da70d6;">alter-var-root</span> hook (<span style="color: #da70d6;">fn</span> [old]
                           (<span style="color: #a020f0;">doall</span> (<span style="color: #da70d6;">concat</span>
                                   (<span style="color: #da70d6;">list</span> arg)
                                   (<span style="color: #da70d6;">filter</span> #(<span style="color: #a020f0;">and</span> (<span style="color: #a020f0;">if</span> id (<span style="color: #da70d6;">not</span> (<span style="color: #da70d6;">=</span> (<span style="color: #da70d6;">:id</span> (<span style="color: #da70d6;">meta</span> %)) id)) true)
                                                (<span style="color: #da70d6;">not</span> (<span style="color: #da70d6;">=</span> % arg))) old)))))
    (<span style="color: #da70d6;">alter-var-root</span> hook (<span style="color: #da70d6;">fn</span> [old] 
                           (<span style="color: #a020f0;">doall</span> (<span style="color: #a020f0;">if</span> (<span style="color: #da70d6;">empty?</span> (<span style="color: #da70d6;">take</span> 1 (<span style="color: #da70d6;">filter</span> #(<span style="color: #a020f0;">or</span> (<span style="color: #a020f0;">when</span> id (<span style="color: #da70d6;">=</span> (<span style="color: #da70d6;">:id</span> (<span style="color: #da70d6;">meta</span> %)) id)) (<span style="color: #da70d6;">=</span> % arg)) old)))
                                    (<span style="color: #da70d6;">concat</span> (<span style="color: #da70d6;">list</span> arg) old)
                                    old))))))
(<span style="color: #a020f0;">defmulti</span> <span style="color: #0000ff;">pushnew</span> (<span style="color: #da70d6;">fn</span> [a b &amp; args] [(<span style="color: #a020f0;">if</span> (<span style="color: #da70d6;">fn?</span> a) <span style="color: #da70d6;">::fn</span> (<span style="color: #da70d6;">type</span> a)) (<span style="color: #a020f0;">if</span> (<span style="color: #da70d6;">fn?</span> b) <span style="color: #da70d6;">::fn</span> (<span style="color: #da70d6;">type</span> b))]))
(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">pushnew</span> [clojure.lang.Var <span style="color: #da70d6;">::fn</span>]
  ([hook function] (pushnew hook function *ns* true))
  ([hook function id] (pushnew hook function id true))
  ([hook function id replace] 
     (<span style="color: #a020f0;">let</span> [new-function (<span style="color: #a020f0;">if</span> (<span style="color: #da70d6;">:id</span> (<span style="color: #da70d6;">meta</span> function)) function (<span style="color: #a020f0;">if</span> id (fn-meta function {<span style="color: #da70d6;">:id</span> id}) function))]
       (pushnew* hook new-function id replace))))
(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">pushnew</span> [clojure.lang.Var clojure.lang.Var]
  ([hook var] (pushnew hook var nil false))
  ([hook var id] (pushnew hook var id false)) 
  ([hook var id replace] (pushnew* hook var id replace)))


(<span style="color: #a020f0;">defn-</span> <span style="color: #0000ff;">add-to-list*</span> [hook arg id replace] 
  (<span style="color: #a020f0;">if</span> replace 
    (<span style="color: #da70d6;">alter-var-root</span> hook (<span style="color: #da70d6;">fn</span> [old]
                           (<span style="color: #a020f0;">doall</span> (<span style="color: #da70d6;">concat</span>
                                   (<span style="color: #da70d6;">filter</span> #(<span style="color: #a020f0;">and</span> (<span style="color: #a020f0;">if</span> id (<span style="color: #da70d6;">not</span> (<span style="color: #da70d6;">=</span> (<span style="color: #da70d6;">:id</span> (<span style="color: #da70d6;">meta</span> %)) id)) true)
                                                (<span style="color: #da70d6;">not</span> (<span style="color: #da70d6;">=</span> % arg))) old)
                                   (<span style="color: #da70d6;">list</span> arg)))))
    (<span style="color: #da70d6;">alter-var-root</span> hook (<span style="color: #da70d6;">fn</span> [old]
                           (<span style="color: #a020f0;">doall</span> (<span style="color: #a020f0;">if</span> (<span style="color: #da70d6;">empty?</span> (<span style="color: #da70d6;">take</span> 1 (<span style="color: #da70d6;">filter</span> #(<span style="color: #a020f0;">or</span> (<span style="color: #a020f0;">when</span> id (<span style="color: #da70d6;">=</span> (<span style="color: #da70d6;">:id</span> (<span style="color: #da70d6;">meta</span> %)) id)) (<span style="color: #da70d6;">=</span> % arg)) old)))
                                    (<span style="color: #da70d6;">concat</span> old (<span style="color: #da70d6;">list</span> arg))
                                    old))))))
(<span style="color: #a020f0;">defmulti</span> <span style="color: #0000ff;">add-to-list</span> (<span style="color: #da70d6;">fn</span> [a b &amp; args] [(<span style="color: #a020f0;">if</span> (<span style="color: #da70d6;">fn?</span> a) <span style="color: #da70d6;">::fn</span> (<span style="color: #da70d6;">type</span> a)) (<span style="color: #a020f0;">if</span> (<span style="color: #da70d6;">fn?</span> b) <span style="color: #da70d6;">::fn</span> (<span style="color: #da70d6;">type</span> b))]))
(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">add-to-list</span> [clojure.lang.Var <span style="color: #da70d6;">::fn</span>]
  ([hook function] (add-to-list hook function *ns* true))
  ([hook function id] (add-to-list hook function id true))
  ([hook function id replace] 
     (<span style="color: #a020f0;">let</span> [new-function (<span style="color: #a020f0;">if</span> (<span style="color: #da70d6;">:id</span> (<span style="color: #da70d6;">meta</span> function)) function (<span style="color: #a020f0;">if</span> id (fn-meta function {<span style="color: #da70d6;">:id</span> id}) function))]
       (add-to-list* hook new-function id replace))))
(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">add-to-list</span> [clojure.lang.Var clojure.lang.Var]
  ([hook var] (add-to-list hook var nil false))
  ([hook var id] (add-to-list hook var id false)) 
  ([hook var id replace] (add-to-list* hook var id replace)))

(<span style="color: #da70d6;">comment</span>
  (<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">push</span> [var val]
    (<span style="color: #da70d6;">alter-var-root</span> var (<span style="color: #da70d6;">fn</span> [it] (<span style="color: #da70d6;">concat</span> (<span style="color: #da70d6;">list</span> val) it))))) 

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">add-hook</span> [hook function] (pushnew hook function))
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">add-hooks</span> [hook functions] (<span style="color: #a020f0;">doall</span> (<span style="color: #da70d6;">map</span> #(pushnew hook %) functions)))

<span style="color: #b22222;">;;</span><span style="color: #b22222;">RUNNING hooks
</span>(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">run-hooks</span> [&amp; hooks]
  (mapc (<span style="color: #da70d6;">fn</span> [hook] (mapc #(run-fn %) hook)) hooks))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">run-hook-with-args</span> [hook &amp; args]
  (mapc #(apply-fn % args) hook))


(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">run-hook-with-args-until-success</span> [hook &amp; args]
  (<span style="color: #228b22;">is</span> (sequence? hook) <span style="color: #bc8f8f;">"hook %s isnt a list"</span> hook)
  (<span style="color: #a020f0;">loop</span> [funcs hook]
    (<span style="color: #a020f0;">cond</span>
      (<span style="color: #da70d6;">empty?</span> funcs) nil
      true (<span style="color: #a020f0;">if-let</span> [it (apply-fn (<span style="color: #da70d6;">first</span> funcs) args)]
             it
             (<span style="color: #a020f0;">recur</span> (<span style="color: #da70d6;">rest</span> funcs)))))) 

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">run-hook-with-args-until-failure</span> [hook &amp; args]
  (<span style="color: #228b22;">is</span> (sequence? hook) <span style="color: #bc8f8f;">"hook %s isnt a list"</span> hook)
  (<span style="color: #a020f0;">loop</span> [funcs hook]
    (<span style="color: #a020f0;">cond</span>
      (<span style="color: #da70d6;">empty?</span> funcs) true
      true (<span style="color: #a020f0;">when</span> (apply-fn (<span style="color: #da70d6;">first</span> funcs) args)
             (<span style="color: #a020f0;">recur</span> (<span style="color: #da70d6;">rest</span> funcs))))))


<span style="color: #b22222;">;;</span><span style="color: #b22222;">(run-hook-with-args-until-success 'a 3)
</span></pre></div>


</div>

</div>
