clj-forex.html

<div id="outline-container-4_2_7" class="outline-4">
<h4 id="sec-4_2_7"><span class="section-number-4">4.2.7</span> Spawn </h4>
<div class="outline-text-4" id="text-4_2_7">




<div class="org-src-container"><label class="org-src-name">forex-util-spawn()</label><pre class="src src-clojure">
(clojure.core/<span style="color: #da70d6;">use</span> 'nstools.ns)
(ns+ forex.util.spawn
     (<span style="color: #da70d6;">:clone</span> clj.core)   
     (<span style="color: #da70d6;">:use</span> forex.util.general forex.util.zmq)
     (<span style="color: #da70d6;">:import</span> forex.util.zmq.Poller)
     (<span style="color: #da70d6;">:require</span> [forex.util.fiber.spawn <span style="color: #da70d6;">:as</span> s]))

(<span style="color: #a020f0;">def-</span> <span style="color: #0000ff;">*pid*</span> (<span style="color: #da70d6;">atom</span> []))

(<span style="color: #a020f0;">defalias</span> <span style="color: #0000ff;">pid?</span> s/pid?)
(<span style="color: #a020f0;">defalias</span> <span style="color: #0000ff;">self</span> s/self)
(<span style="color: #a020f0;">def</span> <span style="color: #0000ff;">kill-all</span> s/kill-all)
(<span style="color: #a020f0;">defalias</span> <span style="color: #0000ff;">spawn-in-repl</span> s/spawn-in-repl) <span style="color: #b22222;">;;</span><span style="color: #b22222;">TODO: add socket for this one
</span>
(<span style="color: #a020f0;">defalias</span> <span style="color: #0000ff;">?</span> s/?)

(<span style="color: #a020f0;">defalias</span> <span style="color: #0000ff;">make-tag</span> s/make-tag)
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">!</span> [pid msg]
  (<span style="color: #a020f0;">with-open</span> [local (<span style="color: #a020f0;">doto</span> (new-socket +push+)
                      (.connect (<span style="color: #da70d6;">format</span> <span style="color: #bc8f8f;">"inproc://%s"</span> pid)))] 
    (s/! pid msg)
    (.snd local <span style="color: #bc8f8f;">"REQUEST"</span> +noblock+)))
(<span style="color: #a020f0;">defn</span>  <span style="color: #0000ff;">stop-all</span> []
  (<span style="color: #da70d6;">swap!</span> *pid*
         (<span style="color: #da70d6;">fn</span> [old]
           (<span style="color: #da70d6;">map</span> #(<span style="color: #a020f0;">if</span> (pid? %)
                   (! % <span style="color: #bc8f8f;">"STOP"</span>)) @*pid*))))


(<span style="color: #a020f0;">defrecord</span> <span style="color: #0000ff;">LocalSocket</span> [socket]
  PSocket
  (raw [this] (.raw socket)) 
  (recv [this flags] 
        (<span style="color: #a020f0;">when</span> (.recv socket flags)      
          (s/?)))  
  (recv [this] (recv this 0))
  (close [this] (.close socket))
  (hasMore [this] false))


(<span style="color: #a020f0;">defonce-</span> <span style="color: #0000ff;">*local*</span> (ThreadLocal.))
(<span style="color: #a020f0;">defn-</span> <span style="color: #0000ff;">self-get</span> [key]
  (<span style="color: #a020f0;">let</span> [map (.get *local*)]
    (<span style="color: #a020f0;">when</span> map 
      (<span style="color: #da70d6;">map</span> key))))
(<span style="color: #a020f0;">defn-</span> <span style="color: #0000ff;">self-assoc</span> [key obj]
  (<span style="color: #a020f0;">let</span> [map (.get *local*)]
    (<span style="color: #a020f0;">if</span> map 
     (.set *local* (<span style="color: #da70d6;">assoc</span> map key obj)))))
(<span style="color: #a020f0;">def</span> <span style="color: #0000ff;">local</span> nil)
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">spawn</span>
  ([thunk] (spawn thunk nil))
  ([thunk name] 
     (<span style="color: #a020f0;">let</span> [pid (s/spawn
                (<span style="color: #da70d6;">fn</span> [] 
                  (.set *local* {})
                  (<span style="color: #a020f0;">with-open</span>
                      [local-socket (LocalSocket. 
                                     (<span style="color: #a020f0;">doto</span>
                                         (new-string-socket +pull+)
                                       (.bind  (<span style="color: #da70d6;">str</span> <span style="color: #bc8f8f;">"inproc://"</span> (self)))))]        
                    (<span style="color: #a020f0;">binding</span> [local local-socket]
                      (thunk))))
                name)]
       (<span style="color: #da70d6;">swap!</span> *pid* concat [pid])
       pid)))

(<span style="color: #da70d6;">comment</span>
  (<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">te</span> []
    (<span style="color: #a020f0;">def</span> <span style="color: #0000ff;">pid</span> (spawn #(<span style="color: #a020f0;">let</span> [seq (event-seq [local])]
                       (<span style="color: #da70d6;">pr</span> (<span style="color: #da70d6;">format</span> <span style="color: #bc8f8f;">"local %s %s%n"</span>
                                   (<span style="color: #da70d6;">first</span> seq)
                                   (<span style="color: #da70d6;">second</span> seq))))))))




(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">recv-multi</span>
  ([sock] (recv-multi sock 0))
  ([sock flags] 
     (<span style="color: #a020f0;">let</span> [first-msg (.recv sock flags)]
       (<span style="color: #a020f0;">when</span> first-msg 
         (<span style="color: #a020f0;">if</span> (.hasMore sock)
           (<span style="color: #a020f0;">loop</span> [msg [(String. (.recv sock)) first-msg]]
             (<span style="color: #a020f0;">if</span> (.hasMore sock)
               (<span style="color: #a020f0;">recur</span> (<span style="color: #da70d6;">cons</span> (String. (.recv sock)) msg))
               msg))
           first-msg)))))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">recv-all</span>
  ([sock] (recv-all sock 0))
  ([sock flags]
     (<span style="color: #a020f0;">let</span> [first-msg (recv-multi sock flags)]
       (<span style="color: #a020f0;">when</span> first-msg
         (<span style="color: #a020f0;">loop</span> [messages [[sock first-msg]]]
           (<span style="color: #a020f0;">if-let</span> [new-msg (recv-multi sock +noblock+)]
             (<span style="color: #a020f0;">recur</span> (<span style="color: #da70d6;">conj</span> messages [sock new-msg]))
             messages))))))

<span style="color: #b22222;">;;</span><span style="color: #b22222;">TODO: fair queue? prevent too much messages hogging sequence? who knows! ...
</span>
(<span style="color: #a020f0;">defn-</span> <span style="color: #0000ff;">event-seq*</span> [p]
  (<span style="color: #da70d6;">lazy-seq</span>
   (<span style="color: #a020f0;">let</span> [amount (.poll p)]
     (<span style="color: #da70d6;">concat</span>
      <span style="color: #b22222;">;;</span><span style="color: #b22222;">TODO: memory overflow with getting all messsages? probably not ....
</span>      (<span style="color: #a020f0;">doall</span>
       (<span style="color: #da70d6;">mapcat</span> #(<span style="color: #a020f0;">when</span> (<span style="color: #a020f0;">or</span> (.pollin p %) (.pollout p %)) (recv-all (.getSocket p %))) 
               (<span style="color: #da70d6;">range</span> 0 (.getSize p))))
      (event-seq* p))))) 


(<span style="color: #a020f0;">defmulti</span> <span style="color: #0000ff;">event-seq</span> class)
(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">event-seq</span> clojure.lang.IPersistentVector [v]
  (event-seq (new-poller v)))
(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">event-seq</span> Poller [p] (event-seq* p)) 

<span style="color: #b22222;">;;</span><span style="color: #b22222;">? with multiple sources or change to poll
</span><span style="color: #b22222;">;;</span><span style="color: #b22222;">!? (timeout)
</span><span style="color: #b22222;">;;</span><span style="color: #b22222;">?? (filter)
</span></pre></div>


</div>

</div>
