clj-forex.html

<div id="outline-container-4_2_8" class="outline-4">
<h4 id="sec-4_2_8"><span class="section-number-4">4.2.8</span> ZMQ </h4>
<div class="outline-text-4" id="text-4_2_8">




<div class="org-src-container"><label class="org-src-name">forex-util-zmq()</label><pre class="src src-clojure">
(clojure.core/<span style="color: #da70d6;">use</span> 'nstools.ns)
(ns+ forex.util.zmq
  (<span style="color: #da70d6;">:clone</span> clj.core)
  (<span style="color: #da70d6;">:import</span> (org.zeromq ZMQ))
  (<span style="color: #da70d6;">:use</span> forex.util.general))
(<span style="color: #a020f0;">def</span> <span style="color: #0000ff;">+noblock+</span> 1)

(<span style="color: #a020f0;">def</span> <span style="color: #0000ff;">+p2p+</span> 0)
(<span style="color: #a020f0;">def</span> <span style="color: #0000ff;">+pub+</span> 1)
(<span style="color: #a020f0;">def</span> <span style="color: #0000ff;">+sub+</span> 2)
(<span style="color: #a020f0;">def</span> <span style="color: #0000ff;">+req+</span> 3)
(<span style="color: #a020f0;">def</span> <span style="color: #0000ff;">+rep+</span> 4)
(<span style="color: #a020f0;">def</span> <span style="color: #0000ff;">+xreq+</span> 5)
(<span style="color: #a020f0;">def</span> <span style="color: #0000ff;">+xrep+</span> 6)
(<span style="color: #a020f0;">def</span> <span style="color: #0000ff;">+pull+</span> 7) 
(<span style="color: #a020f0;">def</span> <span style="color: #0000ff;">+push+</span> 8)

(<span style="color: #a020f0;">def</span> <span style="color: #0000ff;">+hwm+</span> 1)
(<span style="color: #a020f0;">def</span> <span style="color: #0000ff;">+lwm+</span> 2)
(<span style="color: #a020f0;">def</span> <span style="color: #0000ff;">+swap+</span> 3)
(<span style="color: #a020f0;">def</span> <span style="color: #0000ff;">+affinity+</span> 4)
(<span style="color: #a020f0;">def</span> <span style="color: #0000ff;">+identity+</span> 5)
(<span style="color: #a020f0;">def</span> <span style="color: #0000ff;">+subscribe+</span> 6)
(<span style="color: #a020f0;">def</span> <span style="color: #0000ff;">+unsubscribe+</span> 7)
(<span style="color: #a020f0;">def</span> <span style="color: #0000ff;">+rate+</span> 8)
(<span style="color: #a020f0;">def</span> <span style="color: #0000ff;">+recovery-ivl+</span> 9)
(<span style="color: #a020f0;">def</span> <span style="color: #0000ff;">+mcast-loop+</span> 10)
(<span style="color: #a020f0;">def</span> <span style="color: #0000ff;">+sndbuf+</span> 11)
(<span style="color: #a020f0;">def</span> <span style="color: #0000ff;">+rcvbuf+</span> 12)

(<span style="color: #a020f0;">def</span> <span style="color: #0000ff;">+pollin+</span> 1)
(<span style="color: #a020f0;">def</span> <span style="color: #0000ff;">+pollout+</span> 2)
(<span style="color: #a020f0;">def</span> <span style="color: #0000ff;">+pollerr+</span> 4)
(<span style="color: #a020f0;">def</span> <span style="color: #0000ff;">+more+</span> 2)

<span style="color: #b22222;">;;</span><span style="color: #b22222;">Context
</span>(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">new-context</span> [io-threads]
  (ZMQ/context io-threads))
(<span style="color: #a020f0;">defonce</span> <span style="color: #0000ff;">*context*</span> (new-context 1))

(<span style="color: #a020f0;">defprotocol</span> <span style="color: #0000ff;">PSocket</span>
  (raw [this])
  (recv [this flags] [this])
  (bind [this address])
  (connect [this address])
  (hasMore [this])
  (close [this])
  (snd [this msg] [this msg flags])) 
(<span style="color: #a020f0;">defprotocol</span> <span style="color: #0000ff;">PPoller</span>
  (setTimeout [this timeout])
  (poll [this])
  (register [this socket])
  (getSocket [this i])
  (getSize [this])
  (pollin [this i])
  (pollout [this i])) 
(<span style="color: #a020f0;">defrecord</span> <span style="color: #0000ff;">Poller</span> [poll sockets] 
  PPoller 
  (getSize [_] (.getSize poll))
  (pollin [_ i] (.pollin poll i))
  (pollout [_ i] (.pollout poll i))
  (setTimeout [_ timeout] (.setTimeout poll timeout))
  (poll [_] (.poll poll))
  (register [_ socket]
            (.register poll
                       <span style="color: #b22222;">;;</span><span style="color: #b22222;">TODO: what if we reload? wont work?
</span>                       (<span style="color: #a020f0;">if</span> (<span style="color: #da70d6;">extends?</span> PSocket (<span style="color: #da70d6;">class</span> socket))
                         (.raw socket)
                         socket))
            (<span style="color: #da70d6;">swap!</span> sockets conj socket))
  (getSocket [_ i] (<span style="color: #da70d6;">nth</span> @sockets i)))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">new-poller</span>
  ([sockets] (new-poller *context* sockets))
  ([context sockets]
     (<span style="color: #a020f0;">let</span> [p (Poller. (.poller context (<span style="color: #da70d6;">count</span> sockets)) (<span style="color: #da70d6;">atom</span> []))]
       (.setTimeout p -1)
       (on [sock sockets]
           (.register p sock))
       p)))

<span style="color: #b22222;">;;</span><span style="color: #b22222;">TODO: now just a string socket!
</span>(<span style="color: #a020f0;">defrecord</span> <span style="color: #0000ff;">StringSocket</span> [socket]
  PSocket 
  (raw [this] socket)
  (snd [this msg] (.snd this msg 0))
  (snd [this msg flags]
       (<span style="color: #a020f0;">if</span> (<span style="color: #da70d6;">string?</span> msg)
         (.send socket (.getBytes msg) flags)
         (.send socket msg flags))) 
  (recv [this flags] (<span style="color: #a020f0;">when-let</span> [it (.recv socket flags)] (String. it)))
  (recv [this] (recv this 0)) 
  (close [this] (.close socket))
  (bind [this address] (.bind socket address))
  (connect [this address] (.connect socket address))
  (hasMore [this] (.hasReceiveMore socket))) 
(<span style="color: #a020f0;">defrecord</span> <span style="color: #0000ff;">Socket</span> [socket]
  PSocket 
  (raw [this] socket)
  (snd [this msg] (.snd this msg 0))
  (snd [this msg flags]
       (<span style="color: #a020f0;">if</span> (<span style="color: #da70d6;">string?</span> msg)
         (.send socket (.getBytes msg) flags)
         (.send socket msg flags))) 
  (recv [this flags]  (.recv socket flags))
  (recv [this] (recv this 0)) 
  (close [this] (.close socket))
  (bind [this address] (.bind socket address))
  (connect [this address] (.connect socket address))
  (hasMore [this] (.hasReceiveMore socket)))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">new-socket</span>
  ([type] (new-socket *context* type))
  ([context type] (Socket. (.socket context type))))
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">new-string-socket</span>
  ([type] (new-socket *context* type))
  ([context type] (StringSocket. (.socket context type))))

(<span style="color: #da70d6;">comment</span>
  (<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">new-poll</span>
    ([sockets] (new-poll *context* sockets))
    ([context sockets]
       (<span style="color: #a020f0;">let</span> [p (.poller context (<span style="color: #da70d6;">count</span> sockets))]
         (.setTimeout p -1)
         (on [sock sockets]
             (.register p (.socket sock)))
         p)))

  (<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">new-socket</span>
    ([socket-type]
       (new-socket *context* socket-type))
    ([context socket-type ]
       (.socket context socket-type))))
</pre></div>


</div>

</div>
