clj-forex.html

<div id="outline-container-4_2_9" class="outline-4">
<h4 id="sec-4_2_9"><span class="section-number-4">4.2.9</span> GUI </h4>
<div class="outline-text-4" id="text-4_2_9">




<div class="org-src-container"><label class="org-src-name">forex-util-gui()</label><pre class="src src-clojure">
(<span style="color: #a020f0;">ns</span> forex.util.gui
  (<span style="color: #da70d6;">:require</span> swank.swank)
  (<span style="color: #da70d6;">:use</span> forex.util.general clojure.contrib.miglayout forex.util.emacs forex.util.log)
  (<span style="color: #da70d6;">:import</span> 
   (java.awt Dimension Font event.MouseListener
             event.MouseAdapter Toolkit event.ActionListener event.KeyListener)
   (javax.swing JComboBox JPopupMenu JMenuItem
                ImageIcon
                table.AbstractTableModel
                JScrollPane JTable
                JFrame JPanel JTextField JLabel JButton
                SwingUtilities)))

(<span style="color: #a020f0;">import</span> javax.swing.JOptionPane)

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">add-watcher</span> [var key f]
  (add-watch
   var key
   (<span style="color: #da70d6;">bound-fn</span> [&amp; args]
             (<span style="color: #a020f0;">try</span> (<span style="color: #da70d6;">apply</span> f args)
                  (<span style="color: #a020f0;">catch</span> Exception e

                    (severe <span style="color: #bc8f8f;">"caught exception in watcher %s: %s"</span>
                            [var key] e)
                    (.printStackTrace e))))))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">inform</span> [msg &amp; args]
  (JOptionPane/showMessageDialog
   nil (<span style="color: #da70d6;">apply</span> format (<span style="color: #da70d6;">str</span> msg) args) <span style="color: #bc8f8f;">"!"</span> JOptionPane/INFORMATION_MESSAGE)) 
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">prompt</span>
  ([msg &amp; args]     
     (<span style="color: #a020f0;">let</span> [no-default true
           p (<span style="color: #a020f0;">if</span> no-default 
               (JOptionPane/showOptionDialog (JPanel.)
                                             (<span style="color: #da70d6;">apply</span> format (<span style="color: #da70d6;">str</span> msg) args) <span style="color: #bc8f8f;">"???"</span>
                                             JOptionPane/YES_NO_OPTION
                                             JOptionPane/QUESTION_MESSAGE
                                             nil
                                             (<span style="color: #da70d6;">into-array</span>  [<span style="color: #bc8f8f;">"Yes"</span> <span style="color: #bc8f8f;">"No"</span>])
                                             <span style="color: #bc8f8f;">"No"</span>)
               (JOptionPane/showConfirmDialog
                nil (<span style="color: #da70d6;">apply</span> format (<span style="color: #da70d6;">str</span> msg) args)
                <span style="color: #bc8f8f;">"???"</span> JOptionPane/YES_NO_OPTION))]
       (<span style="color: #a020f0;">if</span> (<span style="color: #da70d6;">=</span> JOptionPane/YES_OPTION p)
         true
         false))))


(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">create-image</span> [path]
  (.getImage (Toolkit/getDefaultToolkit) path))
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">create-icon</span> [path]
  (<span style="color: #a020f0;">try</span>
    (ImageIcon. (create-image path))
    (<span style="color: #a020f0;">catch</span> Exception e
      (warn <span style="color: #bc8f8f;">"couldnt create image %s"</span> path)
      nil)))

(<span style="color: #a020f0;">defn-</span> <span style="color: #0000ff;">get-fn</span> [a] (<span style="color: #a020f0;">if</span> (<span style="color: #da70d6;">var?</span> a) (<span style="color: #da70d6;">var-get</span> a) a))
(<span style="color: #a020f0;">defn-</span> <span style="color: #0000ff;">call-fn</span> [a &amp; args]
  (thread
   (<span style="color: #a020f0;">let</span> [f (get-fn a)]
     (<span style="color: #a020f0;">if</span> (<span style="color: #da70d6;">fn?</span> f) 
       (<span style="color: #da70d6;">apply</span> f args)
       (warn <span style="color: #bc8f8f;">"in listener, in var %s,val %s is not a function"</span> a f)))))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">add-key-listener</span> [obj f]
  (<span style="color: #a020f0;">when</span> (<span style="color: #da70d6;">fn?</span> (get-fn f))
    (.addKeyListener obj (<span style="color: #da70d6;">proxy</span> [KeyListener] []
                           (keyReleased [e] (call-fn f e))
                           (keyPressed [e])
                           (keyTyped [e])))))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">add-action-listener</span> [item val]
  (<span style="color: #a020f0;">when</span> (<span style="color: #a020f0;">or</span> (<span style="color: #a020f0;">and</span> (<span style="color: #da70d6;">var?</span> val) (<span style="color: #da70d6;">fn?</span> (<span style="color: #da70d6;">var-get</span> val))) (<span style="color: #da70d6;">fn?</span> val))
    (<span style="color: #a020f0;">let</span> [f (<span style="color: #da70d6;">bound-fn</span> [e] (call-fn val e))]
      (.addActionListener item
                          (<span style="color: #da70d6;">proxy</span> [ActionListener] nil 
                            (actionPerformed [e]
                                             (<span style="color: #a020f0;">try</span>
                                               (f e)
                                               (<span style="color: #a020f0;">catch</span> Exception e
                                                 (severe <span style="color: #bc8f8f;">"error in action listener %s"</span> e)))))))))
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">add-popup-listener</span> [obj f]
  (<span style="color: #a020f0;">when</span>  (<span style="color: #da70d6;">fn?</span> (get-fn f))
    (<span style="color: #a020f0;">let</span> [f (<span style="color: #da70d6;">bound-fn</span> [e] (call-fn f e))]
     (.addMouseListener
      obj
      (<span style="color: #da70d6;">proxy</span> [MouseAdapter] nil
        (mousePressed [e] (<span style="color: #a020f0;">when</span> (.isPopupTrigger e) (f e)))
        (mouseReleased [e] (<span style="color: #a020f0;">when</span> (.isPopupTrigger e) (f e)))))))
  obj)
<span style="color: #b22222;">;;</span><span style="color: #b22222;">TODO; println stack trace
</span>(<span style="color: #a020f0;">defmacro</span> <span style="color: #0000ff;">invoke-later</span> [&amp; args]
  `(SwingUtilities/invokeLater (<span style="color: #da70d6;">bound-fn</span> []
                                         (<span style="color: #a020f0;">try</span> (<span style="color: #a020f0;">do</span> ~@args)

                                              (<span style="color: #a020f0;">catch</span> Exception e#
                                                (.printStackTrace e#)
                                                (<span style="color: #da70d6;">println</span> e#))))))
</pre></div>



</div>

</div>
