clj-forex.org
*** Devel
#+srcname:forex-util-mql-devel
#+begin_src clojure :tangle src/forex/util/mql_devel.clj
  (clojure.core/use 'nstools.ns)
  (ns+ forex.util.mql-devel
       (:clone clj.core)
       (:use forex.util.general))


  (defmacro cond-out [& args]
    (apply str (map (fn [a]
		      (let [name (str a)]
			(format " else if (command==\"%s\") {\n\t   ret = process_%s(request);\n\t}" name name)))
		    args)))

  (cond-out
   AccountBalance
   AccountCredit
   AccountCompany
   AccountCurrency
   AccountEquity
   AccountFreeMargin
   AccountLeverage
   AccountMargin
   AccountName
   AccountNumber
   AccountServer
   AccountProfit
   OrderLots
   OrderDelete
   OrderCloseTime
   OrderType
   OrdersTotal
   OrderSend
   MarketInfo
   OrderClose
   OrderModify)
#+end_src

#+srcname:forex-util-indicator-devel
#+begin_src clojure :tangle src/forex/util/mql_indicator_devel.clj
  (clojure.core/use 'nstools.ns)
  ;;this file allows one to automatically produce binding code for metatrader custom indicators
  (ns+ forex.util.mql-indicator-devel
    (:clone clj.core)
    (:import java.io.File))

  (defmacro for+ [args & body]
    (let [a (partition-all 2 args)]
      `(map (fn ~(vec (map first a)) ~@body) ~@(map second a))))
  (defn throwf [msg & args]
    (throw (Exception. (apply format msg args))))

  (defn args [s]
    (map rest (re-seq #"extern\s+(\w+)\s+(\w+)" s)))
  (defn buffers [s]
    (count (re-seq #"SetIndexBuffer" s)))

  (defn extract [args]
    (let [type-to-fn (fn [type]
		       (condp = type
			   "int" "StrToInteger"
			   "double" "StrToDouble"
			   "string" nil
			   "color" "StrToInteger"
			   "bool" "StrToInteger"
			   (throwf "unknown type %s" type)))
	  user-extract (apply str
			      (interpose "\n"
					 (for+ [[type name] args index (iterate inc 6)]
					       (let [type-fn (type-to-fn type)]
						 (if type-fn
						   (format "%s %s = %s(command[%s]);" type name type-fn index)
						   (format "%s %s = command[%s];" type name index))))))
	  always (format "
  string symbol = command[2];
  int timeframe = StrToInteger(command[3]);
  int mode = StrToInteger(command[4]);
  int shift = StrToInteger(command[5]);")]
      (str always "\n" user-extract)))

  (defn extension [f] (let [e (second (.split (if (instance? File f) (.getName f) f) "\\."))] (if (string? e) (.trim e))))

  (defn to-test [all]
    (format "%nstring process_INDICATORS(string commands[]) {%nstring ret = \"\";string command=commands[1];%n%s%nreturn(ret);}"
	    (apply str
		   "if (command==\"0\") {\n}\n"
		   (map #(format "else if (command==\"%s\") {%nprotocol_found=true;%nret = %s(commands);%n}%n" (:function-name %) (:function-name %)) all))))


  (defn- listify [s] (if-not (empty? s) (str (apply str (interpose "," s)) ",") "" ))
  (defn name-of [f] (first (.split (.getName f) "\\.")))
  (defn iCustom
    "given a file, generate mql4 binding code to the indicator in the flie"
    [f]
    (let [name (.replaceAll (first (.split (.getName f) "\\.")) "( |-)+" "_")
	  s (slurp f)
	  args (map #(list (first %) (format "i_%s" (second %))) (args s))
	  buffers (buffers s)]
      (when (and s args buffers)
	(let [custom (format "double val = iCustom(symbol,timeframe,\"%s\",%smode,shift);" ;
					       (name-of f) (listify (map second args))) 
	      extract (extract args)

	      return (format
		      "
  int err = GetLastError();
  if(err!=0)
    return(\"error \" + err);
  return(val); 
  }")
	      function-name (format "Custom_%s" name)
	      function-header (format "string %s (string command[]) {" function-name)] 
	  {:file f :file-name name :function-name function-name :args args :buffers buffers
	   :code  (format "%s %s %s %s" function-header extract custom return)}))))

  (defn iCustom-all [dir out]
    (let [files (.listFiles (File. dir))
	  customs (for [f files :when (= (extension f) "mq4")] (iCustom f))]
      (spit out (format "bool protocol_found = false;%n%s\n%s" (apply str (interpose "\n\n" (map :code customs)))
			(to-test customs)))))


  ;;example usage - first param is custom indicator folder, second is output file
  (defn do-it []
    (iCustom-all
     "/home/seth/.wine/dosdevices/c:/Program Files/FXCM MT4 powered by BT/experts/indicators/"
     "/home/seth/.wine/dosdevices/c:/Program Files/FXCM MT4 powered by BT/experts/include/INDICATORS.mqh"))
#+end_src

** Backend
