clj-forex.html

<div id="outline-container-4_2_10" class="outline-4">
<h4 id="sec-4_2_10"><span class="section-number-4">4.2.10</span> Devel </h4>
<div class="outline-text-4" id="text-4_2_10">




<div class="org-src-container"><label class="org-src-name">forex-util-mql-devel()</label><pre class="src src-clojure">
(clojure.core/<span style="color: #da70d6;">use</span> 'nstools.ns)
(ns+ forex.util.mql-devel
     (<span style="color: #da70d6;">:clone</span> clj.core)
     (<span style="color: #da70d6;">:use</span> forex.util.general))


(<span style="color: #a020f0;">defmacro</span> <span style="color: #0000ff;">cond-out</span> [&amp; args]
  (<span style="color: #da70d6;">apply</span> str (<span style="color: #da70d6;">map</span> (<span style="color: #da70d6;">fn</span> [a]
                    (<span style="color: #a020f0;">let</span> [name (<span style="color: #da70d6;">str</span> a)]
                      (<span style="color: #da70d6;">format</span> <span style="color: #bc8f8f;">" else if (command==\"%s\") {\n\t   ret = process_%s(request);\n\t}"</span> name name)))
                  args)))

(cond-out
 AccountBalance
 AccountCredit
 AccountCompany
 AccountCurrency
 AccountEquity
 AccountFreeMargin
 AccountLeverage
 AccountMargin
 AccountName
 AccountNumber
 AccountServer
 AccountProfit
 OrderLots
 OrderDelete
 OrderCloseTime
 OrderType
 OrdersTotal
 OrderSend
 MarketInfo
 OrderClose
 OrderModify)
</pre></div>




<div class="org-src-container"><label class="org-src-name">forex-util-indicator-devel()</label><pre class="src src-clojure">
(clojure.core/<span style="color: #da70d6;">use</span> 'nstools.ns)
<span style="color: #b22222;">;;</span><span style="color: #b22222;">this file allows one to automatically produce binding code for metatrader custom indicators
</span>(ns+ forex.util.mql-indicator-devel
  (<span style="color: #da70d6;">:clone</span> clj.core)
  (<span style="color: #da70d6;">:import</span> java.io.File))

(<span style="color: #a020f0;">defmacro</span> <span style="color: #0000ff;">for+</span> [args &amp; body]
  (<span style="color: #a020f0;">let</span> [a (partition-all 2 args)]
    `(<span style="color: #da70d6;">map</span> (<span style="color: #da70d6;">fn</span> <span style="color: #0000ff;">~</span>(<span style="color: #da70d6;">vec</span> (<span style="color: #da70d6;">map</span> first a)) ~@body) ~@(<span style="color: #da70d6;">map</span> second a))))
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">throwf</span> [msg &amp; args]
  (<span style="color: #a020f0;">throw</span> (Exception. (<span style="color: #da70d6;">apply</span> format msg args))))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">args</span> [s]
  (<span style="color: #da70d6;">map</span> rest (<span style="color: #da70d6;">re-seq</span> #<span style="color: #bc8f8f;">"extern\s+(\w+)\s+(\w+)"</span> s)))
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">buffers</span> [s]
  (<span style="color: #da70d6;">count</span> (<span style="color: #da70d6;">re-seq</span> #<span style="color: #bc8f8f;">"SetIndexBuffer"</span> s)))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">extract</span> [args]
  (<span style="color: #a020f0;">let</span> [type-to-fn (<span style="color: #da70d6;">fn</span> [type]
                     (<span style="color: #a020f0;">condp</span> = type
                         <span style="color: #bc8f8f;">"int"</span> <span style="color: #bc8f8f;">"StrToInteger"</span>
                         <span style="color: #bc8f8f;">"double"</span> <span style="color: #bc8f8f;">"StrToDouble"</span>
                         <span style="color: #bc8f8f;">"string"</span> nil
                         <span style="color: #bc8f8f;">"color"</span> <span style="color: #bc8f8f;">"StrToInteger"</span>
                         <span style="color: #bc8f8f;">"bool"</span> <span style="color: #bc8f8f;">"StrToInteger"</span>
                         (throwf <span style="color: #bc8f8f;">"unknown type %s"</span> type)))
        user-extract (<span style="color: #da70d6;">apply</span> str
                            (<span style="color: #da70d6;">interpose</span> <span style="color: #bc8f8f;">"\n"</span>
                                       (for+ [[type name] args index (<span style="color: #da70d6;">iterate</span> inc 6)]
                                             (<span style="color: #a020f0;">let</span> [type-fn (type-to-fn type)]
                                               (<span style="color: #a020f0;">if</span> type-fn
                                                 (<span style="color: #da70d6;">format</span> <span style="color: #bc8f8f;">"%s %s = %s(command[%s]);"</span> type name type-fn index)
                                                 (<span style="color: #da70d6;">format</span> <span style="color: #bc8f8f;">"%s %s = command[%s];"</span> type name index))))))
        always (<span style="color: #da70d6;">format</span> <span style="color: #bc8f8f;">"
string symbol = command[2];
int timeframe = StrToInteger(command[3]);
int mode = StrToInteger(command[4]);
int shift = StrToInteger(command[5]);"</span>)]
    (<span style="color: #da70d6;">str</span> always <span style="color: #bc8f8f;">"\n"</span> user-extract)))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">extension</span> [f] (<span style="color: #a020f0;">let</span> [e (<span style="color: #da70d6;">second</span> (.split (<span style="color: #a020f0;">if</span> (<span style="color: #da70d6;">instance?</span> File f) (.getName f) f) <span style="color: #bc8f8f;">"\\."</span>))] (<span style="color: #a020f0;">if</span> (<span style="color: #da70d6;">string?</span> e) (.trim e))))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">to-test</span> [all]
  (<span style="color: #da70d6;">format</span> <span style="color: #bc8f8f;">"%nstring process_INDICATORS(string commands[]) {%nstring ret = \"\";string command=commands[1];%n%s%nreturn(ret);}"</span>
          (<span style="color: #da70d6;">apply</span> str
                 <span style="color: #bc8f8f;">"if (command==\"0\") {\n}\n"</span>
                 (<span style="color: #da70d6;">map</span> #(<span style="color: #da70d6;">format</span> <span style="color: #bc8f8f;">"else if (command==\"%s\") {%nprotocol_found=true;%nret = %s(commands);%n}%n"</span> (<span style="color: #da70d6;">:function-name</span> %) (<span style="color: #da70d6;">:function-name</span> %)) all))))


(<span style="color: #a020f0;">defn-</span> <span style="color: #0000ff;">listify</span> [s] (<span style="color: #a020f0;">if-not</span> (<span style="color: #da70d6;">empty?</span> s) (<span style="color: #da70d6;">str</span> (<span style="color: #da70d6;">apply</span> str (<span style="color: #da70d6;">interpose</span> <span style="color: #bc8f8f;">","</span> s)) <span style="color: #bc8f8f;">","</span>) <span style="color: #bc8f8f;">""</span> ))
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">name-of</span> [f] (<span style="color: #da70d6;">first</span> (.split (.getName f) <span style="color: #bc8f8f;">"\\."</span>)))
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">iCustom</span>
  <span style="color: #bc8f8f;">"given a file, generate mql4 binding code to the indicator in the flie"</span>
  [f]
  (<span style="color: #a020f0;">let</span> [name (.replaceAll (<span style="color: #da70d6;">first</span> (.split (.getName f) <span style="color: #bc8f8f;">"\\."</span>)) <span style="color: #bc8f8f;">"( |-)+"</span> <span style="color: #bc8f8f;">"_"</span>)
        s (<span style="color: #da70d6;">slurp</span> f)
        args (<span style="color: #da70d6;">map</span> #(<span style="color: #da70d6;">list</span> (<span style="color: #da70d6;">first</span> %) (<span style="color: #da70d6;">format</span> <span style="color: #bc8f8f;">"i_%s"</span> (<span style="color: #da70d6;">second</span> %))) (args s))
        buffers (buffers s)]
    (<span style="color: #a020f0;">when</span> (<span style="color: #a020f0;">and</span> s args buffers)
      (<span style="color: #a020f0;">let</span> [custom (<span style="color: #da70d6;">format</span> <span style="color: #bc8f8f;">"double val = iCustom(symbol,timeframe,\"%s\",%smode,shift);"</span> <span style="color: #b22222;">;</span><span style="color: #b22222;">
</span>                                             (name-of f) (listify (<span style="color: #da70d6;">map</span> second args))) 
            extract (extract args)

            return (<span style="color: #da70d6;">format</span>
                    <span style="color: #bc8f8f;">"
int err = GetLastError();
if(err!=0)
  return(\"error \" + err);
return(val); 
}"</span>)
            function-name (<span style="color: #da70d6;">format</span> <span style="color: #bc8f8f;">"Custom_%s"</span> name)
            function-header (<span style="color: #da70d6;">format</span> <span style="color: #bc8f8f;">"string %s (string command[]) {"</span> function-name)] 
        {<span style="color: #da70d6;">:file</span> f <span style="color: #da70d6;">:file-name</span> name <span style="color: #da70d6;">:function-name</span> function-name <span style="color: #da70d6;">:args</span> args <span style="color: #da70d6;">:buffers</span> buffers
         <span style="color: #da70d6;">:code</span>  (<span style="color: #da70d6;">format</span> <span style="color: #bc8f8f;">"%s %s %s %s"</span> function-header extract custom return)}))))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">iCustom-all</span> [dir out]
  (<span style="color: #a020f0;">let</span> [files (.listFiles (File. dir))
        customs (<span style="color: #a020f0;">for</span> [f files <span style="color: #da70d6;">:when</span> (<span style="color: #da70d6;">=</span> (extension f) <span style="color: #bc8f8f;">"mq4"</span>)] (iCustom f))]
    (spit out (<span style="color: #da70d6;">format</span> <span style="color: #bc8f8f;">"bool protocol_found = false;%n%s\n%s"</span> (<span style="color: #da70d6;">apply</span> str (<span style="color: #da70d6;">interpose</span> <span style="color: #bc8f8f;">"\n\n"</span> (<span style="color: #da70d6;">map</span> <span style="color: #da70d6;">:code</span> customs)))
                      (to-test customs)))))


<span style="color: #b22222;">;;</span><span style="color: #b22222;">example usage - first param is custom indicator folder, second is output file
</span>(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">do-it</span> []
  (iCustom-all
   <span style="color: #bc8f8f;">"/home/seth/.wine/dosdevices/c:/Program Files/FXCM MT4 powered by BT/experts/indicators/"</span>
   <span style="color: #bc8f8f;">"/home/seth/.wine/dosdevices/c:/Program Files/FXCM MT4 powered by BT/experts/include/INDICATORS.mqh"</span>))
</pre></div>



</div>
</div>

</div>
