clj-forex.org
*** Account
#+srcname:account-core
#+begin_src clojure :tangle src/forex/module/account/core.clj
  ;;forex.module.order.core - interface with mql backend
  (clojure.core/use 'nstools.ns)
  (ns+ forex.module.account.core
    (:clone clj.core)
    (:use forex.util.core
	  forex.util.emacs 
	  forex.util.general
	  forex.module.error))

  (def- order
    {:buy 0 :sell 1 :buy-limit 2 :sell-limit 3 :buy-stop 4 :sell-stop 5})

  (def- color
    {:red 230 :yellow 65535 :green 65280 :blue 13749760
     :purple  16711935 :white 16777215 :black 0})

  (defn- get! [hash key]
    (if-let [it (hash key)]
      it
      (throwf "invalid key %s in hash %s" key hash)))

  ;;the below can throw errors - how to handle this? 
  (defn order-modify
    ([ticket price sl tp]
       (order-modify ticket price sl tp :blue))
    ([ticket price sl tp color_of]
       (receive (format "OrderModify %s %s %s %s %s"
			ticket price sl tp (get! color color_of))))) 

  (defn order-send
    ([symbol cmd volume price] (order-send symbol cmd volume price 0 0))
    ([symbol cmd volume price sl tp] (order-send symbol cmd volume price sl tp 3))
    ([symbol cmd volume price sl tp slip]
       (receive
	(format "OrderSend %s %s %s %s %s %s %s"
		symbol (get! order cmd)
		volume price slip sl tp))))

  (defn order-close-time [ticket]
    (receive (format "OrderCloseTime %s" ticket)))

  (defn order-close [ticket lots price slippage color_of]
    (receive (format "OrderClose %s %s %s %s %s"
		     ticket lots price slippage (get! color color_of))))
  (defn order-delete [ticket]
    (receive (format "OrderDelete %s" ticket)))

  (defn market-info [symbol type]
     (receive (format "MarketInfo %s %s" symbol type)))

  (defn order-close-time [ticket]
    (receive (format "OrderCloseTime %s" ticket)))

  (defn order-type [ticket]
    (receive (format "OrderType %s" ticket)))

  (defn order-lots [ticket]
    (receive (format "OrderLots %s" ticket)))
#+end_src
 
#+srcname:account-utils
#+begin_src clojure :tangle src/forex/module/account/utils.clj
  (clojure.core/use 'nstools.ns)

  (ns+ forex.module.account.utils
    (:clone clj.core)
    (:use forex.util.core
	  forex.util.emacs  
	  forex.util.general
	  forex.module.error)
    (:require  [forex.module.account.core :as core]))


  ;;account common
  (defn- sym [a] (symbol (camel-to-dash a)))
  (defmacro- single [name] `(defn ~(sym name) [] (receive! ~name)))
  (defmacro- singles [& names] `(do ~@(map (fn [a] `(single ~a)) names)))


  ;;none of the below singles or double-singles should throw a mql error - therefore, it is a bug if they do
  (singles
   "AccountCurrency"
   "AccountCompany"
   "AccountServer" 
   "AccountName"
   "AccountNumber"
   "AccountCredit"
   "AccountBalance"
   "AccountEquity"
   "AccountFreeMargin"
   "AccountLeverage"
   "AccountMargin"
   "AccountProfit"
   "OrdersTotal")
  (defn demo? [] (receive "IsDemo"))
  (defn connected? [] (receive "IsConnected"))
  (defn trade? [] (receive "IsTradeAllowed"))

  ;;

  (defmacro- define-market-info [& args]
    `(do ~@(map (fn [[name num]]
		  `(defn ~(symbolicate "mode-" name)
		     ([] (~(symbolicate "mode-" name) (env :symbol)))
		     ([symbol#]
			(let [res# (core/market-info symbol# ~num)]
			  (if (e? res#)
			    (throwf "market-info error %s" (:e res#))
			    res#)))))
		(group args)))) 

  (define-market-info
    low 1
    high 2
    time 5
    bid 9
    ask 10
    point 11
    digits 12
    spread 13
    stoplevel 14
    lotsize 15
    tickvalue 16
    ticksize 17
    swaplong 18
    swapshort 19
    starting 20
    expiration 21
    trade-allowed 22
    minlot 23
    lotstep 24
    maxlot 25
    swaptype 26
    profitcalcmode 27
    margincalcmode 28
    margininit 29
    marginmaintenance 30
    marginhedged 31
    marginrequired 32
    freezelevel 33)

  (comment
    (defn demo? []
      (if (re-find #"(?i)demo" (account-server))
	true
	false)))

  (defn sell? [{type :type}]
    (or (= type :sell) (= type :sell-stop) (= type :sell-limit)))
  (defn buy? [{type :type}]
    (or (= type :buy) (= type :buy-stop) (= type :buy-limit)))
  (defn- to-big [num] (BigDecimal/valueOf (if (integer? num) (double num) num)))
  (defn lot 
    ([num] (lot num (env :symbol)))
    ([num symbol]
       (let [a (to-big num)
	     b (to-big (mode-minlot symbol))]
	 (* b (.intValue (/ a b))))))

  (defn- assert-order [order] (is? [(or (sell? order) (buy? order))]))

  (defn o-- [o & args]
    (assert-order o)
    (if (sell? o) (- (apply - args)) (apply - args)))

  (defn o+ [o & args]
    (assert-order o) 
    (if (sell? o) (apply - args) (apply + args)))
  (defn o- [o & args]
    (assert-order o)
    (if (sell? o) (apply + args) (apply - args)))

  (defn omax [order & args]
    (assert-order order)
    (let [args (filter #(not (zero? %)) args)]
      (if (empty? args)
	(or (:sl order) 0) 
	(apply (if (buy? order) max min) args))))

  (defn omin [order & args]
    (assert-order order)
    (let [args (filter #(not (zero? %)) args)]
      (if (empty? args)
	(or (:sl order) 0) 
	(apply (if (buy? order) min max)
	       args))))


  ;;TODO: change for 4 digit broker
  (defn digits []
    (mode-digits "EURUSD"))

  ;;TODO: check for valid symbol on all of this??
  (defn spread
    ([] (spread (env :symbol)))
    ([symbol]
       (let [d (digits) spread (mode-spread symbol)]
	 (cond
	  (= d 5) (/ spread 10)
	  (= d 4) spread))))

  (defn point
    ([pt] (/ pt (point)))
    ([]
       (let [d (digits)]  
	 (if (= d 5)
	   (* 10 (mode-point))
	   (mode-point)))))

  (defn pip [pt] (* (point) pt))
#+end_src

#+srcname:account-common
#+begin_src clojure :tangle src/forex/module/account.clj
  ;;TODO: unit test everything
  ;;TODO: create a new atom-hash on merging, etc????????
  (clojure.core/use 'nstools.ns)
  (ns+ forex.module.account
       (:clone clj.core)
       (:import forex.backend.mql.socket-service.MqlError)
       (:use forex.util.core
	     forex.util.emacs  
	     forex.util.general forex.util.log
	     forex.module.indicator
	     forex.module.error forex.module.account.utils)

       (:require  [forex.module.account.core :as core]))

  (defvar *account-warn-on-mql-error* true)

  (defn- account-warn
    ([err order] (account-warn err order ""))
    ([err order msg & args]
       (if *account-warn-on-mql-error* 
	 (do (warn "MQL error %s on order %s - %s" (:e err)
		   order (apply format msg args)) err)
	 err)))
  (defmacro- with-order [order & body]
    `(let [o# ~order]
       (if-not (= (:lots o#) 0)
	 (do ~@body)
	 (do (warn "attempting to change order %s with zero lots" o#)
	     o#)))) 

  (defn- >? [a] (and (number? a) (>= a 0)))

  (comment
    (defmacro- default [& body] 
      `(binding [*default* @~#'err/*er*]
	 ~@body)))

  ;;TODO: do we need all of these assertions?
  (def- value-to-order-type
    {0 :buy 1 :sell 2 :buy-limit
     3 :sell-limit 4 :buy-stop
     5 :sell-stop}) 

  (defprotocol POrder
    (order-close-time [this])
    (order-type [this])
    (delete! [this] )
    (close! [this] [this new-lots])
    (modify! [this sl-tp-map])
    (order! [this])
    (open? [this]) (close? [this])
    (order? [this]) 
    (market? [this]) (entry? [this]))

  (defn- order-close-time* [{id :id}]
    (is? (string? id))
    ;;we dont need to know mql4 error codes for order close time
    (aif (core/order-close-time id) it -1)) ;;TODO: return 0 instead?
  (defn- order-type*  [order]
    (is? (string? (:id order)))
    (aif (core/order-type (:id order))
	 (value-to-order-type (int it))))

  (defn- delete!* [{id :id lots :lots :as o}]
    (with-order o
      (if-not (= lots 0)
	(aif (core/order-delete id) (merge o {:lots 0}) it)
	o)))


  (defn- close!*
    ([o] (close! o 0))
    ([{:keys [price lots slip id symbol] :as order} new-lots]
       (with-order order
	 (is? [(string? id) (string? symbol) 
	       [price (pos? price)]
	       [(number? lots) (>= lots 0)]])
	 (is? (>= (- lots new-lots) 0))
	 (if-not (= new-lots lots)
	   (aif (core/order-close id (- lots new-lots)
				  (if (sell? order)
				    (ask symbol)
				    (bid symbol))
				  slip :blue)
		(merge order {:lots new-lots})
		(account-warn it order "invalid new lots %s" new-lots))
	   order))))

  ;;TODO: normalize so we dont get mql error 1?
  ;;TODO: act as a regular modify if we dont pass in sl,tp,or price 
  (defn- modify!* [order {:keys [sl tp] :as mod}]
    (with-order order
      (let [sl (or sl (:sl order))
	    tp (or tp (:tp order)) 
	    price (:price order)] 
	(if (or (number? sl) (number? tp))
	  (do  
	    (is? [sl tp price (>? sl) (>? tp) (pos? price)]) 
	    (if-not (and (= sl (:sl order))
			 (= tp (:tp order)))
	      (aif (core/order-modify (:id order) (:price order) sl tp)
		   (merge order (merge mod {:sl sl :tp tp}))
		   (if (= (:e it) 1)
		     (merge order mod)
		     (account-warn it order "sl %s tp %s" sl tp)))
	      (merge order mod)))
	  (merge order mod)))))   

  ;;TOODOs: how do we get map with defaults?
  (defn- verify-order [{:keys [slip symbol type price tp sl lots]
			:or {slip 3 sl 0 tp 0}}]
    (is? [(number? slip) (> slip 0) (integer? slip)]
	 "invalid order slip %s" slip)
    (is? [ (keyword? type) (number? lots)
	   (number? tp) (number? sl) (number? price)]) 
    (is? [ (string? symbol) (> lots 0)
	   (>= tp 0) (>= sl 0) (>= price 0)])  
    (cond
     (or (= type :sell) (= type :sell-limit) (= type :sell-stop))
     (is? (or (and (zero? sl) (zero? tp))
	      (and (zero? sl) tp (< tp price))
	      (and (zero? tp) sl (> sl price))
	      (and (< tp sl) (< tp price) (> sl price)))
	  "invalid %s order with sl/tp %s/%s with price of %s" type sl tp price)
     (or (= type :buy) (= type :buy-limit) (= type :buy-stop))
     (is? (or (and (zero? sl) (zero? tp))
	      (and (zero? sl) tp (> tp price))
	      (and (zero? tp) sl (< sl price))
	      (and (> tp sl) (> tp price) (< sl price)))
	  "invalid %s order with sl/tp %s/%s with price of %s" type sl tp price)
     true (throwf "invalid %s order with sl/tp %s/%s with price of %s"
		  type sl tp price))) 
  ;;TODO: change to make reliable and to work for ECN brokers and such
  ;;see http://forum.mql4.com/36608
  ;;TODO: what happens if second modify fails? how can programmer find this out?

  (defn- order!* [{:keys [symbol type price tp sl lots slip]
		   :as order
		   :or { symbol (env :symbol) sl 0 tp 0 slip 3}}]
    (let [price (or price (if (sell? order) (bid symbol) (ask symbol)))
	  order (merge 
		 {:symbol symbol
		  :slip slip}
		 (merge order {:sl 0 :tp 0 :id "" :price price}))]
      (with-order order    
	(verify-order order)
	(aif (core/order-send symbol type lots price 0 0 slip)
	     (let [result
		   (let [o (merge order {:id it})]
		     ;;now, use modify to change sl and tp
		     (aif (modify!* o {:sl sl :tp tp})
			  (merge o {:sl sl :tp tp})
			  o))
		   spread (spread)]
	       (merge result {:spread spread :break (o+ result price (pip spread))})) 
	     (account-warn it order))))) 

  (defn- open?* [order] 
    (= (order-close-time order) 0))
  (defn- close?* [order]
    (not (open? order)))
  (defn- order?* [order]
    (not (nil? (order-type order))))   
  (defn- market?*
    "determine if order is market order"
    [order]
    (let [type (order-type order)]
      (or (= type :sell) (= type :buy)))) 
  (defn- entry?*
    "determine if order is entry order"
    [order]
    (let [type (order-type order)]
      (and type (not (or (= type :sell) (= type :buy))))))

  (extend clojure.lang.IPersistentMap
    POrder {:order-close-time order-close-time*
	    :order-type order-type*
	    :delete! delete!*
	    :close! close!*
	    :modify! modify!*
	    :order! order!*

	    :open? open?*
	    :close? close?*
	    :order? order?*
	    :market? market?*
	    :entry? entry?*})

  (extend-type MqlError
    POrder
    (order! [this] this)
    (delete! [this] this)
    (close! [this] this)
    (modify! [this] this))

  (extend-type forex.util.core.AtomHash ;;clojure.lang.Atom
    POrder
    (order-close-time [this] (order-close-time @this))
    (order-type [this] (order-type @this))
    ;;(order! [this] (aif (order! @this) (do (reset! (.val this) it) this) it))
    (delete! [this] (aif (delete! @this) (do (reset! (.val this) it) this) it))  
    (close!
     ([this new-amount] (aif (close! @this new-amount) (do (reset! (.val this) it) this) it))
     ([this] (close! this 0)))
    (modify! [this sl-tp] (aif (modify! @this sl-tp) (do (reset! (.val this) it) this) it))
    (open? [this] (open? @this))
    (close? [this] (not (open? @this)))
    (order? [this] (order? @this))
    (market? [this] (market? @this))
    (entry? [this] (entry? @this)))
#+end_src
