clj-forex.html

<div id="outline-container-4_4" class="outline-3">
<h3 id="sec-4_4"><span class="section-number-3">4.4</span> Module </h3>
<div class="outline-text-3" id="text-4_4">


</div>

<div id="outline-container-4_4_1" class="outline-4">
<h4 id="sec-4_4_1"><span class="section-number-4">4.4.1</span> Account </h4>
<div class="outline-text-4" id="text-4_4_1">




<div class="org-src-container"><label class="org-src-name">account-core()</label><pre class="src src-clojure">
<span style="color: #b22222;">;;</span><span style="color: #b22222;">forex.module.order.core - interface with mql backend
</span>(clojure.core/<span style="color: #da70d6;">use</span> 'nstools.ns)
(ns+ forex.module.account.core
  (<span style="color: #da70d6;">:clone</span> clj.core)
  (<span style="color: #da70d6;">:use</span> forex.util.core
        forex.util.emacs 
        forex.util.general
        forex.module.error))

(<span style="color: #a020f0;">def-</span> <span style="color: #0000ff;">order</span>
  {<span style="color: #da70d6;">:buy</span> 0 <span style="color: #da70d6;">:sell</span> 1 <span style="color: #da70d6;">:buy-limit</span> 2 <span style="color: #da70d6;">:sell-limit</span> 3 <span style="color: #da70d6;">:buy-stop</span> 4 <span style="color: #da70d6;">:sell-stop</span> 5})

(<span style="color: #a020f0;">def-</span> <span style="color: #0000ff;">color</span>
  {<span style="color: #da70d6;">:red</span> 230 <span style="color: #da70d6;">:yellow</span> 65535 <span style="color: #da70d6;">:green</span> 65280 <span style="color: #da70d6;">:blue</span> 13749760
   <span style="color: #da70d6;">:purple</span>  16711935 <span style="color: #da70d6;">:white</span> 16777215 <span style="color: #da70d6;">:black</span> 0})

(<span style="color: #a020f0;">defn-</span> <span style="color: #0000ff;">get!</span> [hash key]
  (<span style="color: #a020f0;">if-let</span> [it (<span style="color: #da70d6;">hash</span> key)]
    it
    (throwf <span style="color: #bc8f8f;">"invalid key %s in hash %s"</span> key hash)))

<span style="color: #b22222;">;;</span><span style="color: #b22222;">the below can throw errors - how to handle this? 
</span>(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">order-modify</span>
  ([ticket price sl tp]
     (order-modify ticket price sl tp <span style="color: #da70d6;">:blue</span>))
  ([ticket price sl tp color_of]
     (receive (<span style="color: #da70d6;">format</span> <span style="color: #bc8f8f;">"OrderModify %s %s %s %s %s"</span>
                      (<span style="color: #da70d6;">first</span> ticket)
                      price sl tp (get! color color_of))
              false))) 

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">order-send</span>
  ([symbol cmd volume price] (order-send symbol cmd volume price 0 0))
  ([symbol cmd volume price sl tp] (order-send symbol cmd volume price sl tp 3))
  ([symbol cmd volume price sl tp slip]
     (receive
      (<span style="color: #da70d6;">format</span> <span style="color: #bc8f8f;">"OrderSend %s %s %s %s %s %s %s"</span>
              symbol (get! order cmd)
              volume price slip sl tp)
      false)))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">order-close</span> [ticket lots price slippage color_of]
  (receive (<span style="color: #da70d6;">format</span> <span style="color: #bc8f8f;">"OrderClose %s %s %s %s %s"</span>
                   (<span style="color: #da70d6;">first</span> ticket) lots price slippage (get! color color_of))
           false))
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">order-delete</span> [ticket]
  (receive (<span style="color: #da70d6;">format</span> <span style="color: #bc8f8f;">"OrderDelete %s"</span> (<span style="color: #da70d6;">first</span> ticket))
           false))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">order-close-time</span> [ticket]
  (receive (<span style="color: #da70d6;">format</span> <span style="color: #bc8f8f;">"OrderCloseTime %s"</span> (<span style="color: #da70d6;">first</span> ticket))))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">market-info</span> [symbol type]
  (receive (<span style="color: #da70d6;">format</span> <span style="color: #bc8f8f;">"MarketInfo %s %s"</span> symbol type)))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">order-close-time</span> [ticket]
  (receive (<span style="color: #da70d6;">format</span> <span style="color: #bc8f8f;">"OrderCloseTime %s"</span> (<span style="color: #da70d6;">first</span> ticket))))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">order-type</span> [ticket]
  (receive (<span style="color: #da70d6;">format</span> <span style="color: #bc8f8f;">"OrderType %s"</span> (<span style="color: #da70d6;">first</span> ticket))))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">order-lots</span> [ticket]
  (receive (<span style="color: #da70d6;">format</span> <span style="color: #bc8f8f;">"OrderLots %s"</span> (<span style="color: #da70d6;">first</span> ticket))))
</pre></div>






<div class="org-src-container"><label class="org-src-name">account-utils()</label><pre class="src src-clojure">
(clojure.core/<span style="color: #da70d6;">use</span> 'nstools.ns)

(ns+ forex.module.account.utils
     (<span style="color: #da70d6;">:clone</span> clj.core)
     (<span style="color: #da70d6;">:use</span> forex.util.core
           forex.util.emacs  
           forex.util.general
           forex.module.error

           )
     (<span style="color: #da70d6;">:require</span>  [forex.module.account.core <span style="color: #da70d6;">:as</span> core]))


<span style="color: #b22222;">;;</span><span style="color: #b22222;">account common
</span>(<span style="color: #a020f0;">defn-</span> <span style="color: #0000ff;">sym</span> [a] (<span style="color: #da70d6;">symbol</span> (camel-to-dash a)))
(<span style="color: #a020f0;">defmacro-</span> <span style="color: #0000ff;">single</span> [name] `(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">~</span>(sym name) [] (receive! ~name)))
(<span style="color: #a020f0;">defmacro-</span> <span style="color: #0000ff;">singles</span> [&amp; names] `(<span style="color: #a020f0;">do</span> ~@(<span style="color: #da70d6;">map</span> (<span style="color: #da70d6;">fn</span> [a] `(single ~a)) names)))


<span style="color: #b22222;">;;</span><span style="color: #b22222;">none of the below singles or double-singles should throw a mql error - therefore, it is a bug if they do
</span>(singles
 <span style="color: #bc8f8f;">"AccountCurrency"</span>
 <span style="color: #bc8f8f;">"AccountCompany"</span>
 <span style="color: #bc8f8f;">"AccountServer"</span> 
 <span style="color: #bc8f8f;">"AccountName"</span>
 <span style="color: #bc8f8f;">"AccountNumber"</span>
 <span style="color: #bc8f8f;">"AccountCredit"</span>
 <span style="color: #bc8f8f;">"AccountBalance"</span>
 <span style="color: #bc8f8f;">"AccountEquity"</span>
 <span style="color: #bc8f8f;">"AccountFreeMargin"</span>
 <span style="color: #bc8f8f;">"AccountLeverage"</span>
 <span style="color: #bc8f8f;">"AccountMargin"</span>
 <span style="color: #bc8f8f;">"AccountProfit"</span>
 <span style="color: #bc8f8f;">"OrdersTotal"</span>)
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">demo?</span> [] (receive <span style="color: #bc8f8f;">"IsDemo"</span>))
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">connected?</span> [] (receive <span style="color: #bc8f8f;">"IsConnected"</span>))
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">trade?</span> [] (receive <span style="color: #bc8f8f;">"IsTradeAllowed"</span>))

<span style="color: #b22222;">;;</span><span style="color: #b22222;">
</span>
(<span style="color: #a020f0;">defmacro-</span> <span style="color: #0000ff;">define-market-info</span> [&amp; args]
  `(<span style="color: #a020f0;">do</span> ~@(<span style="color: #da70d6;">map</span> (<span style="color: #da70d6;">fn</span> [[name num]]
                `(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">~</span>(symbolicate <span style="color: #bc8f8f;">"mode-"</span> name)
                   ([] (~(symbolicate <span style="color: #bc8f8f;">"mode-"</span> name) (env <span style="color: #da70d6;">:symbol</span>)))
                   ([symbol#]
                      (<span style="color: #a020f0;">let</span> [res# (core/market-info symbol# ~num)]
                        (<span style="color: #a020f0;">if</span> (e? res#)
                          (throwf <span style="color: #bc8f8f;">"market-info error %s"</span> (<span style="color: #da70d6;">:e</span> res#))
                          res#)))))
              (group args)))) 

(define-market-info
  low 1
  high 2
  time 5
  bid 9
  ask 10
  point 11
  digits 12
  spread 13
  stoplevel 14
  lotsize 15
  tickvalue 16
  ticksize 17
  swaplong 18
  swapshort 19
  starting 20
  expiration 21
  trade-allowed 22
  minlot 23
  lotstep 24
  maxlot 25
  swaptype 26
  profitcalcmode 27
  margincalcmode 28
  margininit 29
  marginmaintenance 30
  marginhedged 31
  marginrequired 32
  freezelevel 33)

(<span style="color: #da70d6;">comment</span>
  (<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">demo?</span> []
    (<span style="color: #a020f0;">if</span> (<span style="color: #da70d6;">re-find</span> #<span style="color: #bc8f8f;">"(?i)demo"</span> (account-server))
      true
      false)))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">sell?</span> [{type <span style="color: #da70d6;">:type</span>}]
  (<span style="color: #a020f0;">or</span> (<span style="color: #da70d6;">=</span> type <span style="color: #da70d6;">:sell</span>) (<span style="color: #da70d6;">=</span> type <span style="color: #da70d6;">:sell-stop</span>) (<span style="color: #da70d6;">=</span> type <span style="color: #da70d6;">:sell-limit</span>)))
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">buy?</span> [{type <span style="color: #da70d6;">:type</span>}]
  (<span style="color: #a020f0;">or</span> (<span style="color: #da70d6;">=</span> type <span style="color: #da70d6;">:buy</span>) (<span style="color: #da70d6;">=</span> type <span style="color: #da70d6;">:buy-stop</span>) (<span style="color: #da70d6;">=</span> type <span style="color: #da70d6;">:buy-limit</span>)))
(<span style="color: #a020f0;">defn-</span> <span style="color: #0000ff;">to-big</span> [num] (BigDecimal/valueOf (<span style="color: #a020f0;">if</span> (<span style="color: #da70d6;">integer?</span> num) (<span style="color: #da70d6;">double</span> num) num)))
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">lot</span> 
  ([num] (lot num (env <span style="color: #da70d6;">:symbol</span>)))
  ([num symbol]
     (<span style="color: #da70d6;">double</span> (<span style="color: #a020f0;">let</span> [a (to-big num)  
                   b (to-big (mode-minlot symbol))]
               (<span style="color: #da70d6;">*</span> b (.intValue (<span style="color: #da70d6;">/</span> a b)))))))

(<span style="color: #a020f0;">defn-</span> <span style="color: #0000ff;">assert-order</span> [order] (is? [(<span style="color: #a020f0;">or</span> (sell? order) (buy? order))]))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">o--</span> [o &amp; args]
  (assert-order o)
  (<span style="color: #a020f0;">if</span> (sell? o) (<span style="color: #da70d6;">-</span> (<span style="color: #da70d6;">apply</span> - args)) (<span style="color: #da70d6;">apply</span> - args)))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">o+</span> [o &amp; args]
  (assert-order o) 
  (<span style="color: #a020f0;">if</span> (sell? o) (<span style="color: #da70d6;">apply</span> - args) (<span style="color: #da70d6;">apply</span> + args)))
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">o-</span> [o &amp; args]
  (assert-order o)
  (<span style="color: #a020f0;">if</span> (sell? o) (<span style="color: #da70d6;">apply</span> + args) (<span style="color: #da70d6;">apply</span> - args)))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">omax</span> [order &amp; args]
  (assert-order order)
  (<span style="color: #a020f0;">let</span> [args (<span style="color: #da70d6;">filter</span> #(<span style="color: #da70d6;">not</span> (zero? %)) args)]
    (<span style="color: #a020f0;">if</span> (<span style="color: #da70d6;">empty?</span> args)
      (<span style="color: #a020f0;">or</span> (<span style="color: #da70d6;">:sl</span> order) 0) 
      (<span style="color: #da70d6;">apply</span> (<span style="color: #a020f0;">if</span> (buy? order) max min) args))))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">omin</span> [order &amp; args]
  (assert-order order)
  (<span style="color: #a020f0;">let</span> [args (<span style="color: #da70d6;">filter</span> #(<span style="color: #da70d6;">not</span> (zero? %)) args)]
    (<span style="color: #a020f0;">if</span> (<span style="color: #da70d6;">empty?</span> args)
      (<span style="color: #a020f0;">or</span> (<span style="color: #da70d6;">:sl</span> order) 0) 
      (<span style="color: #da70d6;">apply</span> (<span style="color: #a020f0;">if</span> (buy? order) min max)
             args))))


<span style="color: #b22222;">;;</span><span style="color: #b22222;">TODO: change for 4 digit broker
</span>(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">digits</span> []
  (mode-digits <span style="color: #bc8f8f;">"EURUSD"</span>))

<span style="color: #b22222;">;;</span><span style="color: #b22222;">TODO: check for valid symbol on all of this??
</span>(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">spread</span>
  ([] (spread (env <span style="color: #da70d6;">:symbol</span>)))
  ([symbol]
     (<span style="color: #a020f0;">let</span> [d (digits) spread (mode-spread symbol)]
       (<span style="color: #a020f0;">cond</span>
        (<span style="color: #da70d6;">=</span> d 5) (<span style="color: #da70d6;">/</span> spread 10)
        (<span style="color: #da70d6;">=</span> d 4) spread))))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">point</span>
  ([pt] (<span style="color: #da70d6;">/</span> pt (point)))
  ([]
     (<span style="color: #a020f0;">let</span> [d (digits)]  
       (<span style="color: #a020f0;">if</span> (<span style="color: #da70d6;">=</span> d 5)
         (<span style="color: #da70d6;">*</span> 10 (mode-point))
         (mode-point)))))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">pip</span> [pt] (<span style="color: #da70d6;">*</span> (point) pt))
</pre></div>




<div class="org-src-container"><label class="org-src-name">account-common()</label><pre class="src src-clojure">
<span style="color: #b22222;">;;</span><span style="color: #b22222;">TODO: unit test everything
</span><span style="color: #b22222;">;;</span><span style="color: #b22222;">TODO: create a new atom-hash on merging, etc????????
</span>(clojure.core/<span style="color: #da70d6;">use</span> 'nstools.ns)
(ns+ forex.module.account
     (<span style="color: #da70d6;">:clone</span> clj.core)
     (<span style="color: #da70d6;">:require</span> forex.backend.mql.socket-service)
    <span style="color: #b22222;">;; </span><span style="color: #b22222;">(:import forex.backend.mql.socket-service.MqlError)
</span>     (<span style="color: #da70d6;">:use</span> forex.util.core
           forex.util.emacs  
           forex.util.general forex.util.log
           forex.module.indicator
           forex.module.error forex.module.account.utils)

     (<span style="color: #da70d6;">:require</span>  [forex.module.account.core <span style="color: #da70d6;">:as</span> core]))

(<span style="color: #a020f0;">defvar</span> <span style="color: #0000ff;">*account-warn-on-mql-error*</span> true)

(<span style="color: #a020f0;">defn-</span> <span style="color: #0000ff;">account-warn</span>
  ([err order] (account-warn err order <span style="color: #bc8f8f;">""</span>))
  ([err order msg &amp; args]
     (<span style="color: #a020f0;">if</span> *account-warn-on-mql-error* 
       (<span style="color: #a020f0;">do</span> (warn <span style="color: #bc8f8f;">"MQL error %s on order %s - %s"</span> (<span style="color: #da70d6;">:e</span> err)
                 order (<span style="color: #da70d6;">apply</span> format msg args)) err)
       err)))
(<span style="color: #a020f0;">defmacro-</span> <span style="color: #0000ff;">with-order</span> [order &amp; body]
  `(<span style="color: #a020f0;">let</span> [o# ~order]
     (<span style="color: #a020f0;">if-not</span> (<span style="color: #da70d6;">=</span> (<span style="color: #da70d6;">:lots</span> o#) 0)
       (<span style="color: #a020f0;">do</span> ~@body)
       (<span style="color: #a020f0;">do</span> (warn <span style="color: #bc8f8f;">"attempting to change order %s with zero lots"</span> o#)
           o#)))) 

(<span style="color: #a020f0;">defn-</span> <span style="color: #0000ff;">&gt;?</span> [a] (<span style="color: #a020f0;">and</span> (<span style="color: #da70d6;">number?</span> a) (<span style="color: #da70d6;">&gt;=</span> a 0)))

(<span style="color: #da70d6;">comment</span>
  (<span style="color: #a020f0;">defmacro-</span> <span style="color: #0000ff;">default</span> [&amp; body] 
    `(<span style="color: #a020f0;">binding</span> [*default* @~#'err/*er*]
       ~@body)))

<span style="color: #b22222;">;;</span><span style="color: #b22222;">TODO: do we need all of these assertions?
</span>(<span style="color: #a020f0;">def-</span> <span style="color: #0000ff;">value-to-order-type</span>
  {0 <span style="color: #da70d6;">:buy</span> 1 <span style="color: #da70d6;">:sell</span> 2 <span style="color: #da70d6;">:buy-limit</span>
   3 <span style="color: #da70d6;">:sell-limit</span> 4 <span style="color: #da70d6;">:buy-stop</span>
   5 <span style="color: #da70d6;">:sell-stop</span>}) 

(<span style="color: #a020f0;">defprotocol</span> <span style="color: #0000ff;">POrder</span>
  (order-close-time [this])
  (order-type [this])
  (delete! [this] )
  (close! [this] [this new-lots])
  (modify! [this sl-tp-map])
  (order! [this])
  (open? [this]) (close? [this])
  (order? [this]) 
  (market? [this]) (entry? [this]))

(<span style="color: #a020f0;">defn-</span> <span style="color: #0000ff;">order-close-time*</span> [{id <span style="color: #da70d6;">:id</span>}]
  {<span style="color: #da70d6;">:pre</span> [(<span style="color: #da70d6;">string?</span> (<span style="color: #da70d6;">first</span> id))]}
  <span style="color: #b22222;">;;</span><span style="color: #b22222;">we dont need to know mql4 error codes for order close time
</span>  (aif (core/order-close-time id) it -1)) <span style="color: #b22222;">;;</span><span style="color: #b22222;">TODO: return 0 instead?
</span>(<span style="color: #a020f0;">defn-</span> <span style="color: #0000ff;">order-type*</span>  [{id <span style="color: #da70d6;">:id</span>}] 
  {<span style="color: #da70d6;">:pre</span> [(<span style="color: #da70d6;">string?</span> (<span style="color: #da70d6;">first</span> id))]}
  (aif (core/order-type id)
       (value-to-order-type (<span style="color: #da70d6;">int</span> it))))
(<span style="color: #a020f0;">defn-</span> <span style="color: #0000ff;">delete!*</span> [{id <span style="color: #da70d6;">:id</span> lots <span style="color: #da70d6;">:lots</span> <span style="color: #da70d6;">:as</span> o}]
  (with-order o
    (<span style="color: #a020f0;">if-not</span> (<span style="color: #da70d6;">=</span> lots 0)
      (aif (core/order-delete id) (<span style="color: #da70d6;">merge</span> o {<span style="color: #da70d6;">:lots</span> 0}) it)
      o)))

<span style="color: #b22222;">;;</span><span style="color: #b22222;">TOOD: make more robust? does metatrader always append modified trade? is it thread safe?
</span>(<span style="color: #a020f0;">defn-</span> <span style="color: #0000ff;">close!*</span>
  ([o] (close! o 0))
  ([{<span style="color: #da70d6;">:keys</span> [price lots slip id symbol] <span style="color: #da70d6;">:as</span> order} new-lots]
     (with-order order
       (is? [(<span style="color: #da70d6;">string?</span> (<span style="color: #da70d6;">first</span> id)) (<span style="color: #da70d6;">string?</span> symbol) 
             [price (<span style="color: #da70d6;">pos?</span> price)]
             [(<span style="color: #da70d6;">number?</span> lots) (<span style="color: #da70d6;">&gt;=</span> lots 0)]])
       (is? (<span style="color: #da70d6;">&gt;=</span> (<span style="color: #da70d6;">-</span> lots new-lots) 0))
       (<span style="color: #a020f0;">if-not</span> (<span style="color: #da70d6;">=</span> new-lots lots)
         (aif (core/order-close id (<span style="color: #da70d6;">-</span> lots new-lots)
                                (<span style="color: #a020f0;">if</span> (sell? order)
                                  (ask symbol)
                                  (bid symbol))
                                slip <span style="color: #da70d6;">:blue</span>)
              (<span style="color: #da70d6;">merge</span> order {<span style="color: #da70d6;">:lots</span> new-lots 
                            <span style="color: #da70d6;">:id</span> (<span style="color: #a020f0;">cond</span>
                                 (<span style="color: #da70d6;">=</span> new-lots 0) id 
                                 (<span style="color: #da70d6;">=</span> it false)
                                 (<span style="color: #a020f0;">do</span> (severe <span style="color: #bc8f8f;">"dropping a partial close id for order %s"</span>
                                             (<span style="color: #da70d6;">merge</span> order {<span style="color: #da70d6;">:lots</span> new-lots}))
                                     id) 
                                 true  (<span style="color: #da70d6;">concat</span> (<span style="color: #da70d6;">list</span> it) id))})
              (account-warn it order <span style="color: #bc8f8f;">"invalid new lots %s"</span> new-lots))
         order)))) 

<span style="color: #b22222;">;;</span><span style="color: #b22222;">TODO: normalize so we dont get mql error 1?
</span><span style="color: #b22222;">;;</span><span style="color: #b22222;">TODO: act as a regular modify if we dont pass in sl,tp,or price 
</span>(<span style="color: #a020f0;">defn-</span> <span style="color: #0000ff;">modify!*</span> [order {<span style="color: #da70d6;">:keys</span> [sl tp] <span style="color: #da70d6;">:as</span> mod}]
  (with-order order
    (<span style="color: #a020f0;">let</span> [sl (<span style="color: #a020f0;">or</span> sl (<span style="color: #da70d6;">:sl</span> order))
          tp (<span style="color: #a020f0;">or</span> tp (<span style="color: #da70d6;">:tp</span> order)) 
          price (<span style="color: #da70d6;">:price</span> order)] 
      (<span style="color: #a020f0;">if</span> (<span style="color: #a020f0;">or</span> (<span style="color: #da70d6;">number?</span> sl) (<span style="color: #da70d6;">number?</span> tp))
        (<span style="color: #a020f0;">do</span>  
          (is? [sl tp price (&gt;? sl) (&gt;? tp) (<span style="color: #da70d6;">pos?</span> price)]) 
          (<span style="color: #a020f0;">if-not</span> (<span style="color: #a020f0;">and</span> (<span style="color: #da70d6;">=</span> sl (<span style="color: #da70d6;">:sl</span> order))
                       (<span style="color: #da70d6;">=</span> tp (<span style="color: #da70d6;">:tp</span> order)))
            (aif (core/order-modify (<span style="color: #da70d6;">:id</span> order) (<span style="color: #da70d6;">:price</span> order) sl tp)
                 (<span style="color: #da70d6;">merge</span> order (<span style="color: #da70d6;">merge</span> mod {<span style="color: #da70d6;">:sl</span> sl <span style="color: #da70d6;">:tp</span> tp}))
                 (<span style="color: #a020f0;">if</span> (<span style="color: #da70d6;">=</span> (<span style="color: #da70d6;">:e</span> it) 1)
                   (<span style="color: #da70d6;">merge</span> order mod)
                   (account-warn it order <span style="color: #bc8f8f;">"sl %s tp %s"</span> sl tp)))
            (<span style="color: #da70d6;">merge</span> order mod)))
        (<span style="color: #da70d6;">merge</span> order mod)))))   

<span style="color: #b22222;">;;</span><span style="color: #b22222;">TOODOs: how do we get map with defaults?
</span>(<span style="color: #a020f0;">defn-</span> <span style="color: #0000ff;">verify-order</span> [{<span style="color: #da70d6;">:keys</span> [slip symbol type price tp sl lots]
                      <span style="color: #da70d6;">:or</span> {slip 3 sl 0 tp 0}}]
  (is? [(<span style="color: #da70d6;">number?</span> slip) (<span style="color: #da70d6;">&gt;</span> slip 0) (<span style="color: #da70d6;">integer?</span> slip)]
       <span style="color: #bc8f8f;">"invalid order slip %s"</span> slip)
  (is? [ (<span style="color: #da70d6;">keyword?</span> type) (<span style="color: #da70d6;">number?</span> lots)
         (<span style="color: #da70d6;">number?</span> tp) (<span style="color: #da70d6;">number?</span> sl) (<span style="color: #da70d6;">number?</span> price)]) 
  (is? [ (<span style="color: #da70d6;">string?</span> symbol) (<span style="color: #da70d6;">&gt;</span> lots 0)
         (<span style="color: #da70d6;">&gt;=</span> tp 0) (<span style="color: #da70d6;">&gt;=</span> sl 0) (<span style="color: #da70d6;">&gt;=</span> price 0)])  
  (<span style="color: #a020f0;">cond</span>
   (<span style="color: #a020f0;">or</span> (<span style="color: #da70d6;">=</span> type <span style="color: #da70d6;">:sell</span>) (<span style="color: #da70d6;">=</span> type <span style="color: #da70d6;">:sell-limit</span>) (<span style="color: #da70d6;">=</span> type <span style="color: #da70d6;">:sell-stop</span>))
   (is? (<span style="color: #a020f0;">or</span> (<span style="color: #a020f0;">and</span> (zero? sl) (zero? tp))
            (<span style="color: #a020f0;">and</span> (zero? sl) tp (<span style="color: #da70d6;">&lt;</span> tp price))
            (<span style="color: #a020f0;">and</span> (zero? tp) sl (<span style="color: #da70d6;">&gt;</span> sl price))
            (<span style="color: #a020f0;">and</span> (<span style="color: #da70d6;">&lt;</span> tp sl) (<span style="color: #da70d6;">&lt;</span> tp price) (<span style="color: #da70d6;">&gt;</span> sl price)))
        <span style="color: #bc8f8f;">"invalid %s order with sl/tp %s/%s with price of %s"</span> type sl tp price)
   (<span style="color: #a020f0;">or</span> (<span style="color: #da70d6;">=</span> type <span style="color: #da70d6;">:buy</span>) (<span style="color: #da70d6;">=</span> type <span style="color: #da70d6;">:buy-limit</span>) (<span style="color: #da70d6;">=</span> type <span style="color: #da70d6;">:buy-stop</span>))
   (is? (<span style="color: #a020f0;">or</span> (<span style="color: #a020f0;">and</span> (zero? sl) (zero? tp))
            (<span style="color: #a020f0;">and</span> (zero? sl) tp (<span style="color: #da70d6;">&gt;</span> tp price))
            (<span style="color: #a020f0;">and</span> (zero? tp) sl (<span style="color: #da70d6;">&lt;</span> sl price))
            (<span style="color: #a020f0;">and</span> (<span style="color: #da70d6;">&gt;</span> tp sl) (<span style="color: #da70d6;">&gt;</span> tp price) (<span style="color: #da70d6;">&lt;</span> sl price)))
        <span style="color: #bc8f8f;">"invalid %s order with sl/tp %s/%s with price of %s"</span> type sl tp price)
   true (throwf <span style="color: #bc8f8f;">"invalid %s order with sl/tp %s/%s with price of %s"</span>
                type sl tp price))) 
<span style="color: #b22222;">;;</span><span style="color: #b22222;">TODO: change to make reliable and to work for ECN brokers and such
</span><span style="color: #b22222;">;;</span><span style="color: #b22222;">see http://forum.mql4.com/36608
</span><span style="color: #b22222;">;;</span><span style="color: #b22222;">TODO: what happens if second modify fails? how can programmer find this out?
</span>
(<span style="color: #a020f0;">defn-</span> <span style="color: #0000ff;">order!*</span> [{<span style="color: #da70d6;">:keys</span> [symbol type price tp sl lots slip]
                 <span style="color: #da70d6;">:as</span> order
                 <span style="color: #da70d6;">:or</span> { symbol (env <span style="color: #da70d6;">:symbol</span>) sl 0 tp 0 slip 3}}]
  (<span style="color: #a020f0;">let</span> [price (<span style="color: #a020f0;">or</span> price (<span style="color: #a020f0;">if</span> (sell? order) (bid symbol) (ask symbol)))
        order (<span style="color: #da70d6;">merge</span> 
               {<span style="color: #da70d6;">:symbol</span> symbol
                <span style="color: #da70d6;">:slip</span> slip}
               (<span style="color: #da70d6;">merge</span> order {<span style="color: #da70d6;">:sl</span> 0 <span style="color: #da70d6;">:tp</span> 0 <span style="color: #da70d6;">:id</span> <span style="color: #bc8f8f;">""</span> <span style="color: #da70d6;">:price</span> price}))]
    (with-order order    
      (verify-order order)
      (aif (core/order-send symbol type lots price 0 0 slip)
           (<span style="color: #a020f0;">let</span> [result
                 (<span style="color: #a020f0;">let</span> [o (<span style="color: #da70d6;">merge</span> order {<span style="color: #da70d6;">:id</span> [it]})]
                   <span style="color: #b22222;">;;</span><span style="color: #b22222;">now, use modify to change sl and tp
</span>                   (aif (modify!* o {<span style="color: #da70d6;">:sl</span> sl <span style="color: #da70d6;">:tp</span> tp})
                        (<span style="color: #da70d6;">merge</span> o {<span style="color: #da70d6;">:sl</span> sl <span style="color: #da70d6;">:tp</span> tp})
                        o))
                 spread (spread)]
             (<span style="color: #da70d6;">merge</span> result {<span style="color: #da70d6;">:spread</span> spread <span style="color: #da70d6;">:break</span> (o+ result price (pip spread))})) 
           (account-warn it order))))) 

(<span style="color: #a020f0;">defn-</span> <span style="color: #0000ff;">open?*</span> [order] 
  (<span style="color: #da70d6;">=</span> (order-close-time order) 0))
(<span style="color: #a020f0;">defn-</span> <span style="color: #0000ff;">close?*</span> [order]
  (<span style="color: #da70d6;">not</span> (open? order)))
(<span style="color: #a020f0;">defn-</span> <span style="color: #0000ff;">order?*</span> [order]
  (<span style="color: #da70d6;">not</span> (<span style="color: #da70d6;">nil?</span> (order-type order))))   
(<span style="color: #a020f0;">defn-</span> <span style="color: #0000ff;">market?*</span>
  <span style="color: #bc8f8f;">"determine if order is market order"</span>
  [order]
  (<span style="color: #a020f0;">let</span> [type (order-type order)]
    (<span style="color: #a020f0;">or</span> (<span style="color: #da70d6;">=</span> type <span style="color: #da70d6;">:sell</span>) (<span style="color: #da70d6;">=</span> type <span style="color: #da70d6;">:buy</span>)))) 
(<span style="color: #a020f0;">defn-</span> <span style="color: #0000ff;">entry?*</span>
  <span style="color: #bc8f8f;">"determine if order is entry order"</span>
  [order]
  (<span style="color: #a020f0;">let</span> [type (order-type order)]
    (<span style="color: #a020f0;">and</span> type (<span style="color: #da70d6;">not</span> (<span style="color: #a020f0;">or</span> (<span style="color: #da70d6;">=</span> type <span style="color: #da70d6;">:sell</span>) (<span style="color: #da70d6;">=</span> type <span style="color: #da70d6;">:buy</span>))))))

(<span style="color: #da70d6;">extend</span> clojure.lang.IPersistentMap
  POrder {<span style="color: #da70d6;">:order-close-time</span> order-close-time*
          <span style="color: #da70d6;">:order-type</span> order-type*
          <span style="color: #da70d6;">:delete!</span> delete!*
          <span style="color: #da70d6;">:close!</span> close!*
          <span style="color: #da70d6;">:modify!</span> modify!*
          <span style="color: #da70d6;">:order!</span> order!*

          <span style="color: #da70d6;">:open?</span> open?*
          <span style="color: #da70d6;">:close?</span> close?*
          <span style="color: #da70d6;">:order?</span> order?*
          <span style="color: #da70d6;">:market?</span> market?*
          <span style="color: #da70d6;">:entry?</span> entry?*})

(<span style="color: #da70d6;">extend-type</span> forex.backend.mql.socket-service.MqlError
  POrder
  (order! [this] this)
  (delete! [this] this)
  (close! [this] this)
  (close! [this _] this)
  (modify! [this] this))

(<span style="color: #da70d6;">extend-type</span> forex.util.core.AtomHash <span style="color: #b22222;">;;</span><span style="color: #b22222;">clojure.lang.Atom
</span>  POrder
  (order-close-time [this] (order-close-time @this))
  (order-type [this] (order-type @this))
  (order! [this] (aif (order! @this)
                      (<span style="color: #a020f0;">do</span> (<span style="color: #da70d6;">reset!</span> (.val this) it) this)
                      it))
  (delete! [this] (aif (delete! @this) (<span style="color: #a020f0;">do</span> (<span style="color: #da70d6;">reset!</span> (.val this) it) this) it))  
  (close!
   ([this new-amount] (aif (close! @this new-amount) (<span style="color: #a020f0;">do</span> (<span style="color: #da70d6;">reset!</span> (.val this) it) this) it))
   ([this] (close! this 0)))
  (modify! [this sl-tp] (aif (modify! @this sl-tp) (<span style="color: #a020f0;">do</span> (<span style="color: #da70d6;">reset!</span> (.val this) it) this) it))
  (open? [this] (open? @this))
  (close? [this] (<span style="color: #da70d6;">not</span> (open? @this)))
  (order? [this] (order? @this))
  (market? [this] (market? @this))
  (entry? [this] (entry? @this)))
</pre></div>


</div>

</div>
