clj-forex.html

<div id="outline-container-4_4_2" class="outline-4">
<h4 id="sec-4_4_2"><span class="section-number-4">4.4.2</span> Ea </h4>
<div class="outline-text-4" id="text-4_4_2">




<div class="org-src-container"><label class="org-src-name">ea-common()</label><pre class="src src-clojure">
<span style="color: #b22222;">;;</span><span style="color: #b22222;">TODO: it would be awesome if we could directly modify vars of an ea. but we cant, we can only stop , merge, start. TOOD: lookup how set! works!
</span>
(clojure.core/<span style="color: #da70d6;">use</span> 'nstools.ns)
(ns+ forex.module.ea 
     (<span style="color: #da70d6;">:clone</span> clj.core) 
     (<span style="color: #da70d6;">:use</span> forex.util.core
           forex.util.general 
           forex.util.spawn forex.util.emacs
           clojure.contrib.core)
     (<span style="color: #da70d6;">:import</span> clojure.lang.Atom)
     (<span style="color: #da70d6;">:require</span> [clj-time.core <span style="color: #da70d6;">:as</span> t])
     (<span style="color: #da70d6;">:use</span>  
      forex.util.emacs
      forex.util.log  
      forex.module.error 
      forex.module.indicator 
      forex.module.account)
     (<span style="color: #da70d6;">:import</span> forex.util.core.AtomHash  java.util.concurrent.TimeUnit))
(<span style="color: #a020f0;">defvar</span> <span style="color: #0000ff;">save-file</span> nil) 
(<span style="color: #a020f0;">defvar</span> <span style="color: #0000ff;">ea-on-exit-hook</span>)
(<span style="color: #a020f0;">defvar</span> <span style="color: #0000ff;">ea-on-start-hook</span>)
(<span style="color: #a020f0;">defonce</span> <span style="color: #0000ff;">*ea-registry*</span> (<span style="color: #da70d6;">atom</span> []))
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">register-ea</span> []
  (<span style="color: #da70d6;">swap!</span> *ea-registry*
         (<span style="color: #da70d6;">fn</span> [old]
           (<span style="color: #da70d6;">filter</span> #(<span style="color: #da70d6;">find-ns</span> (<span style="color: #da70d6;">symbol</span> %))
                   (<span style="color: #a020f0;">if</span> (<span style="color: #da70d6;">some</span> #(<span style="color: #da70d6;">=</span> % (<span style="color: #da70d6;">str</span> *ns*)) old)
                     old
                     (<span style="color: #da70d6;">conj</span> old (<span style="color: #da70d6;">str</span> *ns*)))))))

<span style="color: #b22222;">;;</span><span style="color: #b22222;">saving objects to strings and going back -slow, but it works
</span>(<span style="color: #a020f0;">import</span> (java.io ByteArrayOutputStream ObjectOutputStream
                 ByteArrayInputStream ObjectInputStream)
        org.apache.commons.codec.binary.Base64)
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">bytes-to-obj</span>
  <span style="color: #bc8f8f;">"convert bytes to object"</span>
  [obj]
  (.readObject
   (ObjectInputStream.
    (ByteArrayInputStream. obj))))
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">obj-to-bytes</span>
   <span style="color: #bc8f8f;">"convert object to bytes"</span>
   [obj]
   (<span style="color: #a020f0;">with-open</span> [bos (ByteArrayOutputStream.)
               stream (ObjectOutputStream. bos)]
     (.writeObject stream obj)
     (.flush stream) 
     (.toByteArray bos))) 
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">encode</span> [o]
  (Base64/encodeBase64String (obj-to-bytes o)))
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">decode</span> [o]
  (bytes-to-obj (Base64/decodeBase64 o)))
(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">print-dup</span> <span style="color: #da70d6;">:default</span> [o w]
  (.write w (<span style="color: #da70d6;">str</span> <span style="color: #bc8f8f;">"#=(forex.module.ea/decode \""</span> (encode o) <span style="color: #bc8f8f;">"\")"</span>)))  
<span style="color: #b22222;">;;;;;;;;;;;;;;;;;</span><span style="color: #b22222;">
</span><span style="color: #b22222;">;;;;;;;;;;;;;;;;;;</span><span style="color: #b22222;">
</span><span style="color: #b22222;">;;;;;;;;;;;;;;;;;;;; </span><span style="color: #b22222;">
</span>

(<span style="color: #a020f0;">defn-</span> <span style="color: #0000ff;">get-fn</span> [a] (<span style="color: #a020f0;">if</span> (<span style="color: #da70d6;">var?</span> a) (<span style="color: #da70d6;">var-get</span> a) a)) 
(<span style="color: #a020f0;">defonce</span> <span style="color: #0000ff;">*ea*</span> nil)
(<span style="color: #a020f0;">defonce</span> <span style="color: #0000ff;">*args*</span> nil) 
(<span style="color: #a020f0;">defmacro</span> <span style="color: #0000ff;">with-ea</span> [[ea &amp; name] &amp; body]
  `(<span style="color: #a020f0;">let</span> [ea# ~ea]
     (debugging (<span style="color: #da70d6;">format</span> <span style="color: #bc8f8f;">"%s %s:"</span> ~(<span style="color: #a020f0;">or</span> (<span style="color: #da70d6;">first</span> name) <span style="color: #bc8f8f;">""</span>) (<span style="color: #da70d6;">:name</span> ea#))
                (<span style="color: #a020f0;">binding</span> [*ea* ea# *args* (<span style="color: #da70d6;">:args</span> ea#)]
                  (wenv {<span style="color: #da70d6;">:symbol</span> (<span style="color: #da70d6;">:symbol</span> ea#) <span style="color: #da70d6;">:period</span> (<span style="color: #da70d6;">:period</span> ea#)}
                        ~@body)))))
(<span style="color: #a020f0;">defmacro</span> <span style="color: #0000ff;">locking-read</span>[lock &amp; body]
  `(<span style="color: #a020f0;">let</span> [l# (.readLock ~lock)]
     (<span style="color: #a020f0;">try</span> (<span style="color: #a020f0;">do</span> (.lock l#) ~@body)
          (<span style="color: #a020f0;">finally</span> (.unlock l#)))))
<span style="color: #b22222;">;;</span><span style="color: #b22222;">TODO: for some reason, write lock never can lock
</span>(<span style="color: #a020f0;">defmacro</span> <span style="color: #0000ff;">locking-write</span> [lock &amp; body]
  `(<span style="color: #a020f0;">let</span> [l# (.writeLock ~lock)]
     (<span style="color: #a020f0;">try</span> (<span style="color: #a020f0;">do</span> (.lock l#) ~@body)
          (<span style="color: #a020f0;">finally</span> (.unlock l#)))))
(<span style="color: #a020f0;">defmacro</span> <span style="color: #0000ff;">locking-write-timeout</span> [[ lock timeout] &amp; body]
  `(<span style="color: #a020f0;">let</span> [l# (.writeLock ~lock)]
     (<span style="color: #a020f0;">if</span> (.tryLock l# ~timeout TimeUnit/MILLISECONDS)
       (<span style="color: #a020f0;">try</span> (<span style="color: #a020f0;">do</span>  ~@body)
            (<span style="color: #a020f0;">finally</span> (.unlock l#))))))


(deferror *ea-stop* [*clj-forex-error*] [message]
  {<span style="color: #da70d6;">:msg</span> (<span style="color: #da70d6;">str</span> <span style="color: #bc8f8f;">"ea stop: "</span> message)})


(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">exit</span>
  ([msg] (raise *ea-stop* msg))
  ([msg &amp; args] (raise *ea-stop* (<span style="color: #a020f0;">if</span> (<span style="color: #da70d6;">string?</span> msg)
                                   (<span style="color: #da70d6;">apply</span> format msg args)
                                   (<span style="color: #da70d6;">concat</span> [msg] args)))))



<span style="color: #b22222;">;;</span><span style="color: #b22222;">TODO: do we really want to copy these objects? yes, in most cases perhaps
</span><span style="color: #b22222;">;;</span><span style="color: #b22222;">but we should add an option to the ea definition (we will do that later, before first release)
</span>(<span style="color: #a020f0;">defmulti</span> <span style="color: #0000ff;">copy-ea-obj</span> class)
(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">copy-ea-obj</span> <span style="color: #da70d6;">:default</span> [o] o)
(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">copy-ea-obj</span> clojure.lang.Atom [o] (<span style="color: #da70d6;">atom</span> (copy-ea-obj @o)))
(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">copy-ea-obj</span> clojure.lang.Ref [o] (<span style="color: #da70d6;">ref</span> (copy-ea-obj @o)))
(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">copy-ea-obj</span> forex.util.core.AtomHash [o] (atom-hash (copy-ea-obj @o)))

(<span style="color: #a020f0;">defn-</span> <span style="color: #0000ff;">copy-ea-objs</span> [map]
  (<span style="color: #da70d6;">apply</span> hash-map
         (<span style="color: #da70d6;">mapcat</span> (<span style="color: #da70d6;">fn</span> [[key val]]
                   (<span style="color: #da70d6;">list</span> key (copy-ea-obj val)))
                 map)))

<span style="color: #b22222;">;;</span><span style="color: #b22222;">##ea implementation
</span>(<span style="color: #a020f0;">defonce</span> <span style="color: #0000ff;">*eas*</span> (<span style="color: #da70d6;">atom</span> []))
(<span style="color: #a020f0;">import</span> java.util.concurrent.locks.ReentrantReadWriteLock)
<span style="color: #b22222;">;;</span><span style="color: #b22222;">TODO: lock orphaning
</span>(<span style="color: #a020f0;">defonce</span> <span style="color: #0000ff;">*ea-pre-lock*</span>
  (java.util.concurrent.locks.ReentrantReadWriteLock. true))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">every</span> [pred coll]
  (<span style="color: #a020f0;">if</span> (<span style="color: #da70d6;">empty?</span> coll)
    false
    (<span style="color: #a020f0;">loop</span> [a coll]
      (<span style="color: #a020f0;">if</span> (<span style="color: #da70d6;">empty?</span> a)
        true
        (<span style="color: #a020f0;">if</span> (<span style="color: #da70d6;">not</span> (pred (<span style="color: #da70d6;">first</span> a)))
          false
          (<span style="color: #a020f0;">recur</span> (<span style="color: #da70d6;">rest</span> a)))))))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">query</span> [m]
  (<span style="color: #a020f0;">let</span> [a (<span style="color: #da70d6;">filter</span>
           (<span style="color: #da70d6;">fn</span> [ea]
             (<span style="color: #a020f0;">if</span> (every (<span style="color: #da70d6;">fn</span> [[key val]]
                          (<span style="color: #da70d6;">=</span> val (<span style="color: #da70d6;">get</span> ea key)))
                        m) 
               ea))
           @*eas*)]
    (<span style="color: #a020f0;">if</span> (<span style="color: #da70d6;">=</span> (<span style="color: #da70d6;">count</span> a) 1) (<span style="color: #da70d6;">first</span> a) a)))
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">alive?</span> [ea] (pid? (<span style="color: #da70d6;">:pid</span> ea)))

(<span style="color: #a020f0;">defmacro-</span> <span style="color: #0000ff;">catch-unexpected</span> [prefix &amp; body]
  `(<span style="color: #a020f0;">try</span> (<span style="color: #a020f0;">do</span> ~@body)
        (<span style="color: #a020f0;">catch</span> Exception e#
          (severe <span style="color: #bc8f8f;">"%s - caught unexpected error %s"</span> ~prefix e#))))


(<span style="color: #da70d6;">require</span> 'clojure.contrib.error-kit)
<span style="color: #b22222;">;;</span><span style="color: #b22222;">TODO; how to create unbound var for error-kit???
</span>(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">ping</span> [a] (! (<span style="color: #da70d6;">:pid</span> a) <span style="color: #bc8f8f;">"PING"</span>))
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">ping-all</span> [] (<span style="color: #a020f0;">doall</span> (<span style="color: #da70d6;">map</span> ping @*eas*)))
<span style="color: #b22222;">;;</span><span style="color: #b22222;">TODO: we need a monitor which pings and then sets something.... like in erlang
</span>
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">run-by-tick</span> [{<span style="color: #da70d6;">:keys</span> [deinit init start] <span style="color: #da70d6;">:as</span> ea}]
  (with-ea [ea]   
    (<span style="color: #a020f0;">try</span>
      (run-hooks ea-on-start-hook)
      (clojure.contrib.error-kit/with-handler
        (<span style="color: #a020f0;">loop</span> [prev-close nil]
          (sleep 1) 
          (<span style="color: #a020f0;">when-not</span>
              (match (? 0) 
                     <span style="color: #bc8f8f;">"STOP"</span> true
                     <span style="color: #bc8f8f;">"PING"</span> (<span style="color: #a020f0;">do</span> (out <span style="color: #bc8f8f;">"ping"</span>) nil)) 
            (<span style="color: #a020f0;">let</span> [new-close (close)]  
              (<span style="color: #a020f0;">when-not</span> (<span style="color: #da70d6;">=</span> new-close prev-close)
                (<span style="color: #a020f0;">let</span> [func (get-fn start)]
                  (<span style="color: #a020f0;">if</span> (<span style="color: #da70d6;">fn?</span> func)
                    (locking-read *ea-pre-lock*
                                  (func (<span style="color: #da70d6;">:args</span> ea)))
                    (warn <span style="color: #bc8f8f;">"%s is not a function. start cannot be called"</span> func))))
              (<span style="color: #a020f0;">recur</span> new-close))))
        (clojure.contrib.error-kit/handle *ea-stop* [message] (out <span style="color: #bc8f8f;">"stopping ea ... %s"</span> message)))  
      (<span style="color: #a020f0;">catch</span> Exception e 
        (severe <span style="color: #bc8f8f;">"stopping ea... caught exception %s"</span> e)
        (<span style="color: #da70d6;">reset!</span> (<span style="color: #da70d6;">:exit</span> ea) e)
        (.printStackTrace e))
      (<span style="color: #a020f0;">finally</span>
       (<span style="color: #a020f0;">when-not</span> @(<span style="color: #da70d6;">:exit</span> ea) (<span style="color: #da70d6;">reset!</span> (<span style="color: #da70d6;">:exit</span> ea) true))
       (info <span style="color: #bc8f8f;">"running deinit ..."</span>)
       (catch-unexpected
        <span style="color: #bc8f8f;">"deinit"</span> 
        (<span style="color: #a020f0;">let</span> [de (get-fn deinit)]
          (<span style="color: #a020f0;">if</span> (<span style="color: #da70d6;">fn?</span> de)
            (de)
            (warn <span style="color: #bc8f8f;">"deinit %s is not a function. ignoring ...."</span> de))))))
    (run-hooks ea-on-exit-hook)))

(<span style="color: #a020f0;">defn-</span> <span style="color: #0000ff;">timeframe?</span> [a] (<span style="color: #da70d6;">number?</span> a))
(<span style="color: #a020f0;">defrecord</span> <span style="color: #0000ff;">EA</span> [name type ns init deinit start symbol period args
               pid run vars exit]) 

(<span style="color: #a020f0;">defn-</span> <span style="color: #0000ff;">constant-map</span> [&amp; args] {})
(<span style="color: #a020f0;">defn-</span> <span style="color: #0000ff;">constant-true</span> [&amp; args] {})
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">new-ea</span>
  ([] (new-ea {}))
  ([{<span style="color: #da70d6;">:keys</span> [ns symbol period run args vars] <span style="color: #da70d6;">:or</span> {symbol (env <span style="color: #da70d6;">:symbol</span>)
                                                 run run-by-tick
                                                 vars {}
                                                 period (env <span style="color: #da70d6;">:period</span>)}}]
     (<span style="color: #a020f0;">let</span> [ns (<span style="color: #a020f0;">cond</span>
               (<span style="color: #da70d6;">nil?</span> ns) *ns*
               (<span style="color: #da70d6;">symbol?</span> ns) (<span style="color: #da70d6;">find-ns</span> ns)
               (<span style="color: #da70d6;">string?</span> ns) (<span style="color: #da70d6;">find-ns</span> (<span style="color: #da70d6;">symbol</span> ns))
               true ns)]
       (is? (ns? ns))
       (is? [(<span style="color: #da70d6;">map?</span> vars) (<span style="color: #da70d6;">every?</span> var? (<span style="color: #da70d6;">keys</span> vars))])
       (<span style="color: #a020f0;">let</span> [name (<span style="color: #da70d6;">str</span> (<span style="color: #da70d6;">ns-name</span> ns))
             start (ns-symbol 'start ns)
             init (<span style="color: #a020f0;">or</span> (<span style="color: #a020f0;">let</span> [fn (ns-symbol 'init ns)]
                        (<span style="color: #a020f0;">if</span> (get-fn fn) fn))
                      constant-map)
             deinit (<span style="color: #a020f0;">or</span> (<span style="color: #a020f0;">let</span> [fn (ns-symbol 'deinit ns)]
                          (<span style="color: #a020f0;">if</span> (get-fn fn) fn))
                        constant-true)] 
         (is? [(<span style="color: #da70d6;">fn?</span> (get-fn init)) (<span style="color: #da70d6;">fn?</span> (get-fn deinit)) (<span style="color: #da70d6;">string?</span> name)
               (<span style="color: #da70d6;">string?</span> symbol) (<span style="color: #da70d6;">fn?</span> run) (timeframe? period)])
         (EA. (<span style="color: #da70d6;">format</span> <span style="color: #bc8f8f;">"%s %s, %s"</span> name symbol period) (<span style="color: #da70d6;">last</span> (.split name <span style="color: #bc8f8f;">"\\."</span>))
              ns
              init deinit start symbol period (<span style="color: #a020f0;">or</span> args {})
              nil run
              (<span style="color: #da70d6;">merge</span> (copy-ea-objs (ns-vars ns)) vars)
              (<span style="color: #da70d6;">atom</span> 0)))))) 

<span style="color: #b22222;">;;</span><span style="color: #b22222;">how to get it to access actual var? as long as we dont use set!
</span>(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">clojure.core/print-method</span> EA [o w]
  (.write w  (<span style="color: #da70d6;">format</span> <span style="color: #bc8f8f;">"&lt;EA \"%s\" %s %s |%s|&gt;"</span>
                     (<span style="color: #da70d6;">:name</span> o) (pid? (<span style="color: #da70d6;">:pid</span> o))
                     (<span style="color: #da70d6;">:args</span> o) (<span style="color: #da70d6;">:vars</span> o))))

<span style="color: #b22222;">;;</span><span style="color: #b22222;">TODO: pid without spawn!!
</span>
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">run-start</span> [ea]
  (<span style="color: #a020f0;">let</span> [ea (<span style="color: #da70d6;">merge</span> ea {<span style="color: #da70d6;">:exit</span> (<span style="color: #da70d6;">atom</span> false)})]
   (with-ea [ea <span style="color: #bc8f8f;">"START"</span>] 
     (<span style="color: #da70d6;">with-bindings</span> (<span style="color: #da70d6;">:vars</span> ea)
       (<span style="color: #a020f0;">let</span> [new-ea (<span style="color: #da70d6;">merge</span> ea {<span style="color: #da70d6;">:pid</span> (spawn
                                   #((<span style="color: #da70d6;">:run</span> ea) ea)
                                   (<span style="color: #da70d6;">:name</span> ea))})]
         (<span style="color: #da70d6;">swap!</span> *eas* conj new-ea) 
         new-ea)))))


(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">restart</span> [ea]  
  (<span style="color: #a020f0;">when</span> (<span style="color: #da70d6;">not</span> (alive? ea))
    <span style="color: #b22222;">;;</span><span style="color: #b22222;">TODO: for some reason, if we change it to (hash old), it screws up! what!
</span>    (<span style="color: #a020f0;">let</span> [old (<span style="color: #da70d6;">swap!</span> *eas*
                     (<span style="color: #da70d6;">fn</span> [old] (<span style="color: #a020f0;">doall</span> (<span style="color: #da70d6;">filter</span> #(<span style="color: #da70d6;">not</span> (<span style="color: #da70d6;">=</span> (<span style="color: #da70d6;">hash</span> ea) (<span style="color: #da70d6;">hash</span> %))) old))))]
      (<span style="color: #a020f0;">try</span>
        (run-start ea)
        (<span style="color: #a020f0;">catch</span> Exception e (<span style="color: #da70d6;">swap!</span> *eas* conj ea)
               (.printStackTrace e)
               (out <span style="color: #bc8f8f;">"caught exception when running start %s"</span> e))))))

 <span style="color: #b22222;">;;</span><span style="color: #b22222;">TODO: check return type
</span>(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">run-init</span> [ea]
  (with-ea [ea <span style="color: #bc8f8f;">"INIT"</span>]
    (<span style="color: #a020f0;">let</span> [result ((get-fn (<span style="color: #da70d6;">:init</span> ea)) (<span style="color: #da70d6;">:args</span> ea))]
      (<span style="color: #a020f0;">if</span> (<span style="color: #da70d6;">map?</span> result)
        (<span style="color: #da70d6;">merge</span> ea {<span style="color: #da70d6;">:vars</span> (<span style="color: #da70d6;">merge</span> (<span style="color: #da70d6;">:vars</span> ea) result)})))))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">run-all</span> [ea]
  (<span style="color: #a020f0;">try</span>
    (with-ea [ea <span style="color: #bc8f8f;">"ALL"</span>]
      (<span style="color: #a020f0;">let</span> [new-ea (run-init ea)]
        (<span style="color: #a020f0;">if</span> (<span style="color: #da70d6;">instance?</span> EA new-ea)
          (run-start new-ea)))
      (<span style="color: #a020f0;">catch</span> Exception e
        (out <span style="color: #bc8f8f;">"caught exception %s"</span> e)))))

(<span style="color: #a020f0;">defn-</span> <span style="color: #0000ff;">filter-map</span> [f map]
  (<span style="color: #a020f0;">let</span> [vals (<span style="color: #da70d6;">mapcat</span> identity (<span style="color: #da70d6;">filter</span> (<span style="color: #da70d6;">fn</span> [[key val]]
                                        (f key)) map))]
    (<span style="color: #a020f0;">if</span> (<span style="color: #da70d6;">empty?</span> vals) {} (<span style="color: #da70d6;">apply</span> hash-map vals))))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">run</span>
  ([] (run *ns* {}))
  ([args] (run *ns* args))
  ([ns args] 
     <span style="color: #b22222;">;;</span><span style="color: #b22222;">todo: not default, no nil
</span>     (run-all (new-ea {<span style="color: #da70d6;">:ns</span> ns 
                       <span style="color: #da70d6;">:args</span> (filter-map #(<span style="color: #a020f0;">and</span> (<span style="color: #da70d6;">not</span> (<span style="color: #da70d6;">var?</span> %))
                                               (<span style="color: #da70d6;">not</span> (#{<span style="color: #da70d6;">:symbol</span> <span style="color: #da70d6;">:period</span>} %))) args)
                       <span style="color: #da70d6;">:vars</span> (filter-map var? args)
                       <span style="color: #da70d6;">:symbol</span> (<span style="color: #a020f0;">or</span> (<span style="color: #da70d6;">:symbol</span> args) (env <span style="color: #da70d6;">:symbol</span>))
                       <span style="color: #da70d6;">:period</span> (<span style="color: #a020f0;">or</span> (<span style="color: #da70d6;">:period</span> args) (env <span style="color: #da70d6;">:period</span>))}))))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">sym</span> [] (<span style="color: #da70d6;">:symbol</span> *ea*))
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">period</span> [] (<span style="color: #da70d6;">:period</span> *ea*))
<span style="color: #b22222;">;;</span><span style="color: #b22222;">TODO: wait till it stops and delete
</span>(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">stop</span> [ea]
  (<span style="color: #a020f0;">let</span> [stop-it (<span style="color: #da70d6;">fn</span> [e]
                  (<span style="color: #a020f0;">if</span> (pid? (<span style="color: #da70d6;">:pid</span> e))
                    (<span style="color: #a020f0;">do</span> (! (<span style="color: #da70d6;">:pid</span> e) <span style="color: #bc8f8f;">"STOP"</span>) 
                        true)))]
    (<span style="color: #a020f0;">if</span> (<span style="color: #da70d6;">map?</span> ea)
      (stop-it ea)
      (<span style="color: #da70d6;">map</span> stop-it ea))))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">clear-eas</span> [] (<span style="color: #da70d6;">count</span> (<span style="color: #da70d6;">reset!</span> *eas* (<span style="color: #da70d6;">filter</span> alive? @*eas*))))
<span style="color: #b22222;">;;</span><span style="color: #b22222;">SAVE/LOAD
</span>(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">save-eas</span>
  ([] (save-eas save-file 1000))
  ([save-file] (save-eas save-file 1000))
  ([save-file timeout]
     (debugging <span style="color: #bc8f8f;">"Save EA:"</span>
      (<span style="color: #a020f0;">try</span>
        (locking-write-timeout [*ea-pre-lock* (<span style="color: #a020f0;">or</span> timeout 1000)] 
                               (info <span style="color: #bc8f8f;">"saving ..."</span>)
                               (frm-save save-file @*eas*)
                               (<span style="color: #da70d6;">count</span> @*eas*))
        (<span style="color: #a020f0;">catch</span> Exception e
          (warn <span style="color: #bc8f8f;">"failed to save eas %s"</span> e))))))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">load-eas</span> 
  ([] (load-eas save-file false))
  ([append] (load-eas save-file append))
  ([file append]
     (debugging <span style="color: #bc8f8f;">"Load EA:"</span>
      (<span style="color: #a020f0;">try</span>
        (<span style="color: #a020f0;">let</span> [eas (frm-load file)]
          (is? [(<span style="color: #a020f0;">or</span> (<span style="color: #da70d6;">empty?</span> eas) (every #(<span style="color: #da70d6;">instance?</span> EA %) eas))])
          (<span style="color: #a020f0;">if</span> append (<span style="color: #a020f0;">do</span> (<span style="color: #da70d6;">swap!</span> *eas* concat eas) (<span style="color: #da70d6;">count</span> eas)) (<span style="color: #da70d6;">vec</span> eas)))
        (<span style="color: #a020f0;">catch</span> Exception e
          (warn <span style="color: #bc8f8f;">"failed to load eas %s %s: %s"</span> file append e))))))
</pre></div>


</div>

</div>
