clj-forex.org
*** Error
#+srcname:error-common 
#+begin_src clojure :tangle src/forex/module/error.clj
  (clojure.core/use 'nstools.ns)
  (ns+ forex.module.error
       (:clone clj.core)
       (:require forex.backend.mql.socket-service)
       (:require [forex.backend.mql.socket-service :as s])
       (:use forex.util.general
	     forex.util.core
	     forex.util.emacs 
	     forex.util.general))

  (defn e? [a]
    (instance? forex.backend.mql.socket-service.MqlError a))

  (defmacro aif
    ([test then] `(aif ~test ~then nil))
    ([test then else]
       `(let [~'it ~test] 
	  (if (and ~'it (not (e? ~'it)))
	    ~then
	    ~else)))) 
  (defmacro awhen [test & body] `(aif ~test (do ~@body)))
  (defmacro aif-not 
    ([test then] `(aif-not ~test ~then nil))
    ([test then else]
       `(let [~'it ~test]
	  (if (not (and ~'it (not (e? ~'it))))
	    ~then
	    ~else)))) 
  (defmacro awhen-not [test & body] `(aif-not ~test (do ~@body)))

  ;;receive with errors
  (defn receive!
    ([msg] (receive! msg nil))
    ([msg try]
       (loop [retries 0]
	 (let [result (s/receive msg)]
	   (if (e? result)
	     (let [e (:e result)]
	      (cond 
	       (and try (< retries try) (or (= e 4066) (= e 4054))) (do (Thread/sleep 300) (recur (inc retries)))
	       true (throwf "MQL error %s" e)))
	     result)))))

  ;;receive with default instead of errors, returns error object for errors
  ;;is customizable to default to errors!

  (defonce- *er* (gensym)) 
  (def *default* *er*)

  (defn receive
    ([msg] (receive msg *default*))
    ([msg default]
       (let [result (s/receive msg)]
	 (if (e? result)
	   (if (= default *er*)
	     result
	     (if (fn? default) (default result) default))
	   result))))
#+end_src
