clj-forex.html

<div id="outline-container-4_4_3" class="outline-4">
<h4 id="sec-4_4_3"><span class="section-number-4">4.4.3</span> Error </h4>
<div class="outline-text-4" id="text-4_4_3">




<div class="org-src-container"><label class="org-src-name">error-common()</label><pre class="src src-clojure">
(clojure.core/<span style="color: #da70d6;">use</span> 'nstools.ns)
(ns+ forex.module.error
     (<span style="color: #da70d6;">:clone</span> clj.core)
     (<span style="color: #da70d6;">:require</span> forex.backend.mql.socket-service)
     (<span style="color: #da70d6;">:require</span> [forex.backend.mql.socket-service <span style="color: #da70d6;">:as</span> s])
     (<span style="color: #da70d6;">:use</span> forex.util.general
           forex.util.core
           forex.util.emacs 
           forex.util.general))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">e?</span> [a]
  (<span style="color: #da70d6;">instance?</span> forex.backend.mql.socket-service.MqlError a))

(<span style="color: #a020f0;">defmacro</span> <span style="color: #0000ff;">aif</span>
  ([test then] `(aif ~test ~then nil))
  ([test then else]
     `(<span style="color: #a020f0;">let</span> [~'it ~test] 
        (<span style="color: #a020f0;">if</span> (<span style="color: #a020f0;">and</span> ~'it (<span style="color: #da70d6;">not</span> (e? ~'it)))
          ~then
          ~else)))) 
(<span style="color: #a020f0;">defmacro</span> <span style="color: #0000ff;">awhen</span> [test &amp; body] `(aif ~test (<span style="color: #a020f0;">do</span> ~@body)))
(<span style="color: #a020f0;">defmacro</span> <span style="color: #0000ff;">aif-not</span> 
  ([test then] `(aif-not ~test ~then nil))
  ([test then else]
     `(<span style="color: #a020f0;">let</span> [~'it ~test]
        (<span style="color: #a020f0;">if</span> (<span style="color: #da70d6;">not</span> (<span style="color: #a020f0;">and</span> ~'it (<span style="color: #da70d6;">not</span> (e? ~'it))))
          ~then
          ~else)))) 
(<span style="color: #a020f0;">defmacro</span> <span style="color: #0000ff;">awhen-not</span> [test &amp; body] `(aif-not ~test (<span style="color: #a020f0;">do</span> ~@body)))

<span style="color: #b22222;">;;</span><span style="color: #b22222;">receive with errors
</span>(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">receive!</span>
  ([msg] (receive! msg nil))
  ([msg try]
     (<span style="color: #a020f0;">loop</span> [retries 0]
       (<span style="color: #a020f0;">let</span> [result (s/receive msg)]
         (<span style="color: #a020f0;">if</span> (e? result)
           (<span style="color: #a020f0;">let</span> [e (<span style="color: #da70d6;">:e</span> result)]
            (<span style="color: #a020f0;">cond</span> 
             (<span style="color: #a020f0;">and</span> try (<span style="color: #da70d6;">&lt;</span> retries try) (<span style="color: #a020f0;">or</span> (<span style="color: #da70d6;">=</span> e 4066) (<span style="color: #da70d6;">=</span> e 4054))) (<span style="color: #a020f0;">do</span> (Thread/sleep 300) (<span style="color: #a020f0;">recur</span> (<span style="color: #da70d6;">inc</span> retries)))
             true (throwf <span style="color: #bc8f8f;">"MQL error %s"</span> e)))
           result)))))

<span style="color: #b22222;">;;</span><span style="color: #b22222;">receive with default instead of errors, returns error object for errors
</span><span style="color: #b22222;">;;</span><span style="color: #b22222;">is customizable to default to errors!
</span>
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">receive</span>
  ([msg] (receive msg true))
  ([msg resend] (s/receive msg resend)))
</pre></div>


</div>

</div>
