clj-forex.org
** Interface
#+srcname:interface-ea-new
#+begin_src clojure :tangle src/forex/interface/ea_new.clj
  ;;TODO: still a work in progress. for now, lets just execute a function in user
  ;;ea ns, and that function will prompt user and run ea!

  (ns forex.interface.ea-new
    (:use forex.util.log clojure.contrib.with-ns
	  forex.module.ea
	  clojure.contrib.miglayout forex.util.emacs 
	  forex.util.gui)
    (:use forex.interface.gui) 
    (:import 
     (java.awt Dimension Font event.MouseListener
	       event.MouseAdapter Toolkit event.ActionListener event.KeyListener)
     (javax.swing JComboBox JPopupMenu JMenuItem
		  ImageIcon
		  table.AbstractTableModel 
		  JScrollPane JTable
		  JFrame JPanel JTextField JLabel JButton
		  SwingUtilities)))

  (defn ns-args [ns]
    (ns-metas ns (fn [s] (:arg (meta s)))))

  (defn ea-new-gui []
    (when-let [it (and (:selector gui)
		       (.getSelectedItem (:selector gui)))]
      (when-let [ns (find-ns (symbol it))]
	(println "selection is " ns))))
  (defn var-name [a]
    (last (.split (str a) "/")))
  ;;TODO: throw slot value not working!s + add metadata to jlabel,etc
  (defn read-eval [a]
    (let [a (try (read-string (.getText a))
		 (catch Exception e (.getText a)))]
      (if (or (string? a) (symbol? a)) (str a) (eval a))))

  (defn on-start [frame panel]
    (println "result is " (keys (components panel))))

  (defn generate-ea-gui [ns] 
    (let [args (ns-args ns)
	  panel (JPanel.) frame (jframe (str (ns-name ns)))]
      (doto frame
	(.add (apply miglayout panel
		     (concat
		      (mapcat (fn [[key val]]
				(let [label (JLabel. (var-name key))]
				  [label (JTextField. 30)         
				   :wrap]))
			      args)
		      [(doto (JButton. "start")
			 (add-action-listener (fn [e] (on-start frame panel))))
		       "push,growx,span,center"])))
	(.pack)
	(.setVisible true)))) 

  (defn run-init-gui []
    (let [ns (symbol (.getSelectedItem (:selector gui)))]
     (if-let [it (get (ns-map ns) 'init-gui)]
       (if (fn? (var-get it))
	 (binding [*ns* (the-ns ns)]
	   ((var-get it))) 
	 (inform "symbol init-gui in namespace %s is not a function" ns ))
       (inform "%s does not have an init-gui function" ns)))) 

  (alter-var-root
   #'forex.interface.gui/gui-key-map
   merge {\n #'run-init-gui})
#+end_src
 
#+srcname:interface-ea-table
#+begin_src clojure :tangle src/forex/interface/ea_table.clj
  (ns forex.interface.ea-table
    (:require swank.swank) 
    (:use forex.util.log 
	  clojure.contrib.miglayout forex.util.emacs 
	  forex.util.gui forex.interface.tray)
    (:use forex.module.ea forex.interface.gui)
    (:import
     (java.awt
      Dimension Font event.MouseListener
      event.MouseAdapter Toolkit event.ActionListener event.KeyListener)
     (javax.swing JComboBox JPopupMenu JMenuItem
		  ImageIcon
		  table.AbstractTableModel 
		  JScrollPane JTable
		  JFrame JPanel JTextField JLabel JButton
		  SwingUtilities))) 

  (defonce ea-table-gui  nil)
  (defn- italic [a] (format "<html><i>%s</i><html>" a))
  (defn- color [a color]
    (format "<html><color=%s><b>%s</b></color><html>" color a))

  (defn add-watcher [var key f]
    (add-watch var key
	       (bound-fn [& args]
			 (try (apply f args)
			      (catch Exception e

				(severe "caught exception in watcher %s: %s"
					[var key] e)
				(.printStackTrace e))))))


  (defn table-model [titles data]
    (proxy [AbstractTableModel] []
      (getRowCount [] (count data))
      (getColumnCount [] (count titles))
      (getValueAt [row column] (nth (nth data  row) column))
      (getColumnClass [_] String)
      (getColumnName [col] (nth titles col))))


  (defn ea-table-model [eas] 
    (table-model
     [(italic "Name") (italic "Symbol") (italic "Period") (italic "Running?") (italic "Args")]
     (map (fn [ea] 
	    [(:type ea) (:symbol ea) (:period ea)
	     (let [exit @(:exit ea)]
	       (cond
		(and (alive? ea) (= exit false)) (color true "blue")
		true  (if-not (= true  exit)
			(color false "red")
			false)))
	     (:args ea)
	     ea])
	  eas)))

  (defn update-table [table eas]
    (locking table
     (.setModel table (ea-table-model eas))))

  (defn update-ea-table
    ([] (update-ea-table false))
    ([force]
       (let [{:keys [table frame]} ea-table-gui]
	 (when (and table frame (or force (.isVisible frame))) 
	   (update-table table @*eas*)))))

  (defn add-ea-table-watch []
    (add-hook #'ea-on-start-hook #'update-ea-table)
    ;;TODOD: better add-to-list, not repeat, maybe per *ns*?
    (add-hook #'ea-on-exit-hook #'update-ea-table)
    (add-watcher *eas* "table update" (fn [& args]
					(update-ea-table))))

  ;;
  (defn gui-new-table [frame]
    (let [eas @*eas*
	  table (JTable. (ea-table-model eas))
	  panel
	  (miglayout (JPanel.)
		     (JScrollPane. table) 
		     "span,grow" :wrap 
		     (doto  (JButton. "refresh")
		       (add-action-listener
			(fn [e] (update-table table @*eas*))))
		     ;;TODO: technically, is thread safe, oh well, do we care?
		     (doto (JButton. "stop")
		       (add-action-listener
			(fn [e] 
			  (locking table 
			    (let [i (.getSelectedRow table)
				  ea (when (>= i 0) (.getValueAt (.getModel table)
								 i (.getColumnCount table)))]
			      (when (and (>= i 0)
					 (prompt "do you really want to stop ea %s" i))
				(stop ea))))))) 
		     (doto (JButton. "clear")
		       (add-action-listener
			(fn [e]
			  (when (prompt "Do you really want to clear stopped eas?" true)
			    (update-table
			     table
			     (swap! *eas* (fn [old]
					    (filter alive? old)))))))))]
      (alter-var-root  #'ea-table-gui (constantly {:table table :frame frame}))
      panel))

  (defn display-ea-table []
    (if-not (:frame ea-table-gui)
      (let [frame (jframe "expert advisors")]
	(doto frame 
	  (.add (gui-new-table frame))
	  (.pack)
	  (.setVisible true))
	(add-ea-table-watch))
      (do (update-ea-table true) 
	  (.setVisible (:frame ea-table-gui) true))))

  (alter-var-root
   #'forex.interface.gui/gui-key-map
   merge {\v #'display-ea-table})
#+end_src

#+srcname:interface-gui
#+begin_src clojure :tangle src/forex/interface/gui.clj
  ;;(clojure.core/use 'nstools.ns)
  (ns forex.interface.gui
    (:require swank.swank)  
    (:use
     forex.util.general
     forex.util.log
     forex.module.ea forex.util.general
     clojure.contrib.miglayout forex.util.emacs 
     forex.util.gui forex.interface.tray)
    (:import 
     (java.awt Dimension Font event.MouseListener
	       event.MouseAdapter Toolkit event.ActionListener event.KeyListener)
     (javax.swing JComboBox JPopupMenu JMenuItem
		  ImageIcon SwingConstants
		  table.AbstractTableModel 
		  JScrollPane JTable
		  JFrame JPanel JTextField JLabel JButton JFileChooser
		  SwingUtilities)))
  ;;TODO: all action listeners should be vars for maximum flexibility - because sometimes it all goes away!

  ;;Useful User Vars
  (defonce gui nil) 
  (defonce toplevel nil)
  (defn message [msg & args]
    (when-let [it (:status gui)]
      (.setText it (apply format msg args))))

  ;;LOADING EAS
  (defonce prev-load-file (atom nil))
  (defn on-load-eas []
    (let [fileopen (if @prev-load-file (JFileChooser. @prev-load-file) (JFileChooser.))
	  ret (.showDialog fileopen nil "Load")] 
      (if (= ret JFileChooser/APPROVE_OPTION)
	(let [file (.getSelectedFile fileopen)]
	  (with-out-str+ out (if-let [it (load-eas file true)] (message "loaded %s eas" it) (inform (str out))))
	  (reset! prev-load-file (.getParentFile file))))))

  ;;SAVING EAS
  (defonce prev-save-file (atom nil))
  (defn on-save-eas []
    (message "saving ...")
    (let [fileopen
	  (if @prev-save-file (JFileChooser. @prev-save-file) (JFileChooser.))
	  ret (.showDialog fileopen nil "Save")]
      (if (= ret JFileChooser/APPROVE_OPTION)
	(let [file (.getSelectedFile fileopen)]
	  (reset! prev-save-file (.getParentFile file))
	  (if-let [it (save-eas file)]
	    (message "saved %s eas" it)
	    (inform "unable to acquire ea write lock in order to save all eas")))))) 
  (defn on-log []
    (message "open log file @ %s/.forex/" (System/getProperty "user.home"))) 
  ;;User Customization
  (defhook gui-on-exit-hooks) 
  (defhook gui-create-pre-hook)
  (defhook gui-create-post-hook)
  (defvar swank-port 4005) 
  (defvar gui-image "pictures/clojure.gif")
  (defvar gui-icon-image "pictures/clojure.gif")
  (defvar gui-window-image "pictures/clojure.gif")

  (defvar gui-key-map 
    {\l #'on-log  
     \s 
     #(do
	(swank.swank/start-repl swank-port)
	(message "started swank on port %s" swank-port))})
  (defn on-restart-eas []
    (dorun (map restart @*eas*))
    (message "restarted %s eas" (count @*eas*))) 
  (defvar
    gui-menu-items
    [{:name "new ea" :key \n}
     {:name "save eas" :action #'on-save-eas}
     {:name "load eas" :action #'on-load-eas}
     {:name "view eas" :key \v} 
     {:name "log" :key \l :action #'on-log}
     {:name "start swank" :key \s}
     {:name "restart eas" :key \r :action #'on-restart-eas} 
     {:name "load forex-user" 
      :action #(try       
		 (message "loading ...")
		 (require :reload 'forex-user)
		 (message "loaded forex-user")
		 (catch Exception e
		   (message "failed to load forex-user")
		   (inform "failed to load forex-user %s" e)))}
     {:name "preferences" :key \p}])
  (defvar gui-frame-title "clj-forex")
  (defvar gui-reminder-visible true) 
  ;;;;
  ;;;
  (defn jframe [title]
    (doto
	(JFrame. title)
      (.setIconImage (create-image gui-window-image))))

  (defn- get-fn [a] (if (var? a) (var-get a) a))
  (defn on-key [e] 
    (when-let [it (get-fn (get gui-key-map (.getKeyChar e)))]
      (try (when (fn? it) (it))
	   (catch Exception e
	     (.printStackTrace e)
	     (severe e))))) 
  (defn add-menu-item [parent {:keys [name key action]}]
    (let [item (JMenuItem. (str name " (" key ")"))]
      (add-action-listener 
       item (or (and (not action) (bound-fn
				   [e]
				   (let [key-map-fn (get-fn (get gui-key-map key))]
				     (when (fn? key-map-fn) (key-map-fn)))))
		(bound-fn [e] (thread (action))))) ;;no e
      (.add parent item)
      item)) 
  (defn on-popup [e] 
    (try
      (let [menu (JPopupMenu.)]
	(dorun (map #(add-menu-item menu %) gui-menu-items))
	(.show menu
	       (.getComponent e)
	       (.getX e) (.getY e)))
      (catch Exception e (println e))))
  (defn on-exit [icon] 
    (if (empty? gui-on-exit-hooks)
      (remove-system-icon icon)
      (run-hook-with-args gui-on-exit-hooks icon)))
  (defn on-click [icon]
    (.setVisible (:frame toplevel) true))
  (defn gui-make-icon []
    (system-icon
     {:image gui-icon-image
      :on-click  on-click 
      :on-exit on-exit}))

  (defn new-gui []
    (alter-var-root #'gui (constantly nil))
    (alter-var-root #'toplevel (constantly nil))
    (run-hooks gui-create-pre-hook)
    (let [icon (gui-make-icon)
	  image (if (string? gui-image) (create-icon gui-image))
	  panel
	  (doto (miglayout  
		 (JPanel.)  :column "center" 
		 (JLabel. (if image image ""))  "width 245!" "span,growx,pushx" :wrap 
		 (JComboBox. (into-array String @*ea-registry*))
		 {:id :selector} "span,growx,pushx"  :wrap
		 (doto (JLabel. "<html>n = new ea<br>v = view eas<br>l = log<br>s = start swank<html>") (.setHorizontalAlignment SwingConstants/CENTER))

		 {:id :reminder} :wrap
		 (doto (JLabel. "")
		   (.setFont (Font. "SansSerif" Font/ITALIC 12)))
		 {:id :status} "h 20!" "growx,align left,span"))  
	  frame (doto (jframe gui-frame-title)
		  (.setDefaultCloseOperation JFrame/HIDE_ON_CLOSE) 
		  (.add panel)
		  (.pack)) 
	  {:keys [selector reminder view]} (components panel)] 
      (when-not gui-reminder-visible (.setVisible reminder false))
      ;; (add-action-listener selector (bound-fn* on-selector))
      (dorun (map (fn [obj]
		    (add-key-listener obj #'on-key)
		    (add-popup-listener obj #'on-popup))
		  (conj (vals (components panel)) panel)))
      (alter-var-root  #'gui (constantly (components panel)))
      (alter-var-root #'toplevel (constantly {:frame frame :panel panel
					      :icon icon}))
      (run-hooks gui-create-post-hook)
      frame))


  (defn add-ea-registry-watch []
    (add-watch
     *ea-registry* "registry-add"
     (bound-fn [key ref old new] 
       (when-let [it (:selector gui)]
	 (.removeAllItems it)
	 (dorun (map #(.addItem it %) new))))))

  (defn invoke-new-gui
    ([] (invoke-new-gui ""))
    ([msg] 
       (invoke-later
	(when (:icon toplevel)
	  (remove-system-icon (:icon toplevel)))
	(when (:frame toplevel)
	  (.setVisible (:frame toplevel) false))
	(new-gui)
	(.setVisible (:frame toplevel) true) 
	(add-system-icon (:icon toplevel)) 
	(when msg (message msg))
	(add-ea-registry-watch))))
#+end_src
 
#+srcname:interface-main
#+begin_src clojure :tangle src/forex/interface/main.clj
  (ns forex.interface.main
    (:require swank.swank)
    (:use forex.interface.gui forex.interface.ea-table forex.interface.ea-new)
    (:use forex.util.emacs forex.util.gui forex.interface.tray))

  (defn on-system-exit [icon]
    (when (prompt (format "Do you really want to exit %s?
  This will stop all running expert advisors." gui-frame-title))
      (System/exit 0)))

  (defn -main [& args]
    (let [user-exception 
	  (try
	    (require 'forex-user) 
	    nil
	    (catch Exception e 
	      (.printStackTrace e)
	      e))] 
      (add-to-list  
       #'gui-on-exit-hooks on-system-exit)
      (invoke-new-gui (when user-exception 
			"error when loading forex-user: check log"))))
#+end_src

#+srcname:interface-tray
#+begin_src clojure :tangle src/forex/interface/tray.clj
  (ns forex.interface.tray
    (:use forex.util.gui)
    (:import                        
     (javax.swing JFrame)
     (java.awt Toolkit SystemTray  EventQueue TrayIcon TrayIcon$MessageType PopupMenu MenuItem)
     (java.awt.event ActionListener)))

  (defn remove-system-icon [icon] (.remove (SystemTray/getSystemTray) icon))
  (defn- setup-popup-menu
    ([menu icon] (setup-popup-menu menu icon (constantly true)))
    ([menu icon on-exit]
       (let [exit (MenuItem. "Exit")]
	 (add-action-listener
	  exit (if on-exit
		 (bound-fn [e] (try
				 (on-exit icon)
				 (catch Exception e
				   (.printStackTrace e)
				   (println "ERROR IN ON-EXIT %s" e))))
		 (fn [e] (remove-system-icon icon))))
	 (.add menu exit)
	 menu)))

  (defn system-icon [{:keys [image on-exit on-click on-exit]}]
    {:pre [(string? image)]}
    (let [menu (PopupMenu.)
	  tray-icon
	  (doto (TrayIcon. (.getImage (Toolkit/getDefaultToolkit) image)
			   nil menu)
	    (.setImageAutoSize true))]
      (setup-popup-menu menu tray-icon on-exit) 
      (when on-click (add-action-listener tray-icon (bound-fn [e] (try (on-click tray-icon) (catch Exception e (println "ERROR IN ON-CLICK %s" e))))))  
      tray-icon)) 
  (defn add-system-icon [icon] (.add (SystemTray/getSystemTray) icon) icon)

  (defn icon-info
    ([icon txt] (icon-info icon "info" txt))
    ([icon caption txt] (.displayMessage icon caption txt TrayIcon$MessageType/INFO)))
  (defn icon-warning
    ([icon txt] (icon-warning icon "warning" txt))
    ([icon caption txt] (.displayMessage icon caption txt TrayIcon$MessageType/WARNING)))
  (defn icon-error
    ([icon txt] (icon-error icon "error" txt))
    ([icon caption txt] (.displayMessage icon caption txt TrayIcon$MessageType/ERROR)))

  ;;(def icon (add-system-icon (system-icon {:image  "/home/seth/Desktop/clojure.gif" :on-click (fn [_] (println "HI"))})))
#+end_src
  
