clj-forex.html

<div id="outline-container-4_5" class="outline-3">
<h3 id="sec-4_5"><span class="section-number-3">4.5</span> Interface </h3>
<div class="outline-text-3" id="text-4_5">




<div class="org-src-container"><label class="org-src-name">interface-ea-new()</label><pre class="src src-clojure">
<span style="color: #b22222;">;;</span><span style="color: #b22222;">TODO: still a work in progress. for now, lets just execute a function in user
</span><span style="color: #b22222;">;;</span><span style="color: #b22222;">ea ns, and that function will prompt user and run ea!
</span>
(<span style="color: #a020f0;">ns</span> forex.interface.ea-new
  (<span style="color: #da70d6;">:use</span> forex.util.log clojure.contrib.with-ns
        forex.module.ea
        clojure.contrib.miglayout forex.util.emacs 
        forex.util.gui)
  (<span style="color: #da70d6;">:use</span> forex.interface.gui) 
  (<span style="color: #da70d6;">:import</span> 
   (java.awt Dimension Font event.MouseListener
             event.MouseAdapter Toolkit event.ActionListener event.KeyListener)
   (javax.swing JComboBox JPopupMenu JMenuItem
                ImageIcon
                table.AbstractTableModel 
                JScrollPane JTable
                JFrame JPanel JTextField JLabel JButton
                SwingUtilities)))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">ns-args</span> [ns]
  (ns-metas ns (<span style="color: #da70d6;">fn</span> [s] (<span style="color: #da70d6;">:arg</span> (<span style="color: #da70d6;">meta</span> s)))))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">ea-new-gui</span> []
  (<span style="color: #a020f0;">when-let</span> [it (<span style="color: #a020f0;">and</span> (<span style="color: #da70d6;">:selector</span> gui)
                     (.getSelectedItem (<span style="color: #da70d6;">:selector</span> gui)))]
    (<span style="color: #a020f0;">when-let</span> [ns (<span style="color: #da70d6;">find-ns</span> (<span style="color: #da70d6;">symbol</span> it))]
      (<span style="color: #da70d6;">println</span> <span style="color: #bc8f8f;">"selection is "</span> ns))))
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">var-name</span> [a]
  (<span style="color: #da70d6;">last</span> (.split (<span style="color: #da70d6;">str</span> a) <span style="color: #bc8f8f;">"/"</span>)))
<span style="color: #b22222;">;;</span><span style="color: #b22222;">TODO: throw slot value not working!s + add metadata to jlabel,etc
</span>(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">read-eval</span> [a]
  (<span style="color: #a020f0;">let</span> [a (<span style="color: #a020f0;">try</span> (<span style="color: #da70d6;">read-string</span> (.getText a))
               (<span style="color: #a020f0;">catch</span> Exception e (.getText a)))]
    (<span style="color: #a020f0;">if</span> (<span style="color: #a020f0;">or</span> (<span style="color: #da70d6;">string?</span> a) (<span style="color: #da70d6;">symbol?</span> a)) (<span style="color: #da70d6;">str</span> a) (<span style="color: #da70d6;">eval</span> a))))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">on-start</span> [frame panel]
  (<span style="color: #da70d6;">println</span> <span style="color: #bc8f8f;">"result is "</span> (<span style="color: #da70d6;">keys</span> (components panel))))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">generate-ea-gui</span> [ns] 
  (<span style="color: #a020f0;">let</span> [args (ns-args ns)
        panel (JPanel.) frame (jframe (<span style="color: #da70d6;">str</span> (<span style="color: #da70d6;">ns-name</span> ns)))]
    (<span style="color: #a020f0;">doto</span> frame
      (.add (<span style="color: #da70d6;">apply</span> miglayout panel
                   (<span style="color: #da70d6;">concat</span>
                    (<span style="color: #da70d6;">mapcat</span> (<span style="color: #da70d6;">fn</span> [[key val]]
                              (<span style="color: #a020f0;">let</span> [label (JLabel. (var-name key))]
                                [label (JTextField. 30)         
                                 <span style="color: #da70d6;">:wrap</span>]))
                            args)
                    [(<span style="color: #a020f0;">doto</span> (JButton. <span style="color: #bc8f8f;">"start"</span>)
                       (add-action-listener (<span style="color: #da70d6;">fn</span> [e] (on-start frame panel))))
                     <span style="color: #bc8f8f;">"push,growx,span,center"</span>])))
      (.pack)
      (.setVisible true)))) 

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">run-init-gui</span> []
  (<span style="color: #a020f0;">let</span> [ns (<span style="color: #da70d6;">symbol</span> (.getSelectedItem (<span style="color: #da70d6;">:selector</span> gui)))]
   (<span style="color: #a020f0;">if-let</span> [it (<span style="color: #da70d6;">get</span> (<span style="color: #da70d6;">ns-map</span> ns) 'init-gui)]
     (<span style="color: #a020f0;">if</span> (<span style="color: #da70d6;">fn?</span> (<span style="color: #da70d6;">var-get</span> it))
       (<span style="color: #a020f0;">binding</span> [*ns* (<span style="color: #da70d6;">the-ns</span> ns)]
         ((<span style="color: #da70d6;">var-get</span> it))) 
       (inform <span style="color: #bc8f8f;">"symbol init-gui in namespace %s is not a function"</span> ns ))
     (inform <span style="color: #bc8f8f;">"%s does not have an init-gui function"</span> ns)))) 

(<span style="color: #da70d6;">alter-var-root</span>
 #'forex.interface.gui/gui-key-map
 merge {\n #'run-init-gui})
</pre></div>






<div class="org-src-container"><label class="org-src-name">interface-ea-table()</label><pre class="src src-clojure">
(<span style="color: #a020f0;">ns</span> forex.interface.ea-table
  (<span style="color: #da70d6;">:require</span> swank.swank) 
  (<span style="color: #da70d6;">:use</span> forex.util.log 
        clojure.contrib.miglayout forex.util.emacs 
        forex.util.gui forex.interface.tray)
  (<span style="color: #da70d6;">:use</span> forex.module.ea forex.interface.gui)
  (<span style="color: #da70d6;">:import</span>
   (java.awt
    Dimension Font event.MouseListener
    event.MouseAdapter Toolkit event.ActionListener event.KeyListener)
   (javax.swing JComboBox JPopupMenu JMenuItem
                ImageIcon
                table.AbstractTableModel 
                JScrollPane JTable
                JFrame JPanel JTextField JLabel JButton
                SwingUtilities))) 

(<span style="color: #a020f0;">defonce</span> <span style="color: #0000ff;">ea-table-gui</span>  nil)
(<span style="color: #a020f0;">defn-</span> <span style="color: #0000ff;">italic</span> [a] (<span style="color: #da70d6;">format</span> <span style="color: #bc8f8f;">"&lt;html&gt;&lt;i&gt;%s&lt;/i&gt;&lt;html&gt;"</span> a))
(<span style="color: #a020f0;">defn-</span> <span style="color: #0000ff;">color</span> [a color]
  (<span style="color: #da70d6;">format</span> <span style="color: #bc8f8f;">"&lt;html&gt;&lt;color=%s&gt;&lt;b&gt;%s&lt;/b&gt;&lt;/color&gt;&lt;html&gt;"</span> color a))




(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">table-model</span> [titles data]
  (<span style="color: #da70d6;">proxy</span> [AbstractTableModel] []
    (getRowCount [] (<span style="color: #da70d6;">count</span> data))
    (getColumnCount [] (<span style="color: #da70d6;">count</span> titles))
    (getValueAt [row column] (<span style="color: #da70d6;">nth</span> (<span style="color: #da70d6;">nth</span> data  row) column))
    (getColumnClass [_] String)
    (getColumnName [col] (<span style="color: #da70d6;">nth</span> titles col))))


(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">ea-table-model</span> [eas] 
  (table-model
   [(italic <span style="color: #bc8f8f;">"Name"</span>) (italic <span style="color: #bc8f8f;">"Symbol"</span>) (italic <span style="color: #bc8f8f;">"Period"</span>) (italic <span style="color: #bc8f8f;">"Running?"</span>) (italic <span style="color: #bc8f8f;">"Args"</span>)]
   (<span style="color: #da70d6;">map</span> (<span style="color: #da70d6;">fn</span> [ea] 
          [(<span style="color: #da70d6;">:type</span> ea) (<span style="color: #da70d6;">:symbol</span> ea) (<span style="color: #da70d6;">:period</span> ea)
           (<span style="color: #a020f0;">let</span> [exit @(<span style="color: #da70d6;">:exit</span> ea)]
             (<span style="color: #a020f0;">cond</span>
              (<span style="color: #a020f0;">and</span> (alive? ea) (<span style="color: #da70d6;">=</span> exit false)) (color true <span style="color: #bc8f8f;">"blue"</span>)
              true  (<span style="color: #a020f0;">if-not</span> (<span style="color: #da70d6;">=</span> true  exit)
                      (color false <span style="color: #bc8f8f;">"red"</span>)
                      false)))
           (<span style="color: #da70d6;">:args</span> ea)
           ea])
        eas)))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">update-table</span> [table eas]
  (<span style="color: #da70d6;">locking</span> table
   (.setModel table (ea-table-model eas))))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">update-ea-table</span>
  ([] (update-ea-table false))
  ([force]
     (<span style="color: #a020f0;">let</span> [{<span style="color: #da70d6;">:keys</span> [table frame]} ea-table-gui]
       (<span style="color: #a020f0;">when</span> (<span style="color: #a020f0;">and</span> table frame (<span style="color: #a020f0;">or</span> force (.isVisible frame))) 
         (update-table table @*eas*)))))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">add-ea-table-watch</span> []
  (add-hook #'ea-on-start-hook #'update-ea-table)
  <span style="color: #b22222;">;;</span><span style="color: #b22222;">TODOD: better add-to-list, not repeat, maybe per *ns*?
</span>  (add-hook #'ea-on-exit-hook #'update-ea-table)
  (<span style="color: #ff0000; font-weight: bold;">add-watcher</span> *eas* <span style="color: #bc8f8f;">"table update"</span> (<span style="color: #da70d6;">fn</span> [&amp; args]
                                      (update-ea-table))))

<span style="color: #b22222;">;;</span><span style="color: #b22222;">
</span>(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">gui-new-table</span> [frame]
  (<span style="color: #a020f0;">let</span> [eas @*eas*
        table (JTable. (ea-table-model eas))
        panel
        (miglayout (JPanel.)
                   (JScrollPane. table) 
                   <span style="color: #bc8f8f;">"span,grow"</span> <span style="color: #da70d6;">:wrap</span> 
                   (<span style="color: #a020f0;">doto</span>  (JButton. <span style="color: #bc8f8f;">"refresh"</span>)
                     (add-action-listener
                      (<span style="color: #da70d6;">fn</span> [e] (update-table table @*eas*))))
                   (<span style="color: #a020f0;">doto</span> (JButton. <span style="color: #bc8f8f;">"stop"</span>)
                     (add-action-listener
                      (<span style="color: #da70d6;">fn</span> [e]
                        <span style="color: #b22222;">;;</span><span style="color: #b22222;">TODO: locking on a table is bad if youre going to have a prompt - will lock up stopping of eas, etc. x
</span>                        (<span style="color: #da70d6;">locking</span> table 
                          (<span style="color: #a020f0;">let</span> [i (.getSelectedRow table)
                                ea (<span style="color: #a020f0;">when</span> (<span style="color: #da70d6;">&gt;=</span> i 0) (.getValueAt (.getModel table)
                                                               i (.getColumnCount table)))]
                            (<span style="color: #a020f0;">when</span> (<span style="color: #a020f0;">and</span> (<span style="color: #da70d6;">&gt;=</span> i 0)
                                       (prompt <span style="color: #bc8f8f;">"do you really want to stop ea %s"</span> i))
                              (stop ea))))))) 
                   (<span style="color: #a020f0;">doto</span> (JButton. <span style="color: #bc8f8f;">"clear"</span>)
                     (add-action-listener
                      (<span style="color: #da70d6;">fn</span> [e]
                        (<span style="color: #a020f0;">when</span> (prompt <span style="color: #bc8f8f;">"Do you really want to clear stopped eas?"</span> true)
                          (update-table
                           table
                           (<span style="color: #da70d6;">swap!</span> *eas* (<span style="color: #da70d6;">fn</span> [old]
                                          (<span style="color: #da70d6;">filter</span> alive? old)))))))))]
    (<span style="color: #da70d6;">alter-var-root</span>  #'ea-table-gui (<span style="color: #da70d6;">constantly</span> {<span style="color: #da70d6;">:table</span> table <span style="color: #da70d6;">:frame</span> frame}))
    panel))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">display-ea-table</span> []
  (<span style="color: #a020f0;">if-not</span> (<span style="color: #da70d6;">:frame</span> ea-table-gui)
    (<span style="color: #a020f0;">let</span> [frame (jframe <span style="color: #bc8f8f;">"expert advisors"</span>)]
      (<span style="color: #a020f0;">doto</span> frame 
        (.add (gui-new-table frame))
        (.pack)
        (.setVisible true))
      (add-ea-table-watch))
    (<span style="color: #a020f0;">do</span> (update-ea-table true) 
        (.setVisible (<span style="color: #da70d6;">:frame</span> ea-table-gui) true))))

(<span style="color: #da70d6;">alter-var-root</span>
 #'forex.interface.gui/gui-key-map
 merge {\v #'display-ea-table})
</pre></div>




<div class="org-src-container"><label class="org-src-name">interface-gui()</label><pre class="src src-clojure">
<span style="color: #b22222;">;;</span><span style="color: #b22222;">(clojure.core/use 'nstools.ns)
</span>(<span style="color: #a020f0;">ns</span> forex.interface.gui
  (<span style="color: #da70d6;">:require</span> swank.swank)  
  (<span style="color: #da70d6;">:use</span>
   forex.util.general
   forex.util.log
   forex.module.ea forex.util.general
   clojure.contrib.miglayout forex.util.emacs 
   forex.util.gui forex.interface.tray)
  (<span style="color: #da70d6;">:import</span> 
   (java.awt Dimension Font event.MouseListener
             event.MouseAdapter Toolkit event.ActionListener event.KeyListener)
   (javax.swing JComboBox JPopupMenu JMenuItem
                ImageIcon SwingConstants
                table.AbstractTableModel 
                JScrollPane JTable
                JFrame JPanel JTextField JLabel JButton JFileChooser
                SwingUtilities)))
<span style="color: #b22222;">;;</span><span style="color: #b22222;">TODO: all action listeners should be vars for maximum flexibility - because sometimes it all goes away!
</span>
<span style="color: #b22222;">;;</span><span style="color: #b22222;">Useful User Vars
</span>(<span style="color: #a020f0;">defonce</span> <span style="color: #0000ff;">gui</span> nil) 
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">message</span> [msg &amp; args]
  (<span style="color: #a020f0;">when-let</span> [it (<span style="color: #da70d6;">:status</span> gui)]
    (.setText it (<span style="color: #da70d6;">apply</span> format msg args))))

<span style="color: #b22222;">;;</span><span style="color: #b22222;">LOADING EAS
</span>(<span style="color: #a020f0;">defonce</span> <span style="color: #0000ff;">prev-load-file</span> (<span style="color: #da70d6;">atom</span> nil))
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">on-load-eas</span> []
  (<span style="color: #a020f0;">let</span> [fileopen (<span style="color: #a020f0;">if</span> @prev-load-file (JFileChooser. @prev-load-file) (JFileChooser.))
        ret (.showDialog fileopen nil <span style="color: #bc8f8f;">"Load"</span>)] 
    (<span style="color: #a020f0;">if</span> (<span style="color: #da70d6;">=</span> ret JFileChooser/APPROVE_OPTION)
      (<span style="color: #a020f0;">let</span> [file (.getSelectedFile fileopen)]
        (with-out-str+ out (<span style="color: #a020f0;">if-let</span> [it (load-eas file true)] (message <span style="color: #bc8f8f;">"loaded %s eas"</span> it) (inform (<span style="color: #da70d6;">str</span> out))))
        (<span style="color: #da70d6;">reset!</span> prev-load-file (.getParentFile file))))))

<span style="color: #b22222;">;;</span><span style="color: #b22222;">SAVING EAS
</span>(<span style="color: #a020f0;">defonce</span> <span style="color: #0000ff;">prev-save-file</span> (<span style="color: #da70d6;">atom</span> nil))
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">on-save-eas</span> []
  (message <span style="color: #bc8f8f;">"saving ..."</span>)
  (<span style="color: #a020f0;">let</span> [fileopen
        (<span style="color: #a020f0;">if</span> @prev-save-file (JFileChooser. @prev-save-file) (JFileChooser.))
        ret (.showDialog fileopen nil <span style="color: #bc8f8f;">"Save"</span>)]
    (<span style="color: #a020f0;">if</span> (<span style="color: #da70d6;">=</span> ret JFileChooser/APPROVE_OPTION)
      (<span style="color: #a020f0;">let</span> [file (.getSelectedFile fileopen)]
        (<span style="color: #da70d6;">reset!</span> prev-save-file (.getParentFile file))
        (<span style="color: #a020f0;">if-let</span> [it (save-eas file)]
          (message <span style="color: #bc8f8f;">"saved %s eas"</span> it)
          (inform <span style="color: #bc8f8f;">"unable to acquire ea write lock in order to save all eas"</span>)))))) 
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">on-log</span> []
  (message <span style="color: #bc8f8f;">"open log file @ %s/.forex/"</span> (System/getProperty <span style="color: #bc8f8f;">"user.home"</span>))) 
<span style="color: #b22222;">;;</span><span style="color: #b22222;">User Customization
</span>(defhook gui-on-exit-hooks) 
(defhook gui-create-pre-hook)
(defhook gui-create-post-hook)
(<span style="color: #a020f0;">defvar</span> <span style="color: #0000ff;">swank-port</span> 4005) 
(<span style="color: #a020f0;">defvar</span> <span style="color: #0000ff;">gui-image</span> <span style="color: #bc8f8f;">"pictures/clojure.gif"</span>)
(<span style="color: #a020f0;">defvar</span> <span style="color: #0000ff;">gui-icon-image</span> <span style="color: #bc8f8f;">"pictures/clojure.gif"</span>)
(<span style="color: #a020f0;">defvar</span> <span style="color: #0000ff;">gui-window-image</span> <span style="color: #bc8f8f;">"pictures/clojure.gif"</span>)

(<span style="color: #a020f0;">defvar</span> <span style="color: #0000ff;">gui-key-map</span> 
  {\l #'on-log  
   \s 
   #(<span style="color: #a020f0;">do</span>
      (swank.swank/start-repl swank-port)
      (message <span style="color: #bc8f8f;">"started swank on port %s"</span> swank-port))})
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">on-restart-eas</span> []
  (<span style="color: #a020f0;">dorun</span> (<span style="color: #da70d6;">map</span> restart @*eas*))
  (message <span style="color: #bc8f8f;">"restarted %s eas"</span> (<span style="color: #da70d6;">count</span> @*eas*))) 
(<span style="color: #a020f0;">defvar</span>
  <span style="color: #0000ff;">gui-menu-items</span>
  [{<span style="color: #da70d6;">:name</span> <span style="color: #bc8f8f;">"new ea"</span> <span style="color: #da70d6;">:key</span> \n}
   {<span style="color: #da70d6;">:name</span> <span style="color: #bc8f8f;">"save eas"</span> <span style="color: #da70d6;">:action</span> #'on-save-eas}
   {<span style="color: #da70d6;">:name</span> <span style="color: #bc8f8f;">"load eas"</span> <span style="color: #da70d6;">:action</span> #'on-load-eas}
   {<span style="color: #da70d6;">:name</span> <span style="color: #bc8f8f;">"view eas"</span> <span style="color: #da70d6;">:key</span> \v} 
   {<span style="color: #da70d6;">:name</span> <span style="color: #bc8f8f;">"log"</span> <span style="color: #da70d6;">:key</span> \l <span style="color: #da70d6;">:action</span> #'on-log}
   {<span style="color: #da70d6;">:name</span> <span style="color: #bc8f8f;">"start swank"</span> <span style="color: #da70d6;">:key</span> \s}
   {<span style="color: #da70d6;">:name</span> <span style="color: #bc8f8f;">"restart eas"</span> <span style="color: #da70d6;">:key</span> \r <span style="color: #da70d6;">:action</span> #'on-restart-eas} 
   {<span style="color: #da70d6;">:name</span> <span style="color: #bc8f8f;">"load forex-user"</span> 
    <span style="color: #da70d6;">:action</span> #(<span style="color: #a020f0;">try</span>       
               (message <span style="color: #bc8f8f;">"loading ..."</span>)
               (<span style="color: #da70d6;">require</span> <span style="color: #da70d6;">:reload</span> 'forex-user)
               (message <span style="color: #bc8f8f;">"loaded forex-user"</span>)
               (<span style="color: #a020f0;">catch</span> Exception e
                 (message <span style="color: #bc8f8f;">"failed to load forex-user"</span>)
                 (inform <span style="color: #bc8f8f;">"failed to load forex-user %s"</span> e)))}
   {<span style="color: #da70d6;">:name</span> <span style="color: #bc8f8f;">"preferences"</span> <span style="color: #da70d6;">:key</span> \p}])
(<span style="color: #a020f0;">defvar</span> <span style="color: #0000ff;">gui-frame-title</span> <span style="color: #bc8f8f;">"clj-forex"</span>)
(<span style="color: #a020f0;">defvar</span> <span style="color: #0000ff;">gui-reminder-visible</span> true) 
<span style="color: #b22222;">;;;;</span><span style="color: #b22222;">
</span><span style="color: #b22222;">;;;</span><span style="color: #b22222;">
</span>(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">jframe</span> [title]
  (<span style="color: #a020f0;">doto</span>
      (JFrame. title)
    (.setIconImage (create-image gui-window-image))))

(<span style="color: #a020f0;">defn-</span> <span style="color: #0000ff;">get-fn</span> [a] (<span style="color: #a020f0;">if</span> (<span style="color: #da70d6;">var?</span> a) (<span style="color: #da70d6;">var-get</span> a) a))
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">on-key</span> [e] 
  (<span style="color: #a020f0;">when-let</span> [it (get-fn (<span style="color: #da70d6;">get</span> gui-key-map (.getKeyChar e)))]
    (<span style="color: #a020f0;">try</span> (<span style="color: #a020f0;">when</span> (<span style="color: #da70d6;">fn?</span> it) (it))
         (<span style="color: #a020f0;">catch</span> Exception e
           (.printStackTrace e)
           (severe e))))) 
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">add-menu-item</span> [parent {<span style="color: #da70d6;">:keys</span> [name key action]}]
  (<span style="color: #a020f0;">let</span> [item (JMenuItem. (<span style="color: #da70d6;">str</span> name <span style="color: #bc8f8f;">" ("</span> key <span style="color: #bc8f8f;">")"</span>))]
    (add-action-listener 
     item (<span style="color: #a020f0;">or</span> (<span style="color: #a020f0;">and</span> (<span style="color: #da70d6;">not</span> action) (<span style="color: #da70d6;">bound-fn</span>
                                 [e]
                                 (<span style="color: #a020f0;">let</span> [key-map-fn (get-fn (<span style="color: #da70d6;">get</span> gui-key-map key))]
                                   (<span style="color: #a020f0;">when</span> (<span style="color: #da70d6;">fn?</span> key-map-fn) (key-map-fn)))))
              (<span style="color: #da70d6;">bound-fn</span> [e] (thread (action))))) <span style="color: #b22222;">;;</span><span style="color: #b22222;">no e
</span>    (.add parent item)
    item)) 
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">on-popup</span> [e] 
  (<span style="color: #a020f0;">try</span>
    (<span style="color: #a020f0;">let</span> [menu (JPopupMenu.)]
      (<span style="color: #a020f0;">dorun</span> (<span style="color: #da70d6;">map</span> #(add-menu-item menu %) gui-menu-items))
      (.show menu
             (.getComponent e)
             (.getX e) (.getY e)))
    (<span style="color: #a020f0;">catch</span> Exception e (<span style="color: #da70d6;">println</span> e))))
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">on-exit</span> [icon] 
  (<span style="color: #a020f0;">if</span> (<span style="color: #da70d6;">empty?</span> gui-on-exit-hooks)
    (remove-system-icon icon)
    (run-hook-with-args gui-on-exit-hooks icon)))
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">on-click</span> [icon]
  (.setVisible (<span style="color: #da70d6;">:frame</span> gui) true))
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">gui-make-icon</span> []
  (system-icon
   {<span style="color: #da70d6;">:image</span> gui-icon-image
    <span style="color: #da70d6;">:on-click</span>  on-click 
    <span style="color: #da70d6;">:on-exit</span> on-exit}))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">new-gui</span> []
  (<span style="color: #da70d6;">alter-var-root</span> #'gui (<span style="color: #da70d6;">constantly</span> nil))
  (run-hooks gui-create-pre-hook)
  (<span style="color: #a020f0;">let</span> [icon (gui-make-icon)
        image (<span style="color: #a020f0;">if</span> (<span style="color: #da70d6;">string?</span> gui-image) (create-icon gui-image))
        panel
        (<span style="color: #a020f0;">doto</span> (miglayout  
               (JPanel.)  <span style="color: #da70d6;">:column</span> <span style="color: #bc8f8f;">"center"</span> 
               (JLabel. (<span style="color: #a020f0;">if</span> image image <span style="color: #bc8f8f;">""</span>))  <span style="color: #bc8f8f;">"width 245!"</span> <span style="color: #bc8f8f;">"span,growx,pushx"</span> <span style="color: #da70d6;">:wrap</span> 
               (JComboBox. (<span style="color: #da70d6;">into-array</span> String @*ea-registry*))
               {<span style="color: #da70d6;">:id</span> <span style="color: #da70d6;">:selector</span>} <span style="color: #bc8f8f;">"span,growx,pushx"</span>  <span style="color: #da70d6;">:wrap</span>
               (<span style="color: #a020f0;">doto</span> (JLabel. <span style="color: #bc8f8f;">"&lt;html&gt;n = new ea&lt;br&gt;v = view eas&lt;br&gt;l = log&lt;br&gt;s = start swank&lt;html&gt;"</span>) (.setHorizontalAlignment SwingConstants/CENTER))

               {<span style="color: #da70d6;">:id</span> <span style="color: #da70d6;">:reminder</span>} <span style="color: #da70d6;">:wrap</span>
               (<span style="color: #a020f0;">doto</span> (JLabel. <span style="color: #bc8f8f;">""</span>)
                 (.setFont (Font. <span style="color: #bc8f8f;">"SansSerif"</span> Font/ITALIC 12)))
               {<span style="color: #da70d6;">:id</span> <span style="color: #da70d6;">:status</span>} <span style="color: #bc8f8f;">"h 20!"</span> <span style="color: #bc8f8f;">"growx,align left,span"</span>))  
        frame (<span style="color: #a020f0;">doto</span> (jframe gui-frame-title)
                (.setDefaultCloseOperation JFrame/HIDE_ON_CLOSE) 
                (.add panel)
                (.pack)) 
        {<span style="color: #da70d6;">:keys</span> [selector reminder view]} (components panel)] 
    (<span style="color: #a020f0;">when-not</span> gui-reminder-visible (.setVisible reminder false))
    <span style="color: #b22222;">;; </span><span style="color: #b22222;">(add-action-listener selector (bound-fn* on-selector))
</span>    (<span style="color: #a020f0;">dorun</span> (<span style="color: #da70d6;">map</span> (<span style="color: #da70d6;">fn</span> [obj]
                  (add-key-listener obj #'on-key)
                  (add-popup-listener obj #'on-popup))
                (<span style="color: #da70d6;">conj</span> (<span style="color: #da70d6;">vals</span> (components panel)) panel)))
    (<span style="color: #da70d6;">alter-var-root</span>  #'gui (<span style="color: #da70d6;">constantly</span> (<span style="color: #da70d6;">merge</span> (components panel) {<span style="color: #da70d6;">:frame</span> frame <span style="color: #da70d6;">:panel</span> panel <span style="color: #da70d6;">:icon</span> icon})))
    (run-hooks gui-create-post-hook)
    frame))


(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">add-ea-registry-watch</span> []
  (<span style="color: #ff0000; font-weight: bold;">add-watcher</span>
   *ea-registry* <span style="color: #bc8f8f;">"registry-add"</span>
   (<span style="color: #da70d6;">fn</span> [key ref old new] 
     (<span style="color: #a020f0;">when-let</span> [it (<span style="color: #da70d6;">:selector</span> gui)]
       (.removeAllItems it)
       (<span style="color: #a020f0;">dorun</span> (<span style="color: #da70d6;">map</span> #(.addItem it %) new))))))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">invoke-new-gui</span>
  ([] (invoke-new-gui <span style="color: #bc8f8f;">""</span>))
  ([msg] 
     (invoke-later
      (<span style="color: #a020f0;">when-let</span> [it (<span style="color: #da70d6;">:icon</span> gui)]
        (remove-system-icon it))
      (<span style="color: #a020f0;">when-let</span> [it (<span style="color: #da70d6;">:frame</span> gui)]
        (.setVisible it false))
      (new-gui)
      (.setVisible (<span style="color: #da70d6;">:frame</span> gui) true) 
      (add-system-icon (<span style="color: #da70d6;">:icon</span> gui)) 
      (<span style="color: #a020f0;">when</span> msg (message msg))
      (add-ea-registry-watch))))
</pre></div>






<div class="org-src-container"><label class="org-src-name">interface-main()</label><pre class="src src-clojure">
(<span style="color: #a020f0;">ns</span> forex.interface.main
  (<span style="color: #da70d6;">:require</span> swank.swank)
  (<span style="color: #da70d6;">:use</span> forex.interface.gui forex.interface.ea-table forex.interface.ea-new)
  (<span style="color: #da70d6;">:use</span> forex.util.emacs forex.util.gui forex.interface.tray))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">on-system-exit</span> [icon]
  (<span style="color: #a020f0;">when</span> (prompt (<span style="color: #da70d6;">format</span> <span style="color: #bc8f8f;">"Do you really want to exit %s?
This will stop all running expert advisors."</span> gui-frame-title))
    (System/exit 0)))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">-main</span> [&amp; args]
  (<span style="color: #a020f0;">let</span> [user-exception 
        (<span style="color: #a020f0;">try</span>
          (<span style="color: #da70d6;">require</span> 'forex-user) 
          nil
          (<span style="color: #a020f0;">catch</span> Exception e 
            (.printStackTrace e)
            e))] 
    (add-to-list  
     #'gui-on-exit-hooks on-system-exit)
    (invoke-new-gui (<span style="color: #a020f0;">when</span> user-exception <span style="color: #bc8f8f;">"error when loading forex-user: check log"</span>))))
</pre></div>




<div class="org-src-container"><label class="org-src-name">interface-tray()</label><pre class="src src-clojure">
(<span style="color: #a020f0;">ns</span> forex.interface.tray
  (<span style="color: #da70d6;">:use</span> forex.util.gui)
  (<span style="color: #da70d6;">:import</span>                        
   (javax.swing JFrame)
   (java.awt Toolkit SystemTray  EventQueue TrayIcon TrayIcon$MessageType PopupMenu MenuItem)
   (java.awt.event ActionListener)))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">remove-system-icon</span> [icon] (.remove (SystemTray/getSystemTray) icon))
(<span style="color: #a020f0;">defn-</span> <span style="color: #0000ff;">setup-popup-menu</span>
  ([menu icon] (setup-popup-menu menu icon (<span style="color: #da70d6;">constantly</span> true)))
  ([menu icon on-exit]
     (<span style="color: #a020f0;">let</span> [exit (MenuItem. <span style="color: #bc8f8f;">"Exit"</span>)]
       (add-action-listener
        exit (<span style="color: #a020f0;">if</span> on-exit
               (<span style="color: #da70d6;">bound-fn</span> [e] (<span style="color: #a020f0;">try</span>
                               (on-exit icon)
                               (<span style="color: #a020f0;">catch</span> Exception e
                                 (.printStackTrace e)
                                 (<span style="color: #da70d6;">println</span> <span style="color: #bc8f8f;">"ERROR IN ON-EXIT %s"</span> e))))
               (<span style="color: #da70d6;">fn</span> [e] (remove-system-icon icon))))
       (.add menu exit)
       menu)))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">system-icon</span> [{<span style="color: #da70d6;">:keys</span> [image on-exit on-click on-exit]}]
  {<span style="color: #da70d6;">:pre</span> [(<span style="color: #da70d6;">string?</span> image)]}
  (<span style="color: #a020f0;">let</span> [menu (PopupMenu.)
        tray-icon
        (<span style="color: #a020f0;">doto</span> (TrayIcon. (.getImage (Toolkit/getDefaultToolkit) image)
                         nil menu)
          (.setImageAutoSize true))]
    (setup-popup-menu menu tray-icon on-exit) 
    (<span style="color: #a020f0;">when</span> on-click (add-action-listener tray-icon (<span style="color: #da70d6;">bound-fn</span> [e] (<span style="color: #a020f0;">try</span> (on-click tray-icon) (<span style="color: #a020f0;">catch</span> Exception e (<span style="color: #da70d6;">println</span> <span style="color: #bc8f8f;">"ERROR IN ON-CLICK %s"</span> e))))))  
    tray-icon)) 
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">add-system-icon</span> [icon] (.add (SystemTray/getSystemTray) icon) icon)

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">icon-info</span>
  ([icon txt] (icon-info icon <span style="color: #bc8f8f;">"info"</span> txt))
  ([icon caption txt] (.displayMessage icon caption txt TrayIcon$MessageType/INFO)))
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">icon-warning</span>
  ([icon txt] (icon-warning icon <span style="color: #bc8f8f;">"warning"</span> txt))
  ([icon caption txt] (.displayMessage icon caption txt TrayIcon$MessageType/WARNING)))
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">icon-error</span>
  ([icon txt] (icon-error icon <span style="color: #bc8f8f;">"error"</span> txt))
  ([icon caption txt] (.displayMessage icon caption txt TrayIcon$MessageType/ERROR)))

<span style="color: #b22222;">;;</span><span style="color: #b22222;">(def icon (add-system-icon (system-icon {:image  "/home/seth/Desktop/clojure.gif" :on-click (fn [_] (println "HI"))})))
</span></pre></div>



</div>

</div>

<div id="outline-container-4_6" class="outline-3">
<h3 id="sec-4_6"><span class="section-number-3">4.6</span> User </h3>
<div class="outline-text-3" id="text-4_6">




<div class="org-src-container"><label class="org-src-name">forex_user()</label><pre class="src src-clojure">
<span style="color: #b22222;">;;</span><span style="color: #b22222;">TODO: bug when no account is connected! yikes!
</span>
<span style="color: #b22222;">;;</span><span style="color: #b22222;">forex_user is the ns in which customization will occur
</span>(<span style="color: #da70d6;">println</span> <span style="color: #bc8f8f;">"LOADING forex-user"</span>)
(clojure.core/<span style="color: #da70d6;">use</span> 'nstools.ns)
(ns+ forex-user  
     (<span style="color: #da70d6;">:clone</span> forex.default) 
