clj-forex.org
** User 
#+srcname:forex_user
#+begin_src clojure :tangle src/forex_user.clj
  ;;forex_user is the ns in which customization will occur

  (clojure.core/use 'nstools.ns)
  (ns+ forex-user 
       (:clone forex.default)
       (:use forex.interface.gui forex.util.log clj.io))
  (require :reload 'forex.examples.timeout-ea.timeout-ea)
  ;;(require :reload-all 'forex.interface.main)
  (when-not (backend/alive?)
    (backend/start))

  (when-not log-file
    (setq forex.util.log/log
	  (new-logger (.replaceAll
		       (format "log_%s.txt" (now)) ":" "_"))))


  ;;ALL ABOUT AUTOSAVING
  (defvar ea-auto-save-minutes  5)
  (defvar ea-auto-save-file
    (let [file (format "%s/.forex/auto/ea-auto-save"
		       (System/getProperty "user.home"))]
      (make-parents file)
      file))  
  (defonce ea-auto-save-thread (doto (thread
				      (loop []
					(sleep (* 60 ea-auto-save-minutes))
					(when-not (empty? @*eas*)
					  (save-eas ea-auto-save-file))
					(recur)))
				 (.setName "ea auto save")))

  (add-to-list #'ea-on-exit-hook #(when-not (empty? @*eas*) (save-eas ea-auto-save-file)))
  (add-to-list #'ea-on-start-hook #(when-not (empty? @*eas*) (save-eas ea-auto-save-file)))

  (defonce ea-shutdown-hook (Thread. #(save-eas ea-auto-save-file 500)))
  (add-shutdown-hook ea-shutdown-hook)
  ;;;



  (comment 
    (setq gui-frame-title "MINE!"
	  gui-reminder-visible true))
#+end_src

** Templates
#+source: template
#+begin_src clojure :tangle src/forex/default.clj
  (clojure.core/use 'nstools.ns)
  (ns+ forex.default
       (:clone clj.core)
       (:use forex.util.general)
       (:use forex.util.core
	     forex.util.emacs
	     forex.util.log) 
       (:use forex.module.error
	     forex.module.ea
	     forex.module.indicator
	     forex.module.account forex.module.account.utils
	     [clj-time.core :exclude [extend start]])
       (:require
	[forex.backend.mql.socket-service :as backend]))
#+end_src

#+source: gui-template
#+begin_src clojure :tangle src/forex/gui.clj 
  (clojure.core/use 'nstools.ns)
  (ns+ forex.gui 
       (:clone clj.core)
       (:import (javax.swing JScrollPane JFrame JPanel JTextArea
			     JLabel JButton SwingUtilities))
       (:use forex.util.general forex.util.gui clojure.contrib.miglayout)
       (:use forex.util.core
	     forex.util.emacs
	     forex.util.log)  
       (:use forex.module.error
	     forex.module.ea
	     forex.module.indicator
	     forex.module.account forex.module.account.utils
	     [clj-time.core :exclude [extend start]])
       (:require
	[forex.backend.mql.socket-service :as backend]))
#+end_src

