clj-forex.html
     (<span style="color: #da70d6;">:use</span> forex.interface.gui forex.util.log clj.io))
(<span style="color: #da70d6;">require</span> <span style="color: #da70d6;">:reload</span> 'forex.examples.timeout-ea.timeout-ea)
<span style="color: #b22222;">;;</span><span style="color: #b22222;">(require :reload-all 'forex.interface.main)
</span>(<span style="color: #a020f0;">when-not</span> (backend/alive?)
  (backend/start))

(<span style="color: #a020f0;">when-not</span> log-file
  (setq forex.util.log/log
        (new-logger (.replaceAll
                     (<span style="color: #da70d6;">format</span> <span style="color: #bc8f8f;">"log_%s.txt"</span> (now)) <span style="color: #bc8f8f;">":"</span> <span style="color: #bc8f8f;">"_"</span>))))


<span style="color: #b22222;">;;</span><span style="color: #b22222;">ALL ABOUT AUTOSAVING
</span>(<span style="color: #a020f0;">defvar</span> <span style="color: #0000ff;">ea-auto-save-minutes</span>  5)
(<span style="color: #a020f0;">defvar</span> <span style="color: #0000ff;">ea-auto-save-file</span>
  (<span style="color: #a020f0;">let</span> [file (<span style="color: #da70d6;">format</span> <span style="color: #bc8f8f;">"%s/.forex/auto/ea-auto-save"</span>
                     (System/getProperty <span style="color: #bc8f8f;">"user.home"</span>))]
    (make-parents file)
    file))  
(<span style="color: #a020f0;">defonce</span> <span style="color: #0000ff;">ea-auto-save-thread</span> (<span style="color: #a020f0;">doto</span> (thread
                                    (<span style="color: #a020f0;">loop</span> []
                                      (sleep (<span style="color: #da70d6;">*</span> 60 ea-auto-save-minutes))
                                      (<span style="color: #a020f0;">when-not</span> (<span style="color: #da70d6;">empty?</span> @*eas*)
                                        (save-eas ea-auto-save-file))
                                      (<span style="color: #a020f0;">recur</span>)))
                               (.setName <span style="color: #bc8f8f;">"ea auto save"</span>)))

(add-to-list #'ea-on-exit-hook #(<span style="color: #a020f0;">when-not</span> (<span style="color: #da70d6;">empty?</span> @*eas*) (save-eas ea-auto-save-file)))
(add-to-list #'ea-on-start-hook #(<span style="color: #a020f0;">when-not</span> (<span style="color: #da70d6;">empty?</span> @*eas*) (save-eas ea-auto-save-file)))

(<span style="color: #a020f0;">defonce</span> <span style="color: #0000ff;">ea-shutdown-hook</span> (Thread. #(save-eas ea-auto-save-file 500)))
(add-shutdown-hook ea-shutdown-hook)
<span style="color: #b22222;">;;;</span><span style="color: #b22222;">
</span>


(<span style="color: #da70d6;">comment</span> 
  (setq gui-frame-title <span style="color: #bc8f8f;">"MINE!"</span>
        gui-reminder-visible true))
</pre></div>



</div>

</div>

<div id="outline-container-4_7" class="outline-3">
<h3 id="sec-4_7"><span class="section-number-3">4.7</span> Templates </h3>
<div class="outline-text-3" id="text-4_7">




<div class="org-src-container"><label class="org-src-name">template()</label><pre class="src src-clojure">
(clojure.core/<span style="color: #da70d6;">use</span> 'nstools.ns)
(ns+ forex.default
     (<span style="color: #da70d6;">:clone</span> clj.core)
     (<span style="color: #da70d6;">:use</span> forex.util.general)
     (<span style="color: #da70d6;">:use</span> forex.util.core
           forex.util.emacs
           forex.util.log) 
     (<span style="color: #da70d6;">:use</span> forex.module.error
           forex.module.ea
           forex.module.indicator
           forex.module.account forex.module.account.utils
           [clj-time.core <span style="color: #da70d6;">:exclude</span> [extend start]])
     (<span style="color: #da70d6;">:require</span>
      [forex.backend.mql.socket-service <span style="color: #da70d6;">:as</span> backend]))
</pre></div>




<div class="org-src-container"><label class="org-src-name">gui-template()</label><pre class="src src-clojure">
(clojure.core/<span style="color: #da70d6;">use</span> 'nstools.ns)
(ns+ forex.gui 
     (<span style="color: #da70d6;">:clone</span> clj.core)
     (<span style="color: #da70d6;">:import</span> (javax.swing JScrollPane JFrame JPanel JTextArea
                           JLabel JButton SwingUtilities))
     (<span style="color: #da70d6;">:use</span> forex.util.general forex.util.gui clojure.contrib.miglayout)
     (<span style="color: #da70d6;">:use</span> forex.util.core
           forex.util.emacs
           forex.util.log)  
     (<span style="color: #da70d6;">:use</span> forex.module.error
           forex.module.ea
           forex.module.indicator
           forex.module.account forex.module.account.utils
           [clj-time.core <span style="color: #da70d6;">:exclude</span> [extend start]])
     (<span style="color: #da70d6;">:require</span>
      [forex.backend.mql.socket-service <span style="color: #da70d6;">:as</span> backend]))
</pre></div>



</div>

</div>
