clj-forex.html

<div id="outline-container-4_8" class="outline-3">
<h3 id="sec-4_8"><span class="section-number-3">4.8</span> Examples </h3>
<div class="outline-text-3" id="text-4_8">

<p>Notice that examples are right now just examples, they arent particularly
profitable, they are examples of using clj-forex. I decided to release
them without thoroughly testing so that one can see an early look of how to
use clj-forex&hellip;.
</p>



<div class="org-src-container"><label class="org-src-name">timeout-ea()</label><pre class="src src-clojure">
<span style="color: #b22222;">;;</span><span style="color: #b22222;">forex.examples.timeout-ea : ea which manages the orders of a trade
</span>(clojure.core/<span style="color: #da70d6;">use</span> 'nstools.ns)
(ns+ forex.examples.timeout-ea.timeout-ea
     (<span style="color: #da70d6;">:clone</span> forex.gui) 
     (<span style="color: #da70d6;">:use</span> forex.examples.timeout-ea.utils
           forex.interface.gui)
     (<span style="color: #da70d6;">:import</span> (javax.swing JScrollPane JTextField)))
(register-ea)
 <span style="color: #b22222;">;;</span><span style="color: #b22222;">ea vars   
</span>(<span style="color: #a020f0;">defvar</span> <span style="color: #0000ff;">state</span> (<span style="color: #da70d6;">atom</span> <span style="color: #da70d6;">:timeout</span>))
(<span style="color: #a020f0;">defvar</span> <span style="color: #0000ff;">end-time</span>)
(<span style="color: #a020f0;">defvar</span> <span style="color: #0000ff;">order</span>) 
<span style="color: #b22222;">;; </span><span style="color: #b22222;">
</span>(<span style="color: #da70d6;">declare</span> timeout break-even trail)

<span style="color: #b22222;">;;</span><span style="color: #b22222;">TODO: when we order, and modify fails, how do we get the error? later :)...
</span>(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">init</span> [{<span style="color: #da70d6;">:keys</span> [type sl price hour lots]}]
  (aif (order! {<span style="color: #da70d6;">:type</span> type <span style="color: #da70d6;">:sl</span> sl <span style="color: #da70d6;">:price</span> price <span style="color: #da70d6;">:lots</span> lots
                })
       {#'end-time (plus (now) (hours hour))
        #'order (atom-hash it)} 
       (<span style="color: #da70d6;">:e</span> it)))  

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">start</span> [args]
  (<span style="color: #a020f0;">cond</span>
   (close? order) (exit <span style="color: #bc8f8f;">"order is now closed"</span>)
   (<span style="color: #da70d6;">=</span> @state <span style="color: #da70d6;">:timeout</span>) (timeout args)
   (<span style="color: #da70d6;">=</span> @state <span style="color: #da70d6;">:break-even</span>) (break-even args)
   (<span style="color: #da70d6;">=</span> @state <span style="color: #da70d6;">:trail</span>) (trail))) 

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">timeout</span> [_]
  (<span style="color: #a020f0;">cond</span>
   <span style="color: #b22222;">;;</span><span style="color: #b22222;">changed to market
</span>   (market? order)
   (<span style="color: #a020f0;">do</span> (<span style="color: #da70d6;">reset!</span> state <span style="color: #da70d6;">:break-even</span>) (out <span style="color: #bc8f8f;">"order opened - monitoring tp1"</span>))
   <span style="color: #b22222;">;;</span><span style="color: #b22222;">entry order reach sl 
</span>   (<span style="color: #a020f0;">if</span> (sell? order) (<span style="color: #da70d6;">&gt;</span> (close) (<span style="color: #da70d6;">:sl</span> order)) (<span style="color: #da70d6;">&lt;</span> (close) (<span style="color: #da70d6;">:sl</span> order)))
   <span style="color: #b22222;">;;</span><span style="color: #b22222;">TODO: reliable delete????
</span>   (awhen (delete! order) (exit <span style="color: #bc8f8f;">"entry order reached sl. deleting ..."</span>))
   <span style="color: #b22222;">;;</span><span style="color: #b22222;">timed out
</span>   (after? (now) end-time)
   (awhen (delete! order) (exit <span style="color: #bc8f8f;">"order timed out"</span>))))

<span style="color: #b22222;">;;</span><span style="color: #b22222;">TODO: better sl saving 
</span>(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">break-even</span> [{<span style="color: #da70d6;">:keys</span> [sl tp2 tp1]}]
  (<span style="color: #a020f0;">if</span> (hit? order tp1)
    (<span style="color: #a020f0;">do</span> (out <span style="color: #bc8f8f;">"closing to half ..."</span>) 
        (awhen (<span style="color: #a020f0;">-&gt;</span> (modify! order {<span style="color: #da70d6;">:sl</span> (<span style="color: #da70d6;">:break</span> order)})
                   (close! (lot (<span style="color: #da70d6;">/</span> (<span style="color: #da70d6;">:lots</span> order) 2))))               
               (out <span style="color: #bc8f8f;">"trailing order"</span>) (<span style="color: #da70d6;">reset!</span> state <span style="color: #da70d6;">:trail</span>)))
    (modify! order {<span style="color: #da70d6;">:sl</span> sl})))  

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">hh</span> [a]
  (<span style="color: #da70d6;">apply</span> max (<span style="color: #da70d6;">map</span> high (<span style="color: #da70d6;">range</span> 1 (<span style="color: #da70d6;">inc</span> a)))))
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">ll</span> [a]
  (<span style="color: #da70d6;">apply</span> min (<span style="color: #da70d6;">map</span> low (<span style="color: #da70d6;">range</span> 1 (<span style="color: #da70d6;">inc</span> a)))))
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">trail</span> []
  (modify! order {<span style="color: #da70d6;">:sl</span> (omax order (<span style="color: #da70d6;">:sl</span> order)  (<span style="color: #a020f0;">if</span> (sell? order) (hh 3) (ll 3)))})) 
<span style="color: #b22222;">;;;</span><span style="color: #b22222;">GUI
</span>(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">init-gui</span> [] 
  (<span style="color: #a020f0;">let</span> [panel (JPanel.)
        text (JTextArea. 20 30)
        risk (JTextField. <span style="color: #bc8f8f;">"1"</span> 7)
        frame (jframe <span style="color: #bc8f8f;">"timeout ea"</span>)]
    (<span style="color: #a020f0;">doto</span> frame
      (.add (miglayout
             panel <span style="color: #da70d6;">:layout</span> <span style="color: #bc8f8f;">"center"</span> <span style="color: #da70d6;">:column</span> <span style="color: #bc8f8f;">"center"</span> <span style="color: #da70d6;">:row</span> <span style="color: #bc8f8f;">"center"</span>
             (JLabel. <span style="color: #bc8f8f;">"paste email text"</span>) <span style="color: #da70d6;">:wrap</span>
             (JScrollPane. text) <span style="color: #bc8f8f;">"span,grow"</span> <span style="color: #da70d6;">:wrap</span>
             risk (JLabel. <span style="color: #bc8f8f;">"% risk"</span>) <span style="color: #da70d6;">:wrap</span>
             (<span style="color: #a020f0;">doto</span> (JButton. <span style="color: #bc8f8f;">"ok"</span>)
               (add-action-listener
                (<span style="color: #da70d6;">fn</span> [e]
                  (<span style="color: #a020f0;">try</span>
                    (<span style="color: #a020f0;">let</span> [risk (Double/parseDouble (.getText risk))
                          parsed (match-method risk (.getText text))]
                      (<span style="color: #a020f0;">if</span> (<span style="color: #da70d6;">=</span> 0 (<span style="color: #da70d6;">:lots</span> parsed))
                        (inform <span style="color: #bc8f8f;">"not enough $ to trade order %s"</span> parsed)
                        (<span style="color: #a020f0;">if</span> parsed
                          (<span style="color: #a020f0;">when</span> (prompt <span style="color: #bc8f8f;">"is order %s ok?"</span> parsed)
                            (with-out-str+ out
                              (<span style="color: #a020f0;">if-not</span> (run parsed) 
                                (inform <span style="color: #bc8f8f;">"failed to run ea %s"</span> (<span style="color: #da70d6;">str</span> out))
                                (.setVisible frame false)))) 
                          (inform <span style="color: #bc8f8f;">"failed to match input text"</span>))))
                    (<span style="color: #a020f0;">catch</span> Exception e (inform <span style="color: #bc8f8f;">"invalid risk %s"</span> (.getText risk)))))))
             <span style="color: #bc8f8f;">"w 50%"</span>
             (<span style="color: #a020f0;">doto</span> (JButton. <span style="color: #bc8f8f;">"cancel"</span>)
               (add-action-listener (<span style="color: #da70d6;">fn</span> [_] (.setVisible frame false))))
             <span style="color: #bc8f8f;">"w 50%"</span>))
      (.pack)
      (.setVisible true))))
</pre></div>






<div class="org-src-container"><label class="org-src-name">timeout-ea-utils()</label><pre class="src src-clojure">
(clojure.core/<span style="color: #da70d6;">use</span> 'nstools.ns)
(ns+ forex.examples.timeout-ea.utils
     (<span style="color: #da70d6;">:clone</span> forex.default)
     (<span style="color: #da70d6;">:use</span> forex.util.general)) 

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">price</span>
  ([val] (price val (env <span style="color: #da70d6;">:symbol</span>)))
  ([val symbol] 
     (<span style="color: #da70d6;">*</span> (mode-tickvalue symbol) (point val)))) 
<span style="color: #b22222;">;;;;;;;;;;;;;;;;;;;;;;;;;;;;;</span><span style="color: #b22222;">
</span>(<span style="color: #a020f0;">def</span> <span style="color: #0000ff;">method-regex</span>
  (<span style="color: #da70d6;">re-pattern</span> (.replaceAll
               (<span style="color: #da70d6;">str</span> <span style="color: #bc8f8f;">"(?i)\\s*(Propulsion|Pip Reactor|Impulse|Spring)\\s+Method"</span>
                    <span style="color: #bc8f8f;">".+running on (\\w+/\\w+)"</span>
                    <span style="color: #bc8f8f;">".+generated a (Buy|Sell) Signal @ (\\d{0,15}\\.\\d{0,15})"</span>
                    <span style="color: #bc8f8f;">".+Stop @ (\\d{0,15}\\.\\d{0,15})"</span>
                    <span style="color: #bc8f8f;">".+(?:1st|First) Limit @ (\\d{0,15}\\.\\d{0,15})"</span>
                    <span style="color: #bc8f8f;">".+(?:2nd|Second) Limit @ (\\d{0,15}\\.\\d{0,15})"</span>) 
               <span style="color: #bc8f8f;">"\\s+"</span> <span style="color: #bc8f8f;">"\\\\s+"</span>)))

(<span style="color: #a020f0;">defmacro</span> <span style="color: #0000ff;">catch-un</span> [&amp; body]
  `(<span style="color: #a020f0;">try</span> (<span style="color: #a020f0;">do</span> ~@body) (<span style="color: #a020f0;">catch</span> Exception e#
                      (.printStackTrace e#) (warn <span style="color: #bc8f8f;">"caught unexpected error: %s"</span> e#))))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">match-method</span> [risk-percent s]
  (<span style="color: #a020f0;">when</span> s 
    (debugging <span style="color: #bc8f8f;">"Matching Profit Multiplier Trade: "</span>
               (catch-un 
                (<span style="color: #a020f0;">when-let</span> [it (<span style="color: #da70d6;">first</span> (<span style="color: #da70d6;">re-seq</span> method-regex (.replaceAll s <span style="color: #bc8f8f;">"[\\r\\n]+"</span> <span style="color: #bc8f8f;">" "</span>)))]
                  (<span style="color: #a020f0;">let</span> [[method-type symbol type price stop tp1 tp2] (<span style="color: #da70d6;">rest</span> it)
                        method (.toLowerCase method-type)
                        symbol (.replaceAll symbol <span style="color: #bc8f8f;">"/"</span> <span style="color: #bc8f8f;">""</span>)]
                    {<span style="color: #da70d6;">:method</span> method
                     <span style="color: #da70d6;">:hour</span> (<span style="color: #a020f0;">if</span> (<span style="color: #da70d6;">=</span> method <span style="color: #bc8f8f;">"pip reactor"</span>) 4 12) 
                     <span style="color: #da70d6;">:symbol</span> symbol
                     <span style="color: #da70d6;">:type</span> (<span style="color: #a020f0;">condp</span> = (.toLowerCase type)
                               <span style="color: #bc8f8f;">"buy"</span> <span style="color: #da70d6;">:buy-stop</span>
                               <span style="color: #bc8f8f;">"sell"</span> <span style="color: #da70d6;">:sell-stop</span>)
                     <span style="color: #da70d6;">:price</span> (Double/parseDouble price)
                     <span style="color: #da70d6;">:sl</span> (Double/parseDouble stop)
                     <span style="color: #da70d6;">:lots</span> (risk risk-percent
                                 (Double/parseDouble stop)
                                 (Double/parseDouble price)
                                 symbol)
                     <span style="color: #da70d6;">:tp1</span> (Double/parseDouble tp1)
                     <span style="color: #da70d6;">:tp2</span> (Double/parseDouble tp2)}))))))
</pre></div>






<div class="org-src-container"><label class="org-src-name">renko()</label><pre class="src src-clojure">
(clojure.core/<span style="color: #da70d6;">use</span> 'nstools.ns)
(ns+ forex.examples.renko.renko
     (<span style="color: #da70d6;">:clone</span> forex.default) 
     (<span style="color: #da70d6;">:use</span> forex.util.general)) 
(register-ea) 
<span style="color: #b22222;">;;</span><span style="color: #b22222;">TODO: *ea-stop* already refers to: #'forex.module.ea/*ea-stop* in namespace: forex.default 
</span><span style="color: #b22222;">;;</span><span style="color: #b22222;">TODO: on GBP/JPY, why did it enter so late???? 
</span><span style="color: #b22222;">;;</span><span style="color: #b22222;">TODO!!!: speed up ns+ by alot! and dont have it automatically reload it, please!!!
</span>
<span style="color: #b22222;">;;</span><span style="color: #b22222;">TODO: test reusing of account.utils
</span><span style="color: #b22222;">;;</span><span style="color: #b22222;">TODO: defaults per currency
</span>(<span style="color: #a020f0;">def</span> ^{<span style="color: #da70d6;">:var</span> true} <span style="color: #0000ff;">state</span> (<span style="color: #da70d6;">atom</span> <span style="color: #da70d6;">:monitor</span>)) 
(<span style="color: #a020f0;">def</span> ^{<span style="color: #da70d6;">:var</span> true} <span style="color: #0000ff;">order</span> (atom-hash))
(<span style="color: #a020f0;">def</span> ^{<span style="color: #da70d6;">:var</span> true} <span style="color: #0000ff;">trail-time-period</span> 5)

(<span style="color: #a020f0;">def</span> <span style="color: #0000ff;">main</span> (<span style="color: #da70d6;">partial</span> vma [2 2 100 1]))
(<span style="color: #a020f0;">def</span> <span style="color: #0000ff;">signal</span> (<span style="color: #da70d6;">partial</span> vma [2 2 1 1] ))
(<span style="color: #a020f0;">def</span> <span style="color: #0000ff;">middle</span> (<span style="color: #da70d6;">partial</span> vma [2 2 26 1]))
(<span style="color: #a020f0;">def</span> <span style="color: #0000ff;">support</span> (blazan-dynamic-stop [150 70 1 10000] 1))
(<span style="color: #a020f0;">def</span> <span style="color: #0000ff;">resistance</span> (blazan-dynamic-stop [150 70 1 10000] 0))

<span style="color: #b22222;">;;</span><span style="color: #b22222;">UTILS
</span>(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">up?</span> [signal i]
  (<span style="color: #a020f0;">let</span> [diff (<span style="color: #da70d6;">-</span> (signal i) (signal (<span style="color: #da70d6;">+</span> i 1)))]
    (<span style="color: #a020f0;">if</span> (<span style="color: #da70d6;">&gt;=</span> diff 0) 
      diff
      false))) 
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">down?</span> [signal i]
  (<span style="color: #a020f0;">let</span> [diff (<span style="color: #da70d6;">-</span> (signal i) (signal (<span style="color: #da70d6;">+</span> i 1)))]
    (<span style="color: #a020f0;">if</span> (<span style="color: #da70d6;">&lt;=</span> diff 0)
      diff
      false)))    
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">reset</span> []
  (<span style="color: #da70d6;">reset!</span> state <span style="color: #da70d6;">:monitor</span>) (<span style="color: #da70d6;">reset!</span> order nil) (out <span style="color: #bc8f8f;">"order closed"</span>))
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">calculate-lots</span> [] (lot (<span style="color: #da70d6;">*</span> 0.01 (<span style="color: #da70d6;">/</span> (account-balance) 100))))
<span style="color: #b22222;">;;</span><span style="color: #b22222;">TODO: use symbol in o for profit! 
</span>(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">profit</span>
  ([o] (wenv {<span style="color: #da70d6;">:symbol</span> (<span style="color: #a020f0;">or</span> (<span style="color: #da70d6;">:symbol</span> o) (env <span style="color: #da70d6;">:symbol</span>))} (profit o (close) (<span style="color: #da70d6;">:break</span> o))))
  ([o a] (profit o a (<span style="color: #da70d6;">:break</span> o)))
  ([o a b] (point (o-- o a b))))

<span style="color: #b22222;">;;</span><span style="color: #b22222;">TODO: exit half when cross middle? enter half more when recross? 
</span><span style="color: #b22222;">;;</span><span style="color: #b22222;">OPEN CONDITION 
</span>(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">open-condition</span> [i]  
  (<span style="color: #a020f0;">if-let</span> [[dir i] (cross? signal main i)]
    (<span style="color: #a020f0;">or</span> (<span style="color: #a020f0;">and</span> (<span style="color: #da70d6;">=</span> dir <span style="color: #da70d6;">:buy</span>) (<span style="color: #da70d6;">&gt;</span> (signal i) (middle i)) {<span style="color: #da70d6;">:type</span> <span style="color: #da70d6;">:buy</span> <span style="color: #da70d6;">:i</span> i <span style="color: #da70d6;">:category</span>  <span style="color: #da70d6;">:long</span> <span style="color: #da70d6;">:state</span> <span style="color: #da70d6;">:init</span>})
        (<span style="color: #a020f0;">and</span> (<span style="color: #da70d6;">=</span> dir <span style="color: #da70d6;">:sell</span>) (<span style="color: #da70d6;">&lt;</span> (signal i) (middle  i)) {<span style="color: #da70d6;">:type</span> <span style="color: #da70d6;">:sell</span> <span style="color: #da70d6;">:i</span> i <span style="color: #da70d6;">:category</span> <span style="color: #da70d6;">:long</span> <span style="color: #da70d6;">:state</span> <span style="color: #da70d6;">:init</span>}))
    (<span style="color: #a020f0;">when-let</span> [[dir i] (cross? signal middle i)]
      (<span style="color: #a020f0;">or</span> (<span style="color: #a020f0;">and</span> (<span style="color: #da70d6;">=</span> dir <span style="color: #da70d6;">:buy</span>) <span style="color: #b22222;">;;</span><span style="color: #b22222;">TODO: better reentry , oui? slope? 
</span>               (<span style="color: #a020f0;">or</span> (<span style="color: #a020f0;">and</span> (<span style="color: #da70d6;">&lt;</span> (middle i) (<span style="color: #228b22;">main</span> i)) (<span style="color: #da70d6;">&gt;</span> (middle (<span style="color: #da70d6;">+</span> i 10)) (<span style="color: #228b22;">main</span> (<span style="color: #da70d6;">+</span> i 10)))
                        {<span style="color: #da70d6;">:type</span> <span style="color: #da70d6;">:buy</span> <span style="color: #da70d6;">:i</span> i <span style="color: #da70d6;">:category</span> <span style="color: #da70d6;">:long</span> <span style="color: #da70d6;">:state</span> <span style="color: #da70d6;">:init</span>}) <span style="color: #b22222;">;;</span><span style="color: #b22222;">the dip
</span>                   (<span style="color: #a020f0;">and</span> (<span style="color: #da70d6;">&lt;=</span> (Math/abs (<span style="color: #da70d6;">-</span> (<span style="color: #228b22;">main</span> i) (middle i))) (pip 20)) (<span style="color: #a020f0;">or</span> (up? main i) (up? main (<span style="color: #da70d6;">+</span> i 1)))
                        (<span style="color: #da70d6;">&gt;</span> (middle i) (<span style="color: #228b22;">main</span> i)) 
                        <span style="color: #b22222;">;;</span><span style="color: #b22222;">{:type :buy :i i :category :scalp}
</span>                        nil
                        ))) <span style="color: #b22222;">;;</span><span style="color: #b22222;">thin 
</span>          (<span style="color: #a020f0;">and</span> (<span style="color: #da70d6;">=</span> dir <span style="color: #da70d6;">:sell</span>)
               (<span style="color: #a020f0;">or</span> (<span style="color: #a020f0;">and</span> (<span style="color: #da70d6;">&gt;</span> (middle i) (<span style="color: #228b22;">main</span> i)) (<span style="color: #da70d6;">&lt;</span> (middle (<span style="color: #da70d6;">+</span> i 10)) (<span style="color: #228b22;">main</span> (<span style="color: #da70d6;">+</span> i 10)))
                        {<span style="color: #da70d6;">:type</span> <span style="color: #da70d6;">:sell</span> <span style="color: #da70d6;">:i</span> i <span style="color: #da70d6;">:category</span> <span style="color: #da70d6;">:long</span> <span style="color: #da70d6;">:state</span> <span style="color: #da70d6;">:init</span>}) <span style="color: #b22222;">;;</span><span style="color: #b22222;">the dip
</span>                   (<span style="color: #a020f0;">and</span> (<span style="color: #da70d6;">&lt;=</span> (Math/abs (<span style="color: #da70d6;">-</span> (<span style="color: #228b22;">main</span> i) (middle i))) (pip 20)) (<span style="color: #a020f0;">or</span> (down? main i) (down? main (<span style="color: #da70d6;">+</span> i 1)))
                        (<span style="color: #da70d6;">&lt;</span> (middle i) (<span style="color: #228b22;">main</span> i))
                        <span style="color: #b22222;">;;</span><span style="color: #b22222;">{:type :sell :i i :category :scalp}
</span>                        nil
                        )))))))   

<span style="color: #b22222;">;;</span><span style="color: #b22222;">ORDER MANAGEMENT
</span>(<span style="color: #a020f0;">defmulti</span> <span style="color: #0000ff;">close-condition</span> (<span style="color: #da70d6;">fn</span> [o &amp; args] (<span style="color: #da70d6;">:category</span> o)))
(<span style="color: #a020f0;">defmulti</span> <span style="color: #0000ff;">check</span> (<span style="color: #da70d6;">fn</span> [o &amp; args] (<span style="color: #da70d6;">:category</span> o)))
<span style="color: #b22222;">;;;</span><span style="color: #b22222;">SCALP ORDER MANAGEMENT
</span>(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">should-close?</span> [{<span style="color: #da70d6;">:keys</span> [type] <span style="color: #da70d6;">:as</span> o}] 
  (<span style="color: #a020f0;">cond</span>
   (<span style="color: #da70d6;">=</span> type <span style="color: #da70d6;">:buy</span>)
   (<span style="color: #a020f0;">or</span> (<span style="color: #da70d6;">&lt;</span> (signal 1) (<span style="color: #228b22;">main</span> 1)) (<span style="color: #da70d6;">&lt;</span> (signal 1) (middle 1)))
   (<span style="color: #da70d6;">=</span> type <span style="color: #da70d6;">:sell</span>)
   (<span style="color: #a020f0;">or</span> (<span style="color: #da70d6;">&gt;</span> (signal 1) (<span style="color: #228b22;">main</span> 1)) (<span style="color: #da70d6;">&gt;</span> (signal 1) (middle 1)))))

<span style="color: #b22222;">;;;</span><span style="color: #b22222;">LONG ORDER MANAGEMENT
</span><span style="color: #b22222;">;;</span><span style="color: #b22222;">TODO: take profit via price action !!!!; if GBPJPY is owning, why not trail on 1 minute level? basically, alot of this take profit stuff and entering
</span><span style="color: #b22222;">;;</span><span style="color: #b22222;">and exiting is based on a variety of conditions! Im sensing some AI like programming taking place! doesn't need to be ai, but how about using
</span><span style="color: #b22222;">;;</span><span style="color: #b22222;">programming which takes into account the context? see http://web.media.mit.edu/~push/ and the phd thesis EM-ONE: An Architecture for Reflective Commonsense Thinking
</span>
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">cci-close?</span>
  <span style="color: #bc8f8f;">"This is a tight virtual stop on the five minute level. 
   For buy, if cci&gt;100, set cross-sl to previous middle value.
   If signal(1) is less than cross-sl, then exit. Opposite for sell"</span>
  [{<span style="color: #da70d6;">:keys</span> [type state] <span style="color: #da70d6;">:as</span> o} period] 
  (<span style="color: #a020f0;">when</span> (<span style="color: #da70d6;">=</span> state <span style="color: #da70d6;">:trail</span>) 
    (wenv {<span style="color: #da70d6;">:period</span> period}    
          <span style="color: #b22222;">;;</span><span style="color: #b22222;">modify cross-sl 
</span>          (<span style="color: #a020f0;">when</span> (<span style="color: #a020f0;">or</span> (<span style="color: #da70d6;">&gt;</span> (cci 30 1) 100) (<span style="color: #da70d6;">&lt;</span> (cci 30 1) -100))
            <span style="color: #b22222;">;;</span><span style="color: #b22222;">we will not update the cross-sl so that it will generate  a close signal, this would be bad!
</span>            (<span style="color: #a020f0;">when</span> (<span style="color: #a020f0;">or</span> (<span style="color: #a020f0;">and</span> (buy? o) (<span style="color: #da70d6;">&gt;</span> (signal 1) (middle 1)))
                      (<span style="color: #a020f0;">and</span> (sell? o) (<span style="color: #da70d6;">&lt;</span> (signal 1) (middle 1))))
              (modify! o {<span style="color: #da70d6;">:cross-sl</span> (middle 1)})))  
          <span style="color: #b22222;">;;</span><span style="color: #b22222;">check close condition
</span>          (<span style="color: #a020f0;">when-let</span> [cross-sl (<span style="color: #da70d6;">:cross-sl</span> o)]
            (<span style="color: #a020f0;">or</span> (<span style="color: #a020f0;">and</span> (buy? o) (<span style="color: #da70d6;">&lt;=</span> (signal 1) cross-sl)) 
                (<span style="color: #a020f0;">and</span> (sell? o) (<span style="color: #da70d6;">&gt;=</span> (signal 1) cross-sl))))))) 

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">close-condition</span> <span style="color: #da70d6;">:long</span> [{<span style="color: #da70d6;">:keys</span> [type state] <span style="color: #da70d6;">:as</span> o}] 
  (<span style="color: #a020f0;">if</span> (<span style="color: #da70d6;">=</span> state <span style="color: #da70d6;">:init</span>)
    (<span style="color: #a020f0;">and</span> (should-close? o)
         (<span style="color: #a020f0;">do</span> (out <span style="color: #bc8f8f;">"init close"</span>) true)) <span style="color: #b22222;">;;</span><span style="color: #b22222;">TODO: GBPUSD screwed up for -30 pips how to effectively close this? how bout pick better entry poitns? or dont pick exhaustion
</span>    (<span style="color: #a020f0;">or</span> (<span style="color: #a020f0;">and</span> (<span style="color: #a020f0;">cond</span>
              (<span style="color: #da70d6;">=</span> type <span style="color: #da70d6;">:buy</span>)
              (<span style="color: #da70d6;">&lt;</span> (signal 1) (<span style="color: #228b22;">main</span> 1))
              (<span style="color: #da70d6;">=</span> type <span style="color: #da70d6;">:sell</span>)
              (<span style="color: #da70d6;">&gt;</span> (signal 1) (<span style="color: #228b22;">main</span> 1)))
             (<span style="color: #a020f0;">do</span> (out <span style="color: #bc8f8f;">"cross close"</span>) true))
        (<span style="color: #a020f0;">and</span> (cci-close? o trail-time-period) (<span style="color: #a020f0;">do</span> (out <span style="color: #bc8f8f;">"cci close"</span>) true))))) 

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">check</span> <span style="color: #da70d6;">:long</span> [o]
  (<span style="color: #a020f0;">when</span> (<span style="color: #a020f0;">and</span> (<span style="color: #da70d6;">&gt;=</span> (profit o) 20) (<span style="color: #da70d6;">not</span> (<span style="color: #da70d6;">=</span> (<span style="color: #da70d6;">:state</span> o) <span style="color: #da70d6;">:trail</span>))) (modify! o {<span style="color: #da70d6;">:state</span> <span style="color: #da70d6;">:trail</span>}) (out <span style="color: #bc8f8f;">"changed to trail"</span>))
  <span style="color: #b22222;">;;</span><span style="color: #b22222;">actual sl the server sees. this is a safety stop, in case our ea gets screwed up, turns off, etc.
</span>  (<span style="color: #a020f0;">when</span> (<span style="color: #a020f0;">or</span> (<span style="color: #da70d6;">=</span> (<span style="color: #da70d6;">:sl</span> o) 0) (<span style="color: #da70d6;">=</span> (<span style="color: #da70d6;">:state</span> o) <span style="color: #da70d6;">:trail</span>))
    (modify! o {<span style="color: #da70d6;">:sl</span> (omax o (<span style="color: #da70d6;">:sl</span> o) (o- o (<span style="color: #228b22;">main</span> 1) (pip 20)))})))  
<span style="color: #b22222;">;;</span><span style="color: #b22222;">(run)
</span><span style="color: #b22222;">;;</span><span style="color: #b22222;">MAIN  
</span>(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">gobble</span> [o] 
  (<span style="color: #a020f0;">if</span> (close? o) 
    (reset)
    (awhen-not (<span style="color: #a020f0;">and</span> (close-condition o) (close! o))
               (check o))))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">monitor</span> []  
  (<span style="color: #a020f0;">when-let</span> [{<span style="color: #da70d6;">:keys</span> [type category] <span style="color: #da70d6;">:as</span> o} (open-condition 0)] 
    (awhen (order! (<span style="color: #da70d6;">merge</span> o  {<span style="color: #da70d6;">:type</span> type <span style="color: #da70d6;">:lots</span> (calculate-lots)})) 
           (<span style="color: #da70d6;">reset!</span> order it)
           (<span style="color: #da70d6;">reset!</span> state <span style="color: #da70d6;">:gobble</span>)   
           (out <span style="color: #bc8f8f;">"entered %s %s order"</span> type category))))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">start</span> [args] 
  (<span style="color: #a020f0;">cond</span>
   (<span style="color: #da70d6;">=</span> @state <span style="color: #da70d6;">:monitor</span>) (monitor)
   (<span style="color: #da70d6;">=</span> @state <span style="color: #da70d6;">:gobble</span>) (gobble order)))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">vars</span> [ea] (<span style="color: #da70d6;">:vars</span> ea))
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">getv</span> [vvar ea] (<span style="color: #da70d6;">get</span> (<span style="color: #da70d6;">:vars</span> ea) vvar))
</pre></div>



</div>
</div>
</div>
<div id="postamble">
<p class="author"> Author: Seth Burleigh
</p>
<p class="date"> Date: 2011-02-20 12:28:25 CST</p>
<p class="creator">HTML generated by org-mode 7.4 in emacs 23</p>
</div>
</div>
</body>
</html>
